////////////////////////////////////////////////////////////////////////////////
// Подсистема "Печать".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Переопределяет таблицу возможных форматов для сохранения табличного документа.
// Вызывается из ОбщегоНазначения.НастройкиФорматовСохраненияТабличногоДокумента()
//
// Параметры
//  ТаблицаФорматов - ТаблицаЗначений:
//                   *  ТипФайлаТабличногоДокумента - ТипФайлаТабличногоДокумента                 - значение в
//                                                                                                  платформе,
//                                                                                                  соответствующее
//                                                                                                  формату;
//                   *  Ссылка                      - ПеречислениеСсылка.ФорматыСохраненияОтчетов - ссылка на
//                                                                                                  метаданные, где
//                                                                                                  хранится
//                                                                                                  представление;
//                   *  Представление               - Строка -                                    - представление типа
//                                                             файла (заполняется из перечисления);
//                   *  Расширение                  - Строка -                                    - тип файла для
//                                                             операционной системы;
//                   *  Картинка                    - Картинка                                    - значок формата.
//
Процедура ПриЗаполненииНастроекФорматовСохраненияТабличногоДокумента(ТаблицаФорматов) Экспорт
	
КонецПроцедуры

// Переопределяет список команд печати, получаемый функцией УправлениеПечатью.КомандыПечатиФормы.
Процедура ПередДобавлениемКомандПечати(ИмяФормы, КомандыПечати, СтандартнаяОбработка) Экспорт
	
КонецПроцедуры

Процедура ДополнитьПараметрыНовогоПисьма(ПараметрыНовогоПисьма, ОбъектыПечати, ПараметрыВывода, ТаблицаПечатныхФорм) Экспорт
	
	ПакетыЭД = Новый Массив;
	СериализуемыеОбъекты = ОбъектыПечати.ВыгрузитьЗначения();
	
	Если ПараметрыВывода.Свойство("ФормироватьЭД") И ПараметрыВывода.ФормироватьЭД Тогда
		Вложения = ПараметрыНовогоПисьма.Вложения;
		
		ПакетыЭД = ЭлектронныеДокументыБП.СериализоватьОбъекты(СериализуемыеОбъекты);
		
		Для Каждого ПакетЭД Из ПакетыЭД Цикл
			Вложения.Добавить(ПакетЭД);
		КонецЦикла;
		
	КонецЕсли;
	
	ОтправкаПочтовыхСообщений.ЗаполнитьТемуПолучателяПисьма(СериализуемыеОбъекты,
		ТаблицаПечатныхФорм,
		ПараметрыНовогоПисьма,
		ПакетыЭД.Количество());
	
КонецПроцедуры

#КонецОбласти
