#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// Обслуживание полей аванса

Функция РазмерностьАванса(СпособРасчетаАванса) Экспорт
	
	Возврат РасчетЗарплатыБазовыйКлиентСервер.РазмерностьАванса(СпособРасчетаАванса);
	
КонецФункции

Функция ПредставлениеСпособаРасчетаАванса(СпособРасчетаАванса, СжатыйФормат) Экспорт
	
	Возврат РасчетЗарплатыБазовыйКлиентСервер.ПредставлениеСпособаРасчетаАванса(СпособРасчетаАванса, СжатыйФормат);
	
КонецФункции

Функция ИменаСпособовРасчетаАванса() Экспорт
	
	Возврат РасчетЗарплатыБазовыйКлиентСервер.ИменаСпособовРасчетаАванса();
	
КонецФункции

Процедура ОбработкаПолученияДанныхВыбораВидовОграниченияПособия(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	РасчетЗарплатыБазовыйКлиентСервер.ОбработкаПолученияДанныхВыбораВидовОграниченияПособия(ДанныеВыбора, Параметры, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти
