
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	КлючеваяОперация = "СозданиеФормыРегламентированнаяОтчетность";
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Раздел", ПредопределенноеЗначение("Перечисление.СтраницыЖурналаОтчетность.Уведомления"));

	ФормаУправлениеОтчетностью = ФормаУправлениеОтчетностью = ОткрытьФорму("ОбщаяФорма.РегламентированнаяОтчетность", ПараметрыОткрытия, ПараметрыВыполненияКоманды.Источник, "1С-Отчетность", ПараметрыВыполненияКоманды.Окно);
	
	Оповестить("Открытие формы 1С-Отчетность", ПараметрыОткрытия);
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("ПоказыватьКнопки", Истина);
	
	ОткрытьФорму("Обработка.ОбщиеОбъектыРегламентированнойОтчетности.Форма.ПредложениеОформитьЗаявлениеНаПодключение", ПараметрыСообщения, ФормаУправлениеОтчетностью, Истина);
	
	ОбщегоНазначенияБПКлиент.ПоказатьПредупреждениеОбИзменениях("АктуальныеВопросыРегламентированнойОтчетности");
	
КонецПроцедуры
