
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Интернет-поддержка пользователей".
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обработчик, вызываемый при начале работы системы.
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	ПараметрыИПП = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиентаПриЗапуске().ИнтернетПоддержкаПользователей;
	
	// Вызов обработчиков подсистем ПриНачалеРаботыСистемы()
	Обработчики = ПараметрыИПП.ПриНачалеРаботыСистемы;
	Для каждого ИмяМодуля Из Обработчики Цикл
		МодульОбработчика = ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяМодуля);
		Если МодульОбработчика <> Неопределено Тогда
			МодульОбработчика.ПриНачалеРаботыСистемы();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

// Выполняет подключение пользователя к сервису Интернет-поддержки
// пользователей: аутентификация пользователя, восстановление пароля
// пользователя, регистрация нового пользователя, регистрация программного
// продукта.
// При успешном завершении процесса подключения Интернет-поддержки, возвращаются
// введенные пользователем логин и пароль через объект ОписаниеОповещения.
//
// Параметры:
//	ОписаниеОповещенияОЗавершении - ОписаниеОповещения - обработчик оповещения о
//		завершении процесса подключения к Интернет-поеддержке. В качестве
//		результата в обработчик оповещения возвращается значение: Неопределено -
//		если подключение Интернет-поддержки не было выполнено успешно; Если
//		пользователь успешно завершил подключение Интернет-поддержки, тогда
//		в обработчик оповещения возвращается объект типа Структура с полями:
//			* Логин - Строка - введенный логин;
//			* Пароль - введенный пароль.
//
Процедура ПодключитьИнтернетПоддержкуПользователей(ОписаниеОповещенияОЗавершении = Неопределено) Экспорт
	
	МестоЗапуска = "connectIPP";
	
	Если ОписаниеОповещенияОЗавершении = Неопределено Тогда
		ОбработчикиРезультата = Неопределено;
	Иначе
		ОбработчикиРезультата = НовыйОбработчикиЗавершенияБизнесПроцесса(МестоЗапуска);
		ОбработчикиРезультата.Вставить("ОповещенияОбАвторизации", Новый Массив);
		ОбработчикиРезультата.ОповещенияОбАвторизации.Добавить(ОписаниеОповещенияОЗавершении);
	КонецЕсли;
	
	ВыполнитьСценарий(МестоЗапуска, , , , ОбработчикиРезультата);
	
КонецПроцедуры

// Открывает форму настройки параметров Интернет-поддержки пользователей.
// Параметры:
//	ВладелецФормы - УправляемаяФорма, Неопределено - владелец открываемой формы
//	БлокироватьОкноВладельца - Булево - Истина, если форма должна быть открыта
//		в режиме блокирования окна владельца.
//
// Возвращаемое значение:
//	УправляемаяФорма - открытая форма параметров Интернет-поддержки
//		пользователей.
//
Функция ОткрытьФормуНастроекПараметровПодключения(
	ВладелецФормы = Неопределено,
	БлокироватьОкноВладельца = Истина) Экспорт
	
	РежимОткрытияОкна = ?(БлокироватьОкноВладельца,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца,
		РежимОткрытияОкнаФормы.Независимый);
	
	Возврат ОткрытьФорму("ОбщаяФорма.ПараметрыПодключенияКИнтернетПоддержке",
		,
		ВладелецФормы,
		Ложь,
		,
		,
		,
		РежимОткрытияОкна);
	
КонецФункции

// Определяет, зарегистрирована ли текущая конфигурация в сервисе
// Интернет-поддержки.
//
// Параметры:
//	ОшибкаОбращенияКВебСервису - Булево - в параметре возвращается Истина,
//		если в процессе обращения к сервису ИПП произошла ошибка
//		и "зарегистрированность" конфигурации проверить не удалось;
//
// Возвращаемое значение:
//	Булево - Истина, если конфигурация зарегистрирована в сервисе ИПП,
//		Ложь - если не зарегистрирована или в процессе обращения к сервису ИПП
//			произошла ошибка;
//
Функция КонфигурацияЗарегистрированаВСервисеИПП(ОшибкаОбращенияКВебСервису = Ложь) Экспорт
	
	ОбращениеССервера = Ложь;
	ПараметрыИПП      = Неопределено;
	КонфигурацияЗарегистрирована = ИнтернетПоддержкаПользователейВызовСервера.КонфигурацияЗарегистрированаВСервисеИПП(
		ОбращениеССервера,
		ПараметрыИПП,
		ОшибкаОбращенияКВебСервису);
	
	Если ОбращениеССервера Тогда
		
		Возврат КонфигурацияЗарегистрирована;
		
	Иначе
		
		// Обращение к веб-сервису ИПП из клиента 1С:Предприятия
		Возврат ИнтернетПоддержкаПользователейКлиентСервер.КонфигурацияЗарегистрированаВСервисеИПП(
			ОшибкаОбращенияКВебСервису,
			,
			ПараметрыИПП);
		
	КонецЕсли;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Устаревший программный интерфейс

// Устарела. Будет удалена в следующей версии библиотеки.
// Следует использовать
// МониторИнтернетПоддержкиКлиент.ОткрытьМониторИнтернетПоддержки()
// Открытие монитора Интернет-поддержки из меню.
//
// Параметры:
// СтартовыеПараметры - Структура - передаваемые стартовые параметры,
//	ключ структуры - имя параметра, значение - значение параметра.
//
Процедура СтартоватьМеханизмИзМеню(СтартовыеПараметры = Неопределено) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.МониторИнтернетПоддержки") Тогда
		
		ВызватьИсключение НСтр("ru = 'Ошибка встраивания. Отсутствует подсистема ""Монитор Интернет-поддержки пользователей"".'");
		
	Иначе
		
		ОбщийМодульМониторИПП = ОбщегоНазначенияКлиент.ОбщийМодуль("МониторИнтернетПоддержкиКлиент");
		ОбщийМодульМониторИПП.ОткрытьМониторИнтернетПоддержки(СтартовыеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

// Устарела. Будет удалена в следующей версии библиотеки.
// Следует использовать процедуру
// ПодключитьИнтернетПоддержкуПользователей().
// Будет удалена из программного интерфейса в следующей версии библиотеки.
// Подключение Интернет-поддержки пользователей (или смена пользователя ИПП)
// из формы настроек ИПП.
//
// Параметры:
// СтартовыеПараметры - Структура - передаваемые стартовые параметры,
//	ключ структуры - имя параметра, значение - значение параметра.
//
Процедура ПодключитьИнтернетПоддержку(СтартовыеПараметры = Неопределено) Экспорт
	
	МестоЗапуска = "connectIPP";
	
	// Выполнение сценария интерент-поддержки.
	ВыполнитьСценарий(МестоЗапуска, СтартовыеПараметры);
	
КонецПроцедуры

// Устарела. Будет удалена в следующей версии библиотеки.
// Следует использовать
// Подключение1СТакскомКлиент.СтартоватьМеханизмРаботыСОператоромЭДО().
// Запуск механизма работы с сервисом оператора ЭДО.
//
// Параметры:
// СертификатЭП - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - сертификат ЭП;
// Организация - Произвольный - организация, организация, с которой связан
//		сертификат;
// ВариантБизнесПроцесса - Строка - имя действия ЭДО.Возможные значения:
//		"taxcomGetID"  - запуск получения (регистрации) нового идентификатора
//		"taxcomPrivat" - вход в личный кабинет абонента ЭДО.
// ИдентификаторОрганизации - Строка - идентификатор организации в системе ЭДО;
// ПарольСертификатаЭП - Строка, Неопределено - пароль используемого
//		во избежание повторного ввода пароля;
// УникальныйИдентификаторФормы (УникальныйИдентификатор) - идентификатор формы,
//	из которой был вызван метод. Используется как источник события при
//	оповещении формы-инициатора о результате.
//
Процедура СтартоватьМеханизмРаботыСОператоромЭДО(
	СертификатЭП,
	Организация,
	ВариантБизнесПроцесса,
	ИдентификаторОрганизации = "",
	ПарольСертификатаЭП = Неопределено,
	УникальныйИдентификаторФормы = Неопределено) Экспорт
	
	Если НЕ ОбщегоНазначенияКлиент.ПодсистемаСуществует("ИнтернетПоддержкаПользователей.Подключение1СТакском") Тогда
		
		ВызватьИсключение НСтр("ru = 'Ошибка встраивания. Отсутствует подсистема ""Подключение 1С-Такском"".'");
		
	Иначе
		
		ОбщийМодуль1СТакском = ОбщегоНазначенияКлиент.ОбщийМодуль("Подключение1СТакскомКлиент");
		ОбщийМодуль1СТакском.СтартоватьМеханизмРаботыСОператоромЭДО(
			СертификатЭП,
			Организация,
			ВариантБизнесПроцесса,
			ИдентификаторОрганизации,
			ПарольСертификатаЭП,
			УникальныйИдентификаторФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

// Выполнение сценария запуска механизма Интернет-поддержки пользователей.
//
// Параметры:
//	МестоЗапуска - Строка - место запуска механизма, из которого определяется
//		необходимый бизнес-процесс.
//	СтартовыеПараметры - Структура - стартовые параметры механизма.
//		ключ структуры соответствует имени параметра, значение - значению
//		параметра. Состав параметров произвольный;
//	Повторно - Булево - признак того, что механизм запускается из формы ошибки
//		подключения (ИнтернетПоддержкаПользователейОшибкаДоступаКИнтернету)
//		кнопкой "Повторить подключение";
//	КонтекстВзаимодействия - Структура, ФиксированнаяСтруктура, Неопределено
//		- готовый контекст для старта бизнес-процесса.
//	ОбработчикиЗавершенияБизнесПроцесса - Структура - обработчики оповещения о
//		завершении бизнес-процесса (см. функцию
//		НовыйОбработчикиЗавершенияБизнесПроцесса())
//
Процедура ВыполнитьСценарий(
	МестоЗапуска,
	СтартовыеПараметры = Неопределено,
	Повторно = Ложь,
	КонтекстВзаимодействия = Неопределено,
	ОбработчикиЗавершенияБизнесПроцесса = Неопределено) Экспорт
	
	Если КонтекстВзаимодействия <> Неопределено Тогда
		
		Если КонтекстВзаимодействия.Свойство("УправляющаяСтруктураЗапуска") Тогда
			ОбработатьСтруктуруЗапускаИПП(МестоЗапуска, КонтекстВзаимодействия.УправляющаяСтруктураЗапуска);
			ОповеститьОЗавершенииБизнесПроцесса(ОбработчикиЗавершенияБизнесПроцесса, Неопределено);
			Возврат;
		КонецЕсли;
		
		ПараметрыСозданияКонтекста = Неопределено;
		
	Иначе
		
		ПараметрыСозданияКонтекста = Новый Структура(
			"МестоЗапуска, ПовторныйЗапуск, СтартовыеПараметры",
			МестоЗапуска,
			Повторно,
			СтартовыеПараметры);
		
	КонецЕсли;
	
	Попытка
		
		ВызовСервиса(КонтекстВзаимодействия, ПараметрыСозданияКонтекста, ОбработчикиЗавершенияБизнесПроцесса);
		
	Исключение
		
		Если КонтекстВзаимодействия <> Неопределено Тогда
			ПриНачалеРаботыСистемы = КонтекстВзаимодействия.КСКонтекст.ПриНачалеРаботыСистемы;
		Иначе
			ПриНачалеРаботыСистемы = Ложь;
		КонецЕсли;
		
		ИнтернетПоддержкаПользователейВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОткрытьФорму("ОбщаяФорма.ИнтернетПоддержкаПользователейОшибкаДоступаКИнтернету",
			Новый Структура("МестоЗапуска, СтартовыеПараметры, ОписаниеОшибки, ПриНачалеРаботыСистемы",
				МестоЗапуска,
				СтартовыеПараметры,
				НСтр("ru = 'Неизвестная ошибка. Подробнее см. в журнале регистрации.'"),
				ПриНачалеРаботыСистемы));
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Возвращает клиентский обработчик бизнес-процесса.
// Параметры:
//	МестоЗапуска - Строка - точка входа в бизнес-процесс;
//	ИмяСобытия - Строка - имя обрабатываемого события.
//
// Возвращаемое значение:
//	ОбщийМодуль - модуль, реализующий обработчик бизнес-процесса.
//	Неопределено - если отсутствует обработчик бизнес-процесса.
//
Функция КлиентскийОбработчикБизнесПроцесса(МестоЗапуска, ИмяСобытия) Экспорт
	
	Если ИнтернетПоддержкаПользователейКлиентСервер.ЭтоБазовыйБизнесПроцесс(МестоЗапуска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ИнтернетПоддержкаПользователей;
	КлиентскиеОбработчики  = ПараметрыРаботыКлиента.КлиентскиеОбработчикиБизнесПроцессов;
	
	ИмяМодуля = КлиентскиеОбработчики.Получить(МестоЗапуска + "\" + ИмяСобытия);
	
	Если ИмяМодуля = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначенияКлиент.ОбщийМодуль(ИмяМодуля);
	
КонецФункции

// Выполняет действия при запрете запуска ИПП по каким-либо причинам.
// Параметры:
//	МестоЗапуска - Строка - имя кнопки запуска ИПП;
//	СтруктураЗапуска - Структура - управляющая структура запуска.
//		(см. функцию  ОпределитьВозможностьЗапускаПоМестуИПараметрам()
//		общего модуля ИнтернетПоддержкаПользователейКлиентСервер)
//
Процедура ОбработатьСтруктуруЗапускаИПП(МестоЗапуска, Знач СтруктураЗапуска) Экспорт
	
	Если СтруктураЗапуска = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураЗапуска.Действие = "Возврат" Тогда
		
		Состояние();
		
	ИначеЕсли СтруктураЗапуска.Действие = "ПоказатьСообщение" Тогда
		
		Состояние();
		
		Если СтруктураЗапуска.ПриНачалеРаботыСистемы Тогда
			ПоказатьОповещениеПользователя(НСтр("ru = 'Интернет-поддержка пользователей'"),
				,
				СтруктураЗапуска.Сообщение,
				БиблиотекаКартинок.ИнтернетПоддержкаПользователей);
		Иначе
			ПоказатьПредупреждение(,
				СтруктураЗапуска.Сообщение,
				,
				НСтр("ru = 'Интернет-поддержка пользователей'"));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Общая (универсальная) процедура для запуска бизнес-процесса
// Интернет-поддержки пользователей.
//
// Параметры:
//	МестоЗапуска - Строка - место запуска механизма (имя кнопки);
//	СтартовыеПараметры - Структура - стартовые параметры механизма.
//		ключ структуры соответствует имени параметра, значение - значению
//		параметра.
//	Повторно - Булево - признак того, что механизм запускается из формы ошибки
//		подключения (ИнтернетПоддержкаПользователейОшибкаДоступаКИнтернету)
//		кнопкой "Повторить подключение"
//
Процедура СтартоватьМеханизм(МестоЗапуска, СтартовыеПараметры = Неопределено, Повторно = Ложь) Экспорт
	
	// Выполнение сценария интерент-поддержки.
	ВыполнитьСценарий(МестоЗапуска, СтартовыеПараметры, Повторно);
	
КонецПроцедуры

// Открывает Интернет-страницу в обозревателе.
//
// Параметры:
//	АдресСтраницы - Строка - URL-адрес открываемой страницы;
//	ЗаголовокОкна - Строка - заголовок открываемой страницы,
//		если для открытия страницы используется внутренняя форма конфигурации.
//
Процедура ОткрытьИнтернетСтраницу(АдресСтраницы, ЗаголовокОкна) Экспорт
	
	СтрандартнаяОбработка = Истина;
	ИнтернетПоддержкаПользователейКлиентПереопределяемый.ОткрытьИнтернетСтраницу(
		АдресСтраницы,
		ЗаголовокОкна,
		СтрандартнаяОбработка);
	
	Если СтрандартнаяОбработка = Истина Тогда
		// Открытие Интернет-страницы стандартным способом
		ОбщегоНазначенияКлиент.ПерейтиПоСсылке(АдресСтраницы);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Обработка команд сервиса ИПП

// Вызывается стартовым механизмом для выполнения первого обращения к
// веб-сервису ИПП и получения команд от веб-сервиса для дальнейшего
// их выполнения.
//
// Параметры:
//	ПодготовленныйКонтекстВзаимодействия - Структура, ФиксированнаяСтруктура,
//		Неопределено - подготовленный контекст;
//	ПараметрыСозданияКонтекста - Структура - параметры создания
//		нового контекста взаимодействия, если контекст не существует;
//	ОбработчикиЗавершенияБизнесПроцесса - Структура - обработчики оповещения о
//		завершении бизнес-процесса (см. функцию
//		НовыйОбработчикиЗавершенияБизнесПроцесса())
//
Процедура ВызовСервиса(
	ПодготовленныйКонтекстВзаимодействия,
	ПараметрыСозданияКонтекста,
	ОбработчикиЗавершенияБизнесПроцесса)
	
	Если ПодготовленныйКонтекстВзаимодействия = Неопределено Тогда
		
		КонтекстВзаимодействия = Неопределено;
		
	Иначе
		
		Если ТипЗнч(ПодготовленныйКонтекстВзаимодействия) = Тип("ФиксированнаяСтруктура") Тогда
			КонтекстВзаимодействия = ЗначениеИзФиксированногоТипа(ПодготовленныйКонтекстВзаимодействия);
		Иначе
			КонтекстВзаимодействия = ПодготовленныйКонтекстВзаимодействия;
		КонецЕсли;
		
		КонтекстВзаимодействия.Вставить("ОбработчикиЗавершенияБизнесПроцесса",
			ОбработчикиЗавершенияБизнесПроцесса);
		
	КонецЕсли;
	
	// Параметры, передаваемые сервису при первом вызове и сохраняемые на стороне
	// сервера ИПП в сеансовых переменных.
	ДополнительныеСтартовыеПараметры = Новый Массив;
	ДополнительныеСтартовыеПараметры.Добавить("libraryVersion");
	ДополнительныеСтартовыеПараметры.Добавить("APIVersion");
	ДополнительныеСтартовыеПараметры.Добавить("versionConfiguration");
	ДополнительныеСтартовыеПараметры.Добавить("versionPlatform");
	ДополнительныеСтартовыеПараметры.Добавить("nameConfiguration");
	ДополнительныеСтартовыеПараметры.Добавить("language");
	ДополнительныеСтартовыеПараметры.Добавить("enterPoint");
	
	ОбработкаКомандСервиса(
		КонтекстВзаимодействия,
		Неопределено,
		Неопределено,
		,
		,
		ДополнительныеСтартовыеПараметры,
		,
		ПараметрыСозданияКонтекста,
		ОбработчикиЗавершенияБизнесПроцесса);
	
КонецПроцедуры

// Процедура получает команды от веб-сервиса и выполняет их на стороне клиента
// или передает управление серверу 1С:Предприятия.
//
// Параметры:
// КонтекстВзаимодействия - Структура - контекст взаимодействия с
//		сервисом ИПП (см. функцию ИнтернетПоддержкаПользователейВызовСервера.НовыйКонтекстВзаимодействия()).
// ТекущаяФорма - УправляемаяФорма - форма, вызвавшая метод для выполнения
//		команд сервиса;
// ПараметрыЗапроса - Массив - массив элементов типа Структура:
//		* Имя - Строка - имя параметра;
//		* Значение - Произвольный - значение параметра;
//		* БизнесПроцесс - Строка - имя бизнес-процесса, к которому относится параметр;
// КонтекстОбработчика - Структура - контекст обработчика команд (см. функцию
//		ИнтернетПоддержкаПользователейКлиентСервер.НовыйКонтекстОбработчикаКоманд();
// ПараметрыОбращенияКСервисуИПП - Структура - дополнительные параметры
//		обращения к сервису ИПП:
//	* ОбработатьОтвет - Булево - Истина, если необходимо обработать ответ
//			сервиса;
//	* ОтобразитьСостояниеОбращения - Булево - Истина, если необходимо отобразить
//			состояние обращения к сервису ИПП;
//	* ОчиститьСессиюПередВыполнениемЗапроса - Булево - Истина, если перед
//			выполнением запроса необходимо удалить сессионные параметры;
// ПродолжитьВыполнение - Булево - Истина, если необходимо продолжить выполнение
//		без обращения к сервису ИПП;
// ОбработчикиЗавершенияБизнесПроцесса - Структура - обработчики оповещения о
//		завершении бизнес-процесса (см. функцию
//		НовыйОбработчикиЗавершенияБизнесПроцесса())
//
Процедура ОбработкаКомандСервиса(
	КонтекстВзаимодействия,
	ТекущаяФорма,
	ПараметрыЗапроса,
	КонтекстОбработчика = Неопределено,
	ПараметрыОбращенияКСервисуИПП = Неопределено,
	ДополнительныеПараметрыЗапроса = Неопределено,
	ПродолжитьВыполнение = Ложь,
	ПараметрыСозданияКонтекста = Неопределено,
	ОбработчикиЗавершенияБизнесПроцесса = Неопределено) Экспорт
	
	ОтобразитьСостояниеОбращения = Истина;
	ОбработатьОтвет              = Истина;
	НеобходимоОчиститьСессию     = Ложь;
	
	Если ТипЗнч(ПараметрыОбращенияКСервисуИПП) = Тип("Структура") Тогда
		
		Если ПараметрыОбращенияКСервисуИПП.Свойство("ОбработатьОтвет") Тогда
			ОбработатьОтвет = ПараметрыОбращенияКСервисуИПП.ОбработатьОтвет;
		КонецЕсли;
		
		Если ПараметрыОбращенияКСервисуИПП.Свойство("ОтобразитьСостояниеОбращения") Тогда
			ОтобразитьСостояниеОбращения = ПараметрыОбращенияКСервисуИПП.ОтобразитьСостояниеОбращения;
		КонецЕсли;
		
		Если ПараметрыОбращенияКСервисуИПП.Свойство("ОчиститьСессиюПередВыполнениемЗапроса") Тогда
			НеобходимоОчиститьСессию = ПараметрыОбращенияКСервисуИПП.ОчиститьСессиюПередВыполнениемЗапроса;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ОтобразитьСостояниеОбращения = Истина Тогда
		ОтобразитьСостояниеОбращениеКСервису();
	КонецЕсли;
	
	Если НеобходимоОчиститьСессию = Истина И КонтекстВзаимодействия <> Неопределено Тогда
		ОчиститьСессию(КонтекстВзаимодействия);
	КонецЕсли;
	
	// Если контекст обработчика команд не задан, тогда необходимо подготовить его структуру.
	Если КонтекстОбработчика = Неопределено Тогда
		// Создание контекста обработчика команд
		КонтекстОбработчика = ИнтернетПоддержкаПользователейКлиентСервер.НовыйКонтекстОбработчикаКоманд();
	КонецЕсли;
	
	Если КонтекстВзаимодействия = Неопределено Тогда
		ОсновныеПараметры = Неопределено;
	Иначе
		ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	КонецЕсли;
	
	Если НЕ ПродолжитьВыполнение Тогда
		
		Если ПараметрыЗапроса = Неопределено Тогда
			ПараметрыЗапроса = Новый Массив;
		КонецЕсли;
		
		// Если выполняется первое обращение, тогда необходимо
		// получить команды от веб-сервиса
		
		Если КонтекстВзаимодействия = Неопределено Тогда
			
			// Обработка первого запуска при незаданном контексте взаимодействия
			// создание на стороне сервера ИБ контекста взаимодействия и первое
			// обращение к сервису ИПП (для минимизации клиент-серверных вызовов)
			ИнтернетПоддержкаПользователейВызовСервера.ОбработкаКомандСервиса(
				Неопределено,
				ПараметрыЗапроса,
				КонтекстОбработчика,
				Ложь,
				ПараметрыОбращенияКСервисуИПП,
				ДополнительныеПараметрыЗапроса,
				КонтекстВзаимодействия,
				ПараметрыСозданияКонтекста);
			
			Если КонтекстВзаимодействия.Свойство("УправляющаяСтруктураЗапуска") Тогда
				ОбработатьСтруктуруЗапускаИПП(ПараметрыСозданияКонтекста.МестоЗапуска,
					КонтекстВзаимодействия.УправляющаяСтруктураЗапуска);
				ОповеститьОЗавершенииБизнесПроцесса(ОбработчикиЗавершенияБизнесПроцесса, Неопределено);
				Возврат;
			КонецЕсли;
			
			КонтекстВзаимодействия.Вставить("ОбработчикиЗавершенияБизнесПроцесса",
				ОбработчикиЗавершенияБизнесПроцесса);
			
			ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
			Если НЕ ОсновныеПараметры.ОбращениеССервера Тогда
				
				ИнтернетПоддержкаПользователейКлиентСервер.ДобавитьСессионныеПараметрыКЗапросу(
					КонтекстВзаимодействия.КСКонтекст,
					ДополнительныеПараметрыЗапроса,
					ПараметрыЗапроса);
				
				ДобавитьКомандыСервиса(
					КонтекстВзаимодействия,
					ПараметрыЗапроса,
					КонтекстОбработчика);
				
			КонецЕсли;
			
		Иначе
			
			// При последующих запусках все выполняется в штатном режиме
			
			Если ОсновныеПараметры.ОбращениеССервера Тогда
				
				ИнтернетПоддержкаПользователейВызовСервера.ОбработкаКомандСервиса(
					КонтекстВзаимодействия.КСКонтекст,
					ПараметрыЗапроса,
					КонтекстОбработчика,
					Ложь,
					ПараметрыОбращенияКСервисуИПП,
					ДополнительныеПараметрыЗапроса);
				
			Иначе
				
				ИнтернетПоддержкаПользователейКлиентСервер.ДобавитьСессионныеПараметрыКЗапросу(
					КонтекстВзаимодействия.КСКонтекст,
					ДополнительныеПараметрыЗапроса,
					ПараметрыЗапроса);
				
				ДобавитьКомандыСервиса(
					КонтекстВзаимодействия,
					ПараметрыЗапроса,
					КонтекстОбработчика);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Если обрабатывать ответ сервиса не требуется, тогда возврат
	Если ОбработатьОтвет <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ПрерватьОбработкуКоманд = Ложь;
	Попытка
		
		Пока КонтекстОбработчика.Команды.Количество() > 0
			И НЕ КонтекстОбработчика.ПроизошлаОшибка
			И НЕ КонтекстОбработчика.ВыполнитьОстановку
			И НЕ ПрерватьОбработкуКоманд Цикл
			
			ТекущаяКоманда = КонтекстОбработчика.Команды[0];
			ТипКоманды = ИнтернетПоддержкаПользователейКлиентСервер.ТипКоманды(
				ТекущаяКоманда,
				ОсновныеПараметры.ОбращениеССервера,
				ОсновныеПараметры.МестоЗапуска);
			
			Если ТипКоманды = -1 Тогда
				// Если тип команды (клиентская или серверная) определить не удалось,
				// тогда пропустить команду
				КонтекстОбработчика.Команды.Удалить(0);
				Продолжить;
				
			ИначеЕсли ТипКоманды = 1 Тогда
				
				// Выполнение команды на клиенте
				КонтекстОбработчика.Команды.Удалить(0);
				ВыполнитьКомандуСервиса(
					КонтекстВзаимодействия,
					ТекущаяФорма,
					ТекущаяКоманда,
					КонтекстОбработчика,
					ПрерватьОбработкуКоманд);
				
			Иначе
				// Если команда серверная, тогда передать управление серверу 1С:Предприятия
				// При повторном вызове, обращение к веб-сервису не выполняется
				// поэтому сессионные параметры не передаются
				ИнтернетПоддержкаПользователейВызовСервера.ОбработкаКомандСервиса(
					КонтекстВзаимодействия.КСКонтекст,
					Неопределено,
					КонтекстОбработчика,
					Истина);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Исключение
		
		КонтекстОбработчика.ПроизошлаОшибка = Истина;
		КонтекстОбработчика.ДействияПриОшибкеДляСервера.Добавить("СоздатьЗаписьВЖурналеРегистрации");
		КонтекстОбработчика.ДействияПриОшибкеДляСервера.Добавить("ПрерватьБизнесПроцесс");
		КонтекстОбработчика.ПолноеОписаниеОшибки = НСтр("ru = 'Произошло необрабатываемое исключение:'")
			+ " " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
		КонтекстОбработчика.ПользовательскоеОписаниеОшибки =
			НСтр("ru = 'Неизвестная ошибка. Подробнее см. в журнале регистрации.'");
		КонтекстОбработчика.ДействиеПриОшибкеДляКлиента = "ПоказатьСообщение";
		
	КонецПопытки;
	
	Если ОтобразитьСостояниеОбращения = Истина Тогда
		Состояние();
	КонецЕсли;
	
	ДопСвойства = КонтекстОбработчика.ДопСвойства;
	Если ДопСвойства.Свойство("ИзмененЛогинПользователя") Тогда
		
		КСКонтекст = КонтекстВзаимодействия.КСКонтекст;
		ЛогинПользователяИИП = ДопСвойства.ИзмененЛогинПользователя;
		ДопСвойства.Удалить("ИзмененЛогинПользователя");
		КСКонтекст.Логин = ЛогинПользователяИИП;
		Оповестить("ИнтернетПоддержкаИзменениеДанныхАвторизации",
			Новый Структура("Логин", ЛогинПользователяИИП));
		
		Если ПустаяСтрока(ЛогинПользователяИИП) Тогда
			
			// Выход пользователя
			Если КонтекстВзаимодействия.Свойство("ВведенныеЛогинИПароль") Тогда
				КонтекстВзаимодействия.Удалить("ВведенныеЛогинИПароль");
			КонецЕсли;
			
		Иначе
			
			ВведенныеЛогинИПароль = Новый Структура("Логин, Пароль",
				ЛогинПользователяИИП,
				ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст, "password"));
			
			КонтекстВзаимодействия.Вставить("ВведенныеЛогинИПароль", ВведенныеЛогинИПароль);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ПрерватьОбработкуКоманд И НЕ КонтекстОбработчика.ПроизошлаОшибка Тогда
		// При возникновении асинхронного действия необходимо прервать обработку
		// команд сервиса. Выполнение будет инициировано завершением асинхронного
		// действия.
		Возврат;
	КонецЕсли;
	
	// Если в процессе выполнения произошла ошибка, тогда выполнить обработку ошибки
	Если КонтекстОбработчика.ПроизошлаОшибка Тогда
		
		ЗакрытьВсеФормы(КонтекстВзаимодействия);
		
		ОповеститьОЗавершенииБизнесПроцесса(КонтекстВзаимодействия.ОбработчикиЗавершенияБизнесПроцесса,
			КонтекстВзаимодействия);
		
		// Завершение сеанса
		Если КонтекстОбработчика.ДействияПриОшибкеДляСервера.Количество() > 0 Тогда
			
			// Завершение сеанса на сервере информационной базы
			ИнтернетПоддержкаПользователейВызовСервера.ЗавершитьСеансИнтернетПоддержки(
				КонтекстВзаимодействия.КСКонтекст,
				КонтекстОбработчика);
			
			Если КонтекстОбработчика.ДействияПриОшибкеДляСервера.Количество() > 0 Тогда
				// Осталось только действие закрытия сеанса, т.е. требуется отправить
				// из клиентского приложения команду завершения бизнес-процесса
				ЗавершитьБизнесПроцесс(КонтекстВзаимодействия);
			КонецЕсли;
			
		КонецЕсли;
		
		Если КонтекстОбработчика.ДействиеПриОшибкеДляКлиента = "ОтобразитьФормуОтсутствуетПодключение" Тогда
			
			ПараметрыФормы = ПараметрыФормыОшибкиОбращения(КонтекстВзаимодействия);
			ПараметрыФормы.Вставить("ОписаниеОшибки",
				КонтекстОбработчика.ПользовательскоеОписаниеОшибки);
			ОткрытьФорму("ОбщаяФорма.ИнтернетПоддержкаПользователейОшибкаДоступаКИнтернету",
				ПараметрыФормы);
			
		ИначеЕсли КонтекстОбработчика.ДействиеПриОшибкеДляКлиента = "ПоказатьСообщение"
			И НЕ ПустаяСтрока(КонтекстОбработчика.ПользовательскоеОписаниеОшибки) Тогда
			
			ПоказатьПредупреждение(,
				КонтекстОбработчика.ПользовательскоеОписаниеОшибки,
				,
				НСтр("ru = 'Интернет-поддержка пользователей'"));
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли КонтекстОбработчика.ВыполнитьОстановку Тогда
		
		ОповеститьОЗавершенииБизнесПроцесса(КонтекстВзаимодействия.ОбработчикиЗавершенияБизнесПроцесса,
			КонтекстВзаимодействия);
		
		Если КонтекстОбработчика.Свойство("ОписаниеПричиныОстановки") Тогда
			ПоказатьОповещениеПользователя(НСтр("ru = 'Интернет-поддержка пользователей'"),
				,
				КонтекстОбработчика.ОписаниеПричиныОстановки,
				БиблиотекаКартинок.ИнтернетПоддержкаПользователей);
		КонецЕсли;
		
		ЗавершитьБизнесПроцесс(КонтекстВзаимодействия);
		
	ИначеЕсли КонтекстВзаимодействия.Свойство("БизнесПроцессУспешноЗавершен")
		И КонтекстВзаимодействия.БизнесПроцессУспешноЗавершен = Истина Тогда
		
		ОповеститьОЗавершенииБизнесПроцесса(КонтекстВзаимодействия.ОбработчикиЗавершенияБизнесПроцесса,
			КонтекстВзаимодействия);
		
	КонецЕсли;
	
КонецПроцедуры

// Добавляет команды в стек команд контекста обработчика команд
//
Процедура ДобавитьКомандыСервиса(
	КонтекстВзаимодействия,
	ДополнительныеПараметры,
	КонтекстОбработчика = Неопределено) Экспорт
	
	#Если Не ВебКлиент Тогда
	
	ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	
	Попытка
		
		Если КонтекстВзаимодействия.ОписаниеСервисаИПП = Неопределено Тогда
			КонтекстВзаимодействия.ОписаниеСервисаИПП = ИнтернетПоддержкаПользователейКлиентСервер.НовыйОписаниеСервисаИПП(
				ОсновныеПараметры.ИмяWSОпределения,
				КонтекстВзаимодействия.СетевыеПараметрыИПП);
		КонецЕсли;
		
		ОписаниеСервисаИПП = КонтекстВзаимодействия.ОписаниеСервисаИПП;
		
	Исключение
		
		Если ТипЗнч(КонтекстОбработчика) = Тип("Структура") Тогда
			КонтекстОбработчика.ПроизошлаОшибка      = Истина;
			КонтекстОбработчика.ПолноеОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонтекстОбработчика.ДействияПриОшибкеДляСервера.Добавить("СоздатьЗаписьВЖурналеРегистрации");
			КонтекстОбработчика.ДействиеПриОшибкеДляКлиента = "ОтобразитьФормуОтсутствуетПодключение";
			КонтекстОбработчика.ПользовательскоеОписаниеОшибки =
				НСтр("ru = 'Ошибка при подключении к сервису Интернет-поддержки.'");
		КонецЕсли;
		
		Возврат;
		
	КонецПопытки;
	
	Попытка
		
		ИнтернетПоддержкаПользователейКлиентСервер.ДобавитьКомандыСервиса(
			ОписаниеСервисаИПП,
			ДополнительныеПараметры,
			КонтекстОбработчика,
			ОсновныеПараметры);
		
		// После первого вызова необходимо отключить таймаут сети, т.к.
		// проверка обращения по таймауту уже выполнена
		Если КонтекстВзаимодействия.СетевыеПараметрыИПП.ТаймаутСети <> 0 Тогда
			КонтекстВзаимодействия.СетевыеПараметрыИПП.ТаймаутСети = 0;
			ИнтернетПоддержкаПользователейКлиентСервер.ИзменитьТаймаутОбращения(ОписаниеСервисаИПП, 0);
		КонецЕсли;
		
	Исключение
		
		Если ТипЗнч(КонтекстОбработчика) = Тип("Структура") Тогда
			КонтекстОбработчика.ПроизошлаОшибка      = Истина;
			КонтекстОбработчика.ПолноеОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			КонтекстОбработчика.ДействияПриОшибкеДляСервера.Добавить("СоздатьЗаписьВЖурналеРегистрации");
			КонтекстОбработчика.ДействиеПриОшибкеДляКлиента = "ОтобразитьФормуОтсутствуетПодключение";
			КонтекстОбработчика.ПользовательскоеОписаниеОшибки = НСтр("ru = 'Ошибка при получении данных с сервера Интернет-поддержки.'");
		КонецЕсли;
		
	КонецПопытки;
	
	#КонецЕсли
	
КонецПроцедуры

// Выполняет заданную команду сервиса.
//
Процедура ВыполнитьКомандуСервиса(
	КонтекстВзаимодействия,
	ТекущаяФорма,
	СтруктураКоманды,
	КонтекстОбработчика,
	ПрерватьОбработкуКоманд)
	
	ИмяКоманды = Неопределено;
	СтруктураКоманды.Свойство("ИмяКоманды", ИмяКоманды);
	
	Если ТипЗнч(ИмяКоманды) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяКоманды = НРег(СокрЛП(ИмяКоманды));
	
	Если ИмяКоманды = "store.put" Тогда
		ИнтернетПоддержкаПользователейКлиентСервер.ВыполнениеКомандыЗаписьПараметров(
			КонтекстВзаимодействия.КСКонтекст,
			СтруктураКоманды,
			КонтекстОбработчика);
		
	ИначеЕсли ИмяКоманды = "store.get" Тогда
		ИнтернетПоддержкаПользователейКлиентСервер.ВыполнениеКомандыПрочитатьПараметры(
			КонтекстВзаимодействия,
			СтруктураКоманды,
			КонтекстОбработчика,
			Ложь);
		
	ИначеЕсли ИмяКоманды = "store.delete" Тогда
		ИнтернетПоддержкаПользователейКлиентСервер.УдалитьПараметрыКонтекста(
			КонтекстВзаимодействия.КСКонтекст,
			СтруктураКоманды,
			КонтекстОбработчика);
		
	ИначеЕсли ИмяКоманды = "launchservice" Тогда
		ИзменитьБизнеспроцесс(КонтекстВзаимодействия, СтруктураКоманды, КонтекстОбработчика);
		
	ИначеЕсли ИмяКоманды = "ui.open" Тогда
		ОткрытьВнутреннююФорму(КонтекстВзаимодействия, ТекущаяФорма, СтруктураКоманды);
		
	ИначеЕсли ИмяКоманды = "ui.close" Тогда
		ЗакрытьВнутреннююФорму(КонтекстВзаимодействия, СтруктураКоманды);
		
	ИначеЕсли ИмяКоманды = "system.halt" Тогда
		ОстановитьМеханизм(КонтекстВзаимодействия, СтруктураКоманды);
		
	ИначеЕсли ИмяКоманды = "message.show" Тогда
		ПоказатьСообщениеПользователю(
			СтруктураКоманды,
			КонтекстВзаимодействия,
			ТекущаяФорма,
			КонтекстОбработчика,
			ПрерватьОбработкуКоманд);
		
	ИначеЕсли ИмяКоманды = "question.show" Тогда
		ЗадатьВопросПользователю(КонтекстВзаимодействия, ТекущаяФорма, СтруктураКоманды);
		
	ИначеЕсли ИмяКоманды = "input.field" Тогда
		ВвестиДанные(КонтекстВзаимодействия, ТекущаяФорма, СтруктураКоманды);
		
	ИначеЕсли ИмяКоманды = "store.putorganizations" Тогда
		ИнтернетПоддержкаПользователейКлиентСервер.ЗаписатьСписокОрганизаций(
			КонтекстВзаимодействия.КСКонтекст,
			СтруктураКоманды);
		
	ИначеЕсли ИмяКоманды = "store.putadressclassifier" Тогда
		ИнтернетПоддержкаПользователейКлиентСервер.ЗаписатьАдресныйКлассификатор(
			КонтекстВзаимодействия.КСКонтекст,
			СтруктураКоманды);
		
	Иначе
		
		// Обработка в доп. обработчике бизнес-процесса
		ДопОбработчик = ИнтернетПоддержкаПользователейКлиент.КлиентскийОбработчикБизнесПроцесса(
			КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры.МестоЗапуска,
			"ВыполнитьКомандуСервиса");
		
		Если ДопОбработчик <> Неопределено Тогда
			
			ДопОбработчик.ВыполнитьКомандуСервиса(
				КонтекстВзаимодействия,
				ТекущаяФорма,
				СтруктураКоманды,
				КонтекстОбработчика,
				ПрерватьОбработкуКоманд);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Выполнение команды открытия формы.
//
Процедура ОткрытьВнутреннююФорму(КонтекстВзаимодействия, ТекущаяФорма, СтруктураКоманды)
	
	ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	
	ПараметрыФормы = Неопределено;
	СтруктураКоманды.Свойство("ПараметрыФормы", ПараметрыФормы);
	
	УРЛ = Неопределено;
	СтруктураКоманды.Свойство("УРЛ", УРЛ);
	
	ТекстФормы = Неопределено;
	СтруктураКоманды.Свойство("Текст", ТекстФормы);
	
	// Замена параметров в тексте формы
	Если ТекстФормы <> Неопределено Тогда
		Если Найти(ТекстФормы, "%Логин%") Тогда
			СтрокаЗамены = ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(
				КонтекстВзаимодействия.КСКонтекст,
				"login");
			ТекстФормы = СтрЗаменить(ТекстФормы, "%Логин%", СтрокаЗамены);
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыФормы <> Неопределено Тогда
		
		ИмяОткрываемойФормы = Неопределено;
		ПараметрыФормы.Свойство("ИмяОткрываемойФормы", ИмяОткрываемойФормы);
		
		Заголовок = Неопределено;
		ПараметрыФормы.Свойство("Заголовок", Заголовок);
		
		Текст = Неопределено;
		ПараметрыФормы.Свойство("Текст", Текст);
		
		Если ИмяОткрываемойФормы = "Вопрос" Тогда
			
			ТекстПредупреждения = ?(Текст = Неопределено, ТекстФормы, Текст);
			
			ДопПараметры = Новый Структура("КонтекстВзаимодействия, Форма", КонтекстВзаимодействия, ТекущаяФорма);
			ОписаниеОповещения = Новый ОписаниеОповещения("ПриНажатииОКВСтатическойФормеПредупреждения",
				ЭтотОбъект,
				ДопПараметры);
			
			ПоказатьПредупреждение(ОписаниеОповещения, ТекстПредупреждения, , Заголовок);
			
		ИначеЕсли ИмяОткрываемойФормы = "ВсплывающаяПодсказка" Тогда
			ПоказатьОповещениеПользователя(
				Заголовок,
				,
				ТекстФормы,
				БиблиотекаКартинок.ИнтернетПоддержкаПользователей);
			
		Иначе
			
			Если ТекущаяФорма <> Неопределено Тогда
				ЗакрытьФормуПрограммно(ТекущаяФорма);
			КонецЕсли;
			
			ПараметрыОткрытияФормы = СформироватьПараметрыОткрытияФормы(
				КонтекстВзаимодействия.КСКонтекст,
				ИмяОткрываемойФормы);
			
			Если УРЛ <> Неопределено Тогда
				ПараметрыОткрытияФормы.Вставить("УРЛ", УРЛ);
			КонецЕсли;
			
			ОткрываемаяФорма = ПолучитьФорму(ИмяОткрываемойФормы, ПараметрыОткрытияФормы);
			
			Попытка
				ОткрываемаяФорма.КонтекстВзаимодействия = КонтекстВзаимодействия;
			Исключение
			КонецПопытки;
			
			ОткрываемаяФорма.Открыть();
			
		КонецЕсли;
		
		Если ПараметрыФормы.Свойство("УспешноеЗавершениеБизнесПроцесса") Тогда
			КонтекстВзаимодействия.Вставить("БизнесПроцессУспешноЗавершен", Истина);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Подготовка параметров для открытия внутренней формы.
//
Функция СформироватьПараметрыОткрытияФормы(КСКонтекст, ИмяОткрываемойФормы) Экспорт
	
	ОсновныеПараметры = КСКонтекст.ОсновныеПараметры;
	
	ПараметрыНовойФормы = Новый Структура;
	
	// Во все формы передается значение параметра login
	ПараметрыНовойФормы.Вставить("login",
		ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст, "login"));
	
	Если ИмяОткрываемойФормы = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ОбщаяАвторизация"
		ИЛИ ИмяОткрываемойФормы = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.АвторизацияУпрощенная" Тогда
		
		ПараметрыНовойФормы.Вставить("МестоЗапуска", КСКонтекст.ОсновныеПараметры.МестоЗапуска);
		ПараметрыНовойФормы.Вставить("password",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"password"));
		ПараметрыНовойФормы.Вставить("savePassword",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"savePassword"));
		
		ПараметрыНовойФормы.Вставить("ПриНачалеРаботыСистемы", КСКонтекст.ПриНачалеРаботыСистемы);
		
	ИначеЕсли ИмяОткрываемойФормы = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ОбщаяРегНомер" Тогда
		ПараметрыНовойФормы.Вставить("regnumber",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"regnumber"));
		
		ПараметрыНовойФормы.Вставить("ПриНачалеРаботыСистемы", КСКонтекст.ПриНачалеРаботыСистемы);
		
	ИначеЕсли ИмяОткрываемойФормы = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ОбщаяПинкод" Тогда
		ПараметрыНовойФормы.Вставить("regnumber",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"regnumber"));
		ПараметрыНовойФормы.Вставить("pincode",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"pincode"));
		
	ИначеЕсли ИмяОткрываемойФормы = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ВосстановлениеПароля" Тогда
		ПараметрыНовойФормы.Вставить("login",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"login"));
		ПараметрыНовойФормы.Вставить("email",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"email"));
		
	ИначеЕсли ИмяОткрываемойФормы = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.РегистрацияНовогоПользователя" Тогда
		ПараметрыНовойФормы.Вставить("login",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"login"));
		ПараметрыНовойФормы.Вставить("password",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"password"));
		ПараметрыНовойФормы.Вставить("email",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"email"));
		ПараметрыНовойФормы.Вставить("SecondName",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"SecondName"));
		ПараметрыНовойФормы.Вставить("FirstName",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"FirstName"));
		ПараметрыНовойФормы.Вставить("MiddleName",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"MiddleName"));
		ПараметрыНовойФормы.Вставить("City",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"City"));
		ПараметрыНовойФормы.Вставить("phoneNumber",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"phoneNumber"));
		ПараметрыНовойФормы.Вставить("workPlace",
			ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст,"workPlace"));
		
	ИначеЕсли ИмяОткрываемойФормы = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ИнтернетПоддержкаПродуктаНеОказывается" Тогда
		
		Если КСКонтекст.Свойство("ПриНачалеРаботыСистемы") Тогда
			ПараметрыНовойФормы.Вставить("ПриНачалеРаботыСистемы", КСКонтекст.ПриНачалеРаботыСистемы);
		КонецЕсли;
		
	Иначе
		
		// Получение параметров формы через доп. обработчик бизнес-процесса
		ДопОбработчик = ИнтернетПоддержкаПользователейКлиент.КлиентскийОбработчикБизнесПроцесса(
			ОсновныеПараметры.МестоЗапуска,
			"ПараметрыОткрытияФормы");
		
		Если ДопОбработчик <> Неопределено Тогда
			ДопОбработчик.ПараметрыОткрытияФормы(КСКонтекст, ИмяОткрываемойФормы, ПараметрыНовойФормы);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ПараметрыНовойФормы;
	
КонецФункции

// Выполнение команды закрытия внутренней формы.
//
Процедура ЗакрытьВнутреннююФорму(КонтекстВзаимодействия, СтруктураКоманды)
	
	ФормыОбработки    = КонтекстВзаимодействия.ФормыОбработки;
	ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	
	ПараметрыФормы = Неопределено;
	СтруктураКоманды.Свойство("ПараметрыФормы", ПараметрыФормы);
	
	Если ПараметрыФормы <> Неопределено Тогда
		
		ИмяОткрываемойФормы = Неопределено;
		ПараметрыФормы.Свойство("ИмяОткрываемойФормы", ИмяОткрываемойФормы);
		
		Если ИмяОткрываемойФормы = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Форма = ФормыОбработки[ИмяОткрываемойФормы];
		
		Если Форма = Неопределено ИЛИ НЕ Форма.Открыта() Тогда
			Возврат;
		КонецЕсли;
		
		ЗакрытьФормуПрограммно(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

// Выполнение команды сервиса "Задать вопрос пользователю".
//
Процедура ЗадатьВопросПользователю(КонтекстВзаимодействия, Форма, СтруктураКоманды)
	
	ТипВопроса = Неопределено;
	СтруктураКоманды.Свойство("Тип", ТипВопроса);
	
	Если ТипВопроса = "richanswer" Тогда
		
		СписокКнопок = СтруктураКоманды.Кнопки;
		
	Иначе
		
		СписокКнопок = Новый СписокЗначений;
		Для каждого ЭлементКнопка Из СтруктураКоманды.Кнопки Цикл
			Если ЭлементКнопка.Значение = "yes" Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Да);
			ИначеЕсли ЭлементКнопка.Значение = "no" Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Нет);
			ИначеЕсли ЭлементКнопка.Значение = "cancel" Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.Отмена);
			ИначеЕсли ЭлементКнопка.Значение = "ok" Тогда
				СписокКнопок.Добавить(КодВозвратаДиалога.ОК);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	ДопПараметрыВопроса = Новый Структура("КонтекстВзаимодействия, ТипВопроса, Форма",
		КонтекстВзаимодействия,
		ТипВопроса,
		Форма);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеНаВопросКомандыВопрос",
		ЭтотОбъект,
		ДопПараметрыВопроса);
	
	ПоказатьВопрос(ОписаниеОповещения, СтруктураКоманды.ТекстСообщения, СписокКнопок, , , СтруктураКоманды.Заголовок);
	
КонецПроцедуры

// Асинхронный обработчик ответа пользователя при выполнении команды
// ЗадатьВопросПользователю()
//
Процедура ПриОтветеНаВопросКомандыВопрос(РезультатВопроса, ДопПараметры) Экспорт
	
	Если ДопПараметры.ТипВопроса = "richanswer" Тогда
		ОтветСервису = РезультатВопроса;
		
	Иначе
		ОтветСервису = "Cancel";
		Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
			ОтветСервису = "Yes";
		ИначеЕсли РезультатВопроса = КодВозвратаДиалога.Нет Тогда
			ОтветСервису = "No";
		ИначеЕсли РезультатВопроса = КодВозвратаДиалога.ОК Тогда
			ОтветСервису = "OK";
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыЗапроса = Новый Массив;
	ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "answer", ОтветСервису));
	
	ОбработкаКомандСервиса(ДопПараметры.КонтекстВзаимодействия, ДопПараметры.Форма, ПараметрыЗапроса);
	
КонецПроцедуры

// Выполнение команды сервиса "Показать сообщение пользователю".
//
Процедура ПоказатьСообщениеПользователю(
	СтруктураКоманды,
	КонтекстВзаимодействия,
	ТекущаяФорма,
	КонтекстОбработчика,
	ПрерватьОбработкуКоманд)
	
	ТипСообщения = Неопределено;
	СтруктураКоманды.Свойство("Тип", ТипСообщения);
	
	Если ТипСообщения = "usernotification" Тогда
		
		ПоказатьОповещениеПользователя(
			СтруктураКоманды.Заголовок,
			,
			СтруктураКоманды.ТекстСообщения,
			БиблиотекаКартинок.ИнтернетПоддержкаПользователей);
		
	Иначе
		
		ПрерватьОбработкуКоманд = Истина;
		ДопПараметрыОповещения = Новый Структура("КонтекстВзаимодействия, Форма, КонтекстОбработчика",
			КонтекстВзаимодействия,
			ТекущаяФорма,
			КонтекстОбработчика);
		
		ОписаниеОповещения = Новый ОписаниеОповещения(
			"ПриНажатииОКВФормеСообщенияПользователю",
			ЭтотОбъект,
			ДопПараметрыОповещения);
		
		ПоказатьПредупреждение(ОписаниеОповещения, СтруктураКоманды.ТекстСообщения, , СтруктураКоманды.Заголовок);
		
	КонецЕсли;
	
КонецПроцедуры

// Асинхронный обработчик нажатия кнопки "ОК" в форме сообщения пользователю
// при выполнении команды сервиса "Показать сообщение пользователю".
//
Процедура ПриНажатииОКВФормеСообщенияПользователю(ДопПараметры) Экспорт
	
	ОбработкаКомандСервиса(
		ДопПараметры.КонтекстВзаимодействия,
		ДопПараметры.Форма,
		,
		ДопПараметры.КонтекстОбработчика,
		,
		,
		Истина);
	
КонецПроцедуры

// Асинхронный обработчик нажатия пользователем кнопки "ОК" при выполнении
// команды открытия статической формы.
//
Процедура ПриНажатииОКВСтатическойФормеПредупреждения(ДопПараметры) Экспорт
	
	ОбработкаКомандСервиса(ДопПараметры.КонтекстВзаимодействия, ДопПараметры.Форма, Неопределено);
	
КонецПроцедуры

// Выполнение команды сервиса "Ввести данные". При выполнении
// открывается универсальная форма ввода данных
// Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ВводДанных
//
Процедура ВвестиДанные(КонтекстВзаимодействия, Форма, СтруктураКоманды)
	
	ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	
	ДопПараметры = Новый Структура("Форма, КонтекстВзаимодействия", Форма, КонтекстВзаимодействия);
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ПриВводеДанныхПользователем",
		ЭтотОбъект,
		ДопПараметры);
	
	ИмяФормыВводаДанных = "Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ВводДанных";
	ОткрытьФорму(ИмяФормыВводаДанных,
		СтруктураКоманды.ПараметрыФормы,
		,
		,
		,
		,
		ОписаниеОповещения);
	
КонецПроцедуры

// Асинхронный обработчик ввода данных пользователем в результате выполнения
// команды ПриВводеДанныхПользователем()
//
Процедура ПриВводеДанныхПользователем(ВведенныеДанные, ДопПараметры) Экспорт
	
	Форма = ДопПараметры.Форма;
	КонтекстВзаимодействия = ДопПараметры.КонтекстВзаимодействия;
	
	ПараметрыЗапроса = Новый Массив;
	Если ВведенныеДанные <> Неопределено И ВведенныеДанные <> КодВозвратаДиалога.Отмена Тогда
		ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", "value", ВведенныеДанные));
	КонецЕсли;
	
	ОбработкаКомандСервиса(КонтекстВзаимодействия, Форма, ПараметрыЗапроса);
	
КонецПроцедуры

// Выполняет команду изменения адреса текущего сервиса ИПП.
//
Процедура ИзменитьБизнеспроцесс(КонтекстВзаимодействия, СтруктураКоманды, КонтекстОбработчика)
	
	ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	
	ПараметрыКоманды = Неопределено;
	СтруктураКоманды.Свойство("Параметры", ПараметрыКоманды);
	
	БизнесПроцесс = Неопределено;
	ИмяURI        = Неопределено;
	
	Для каждого ПараметрКоманды Из ПараметрыКоманды Цикл
		
		Если ПараметрКоманды.Свойство("bp", БизнесПроцесс) Тогда
			ОсновныеПараметры.ИмяWSОпределения = БизнесПроцесс;
		КонецЕсли;
		
		Если ПараметрКоманды.Свойство("nameURI", ИмяURI) Тогда
			ОсновныеПараметры.URIСервиса = ИмяURI;
		КонецЕсли;
		
	КонецЦикла;
	
	// Добавление номера сессии
	ПараметрыЗапроса = Новый Массив;
	
	ИнтернетПоддержкаПользователейКлиентСервер.ДобавитьСессионныеПараметрыКЗапросу(
		КонтекстВзаимодействия.КСКонтекст,
		, // добавляется только "session_id"
		ПараметрыЗапроса);
	
	// Смена подключения
	КонтекстВзаимодействия.ОписаниеСервисаИПП = Неопределено;
	
	// Обратиться к новому веб-сервису за командами, и записать их в стек команд
	ДобавитьКомандыСервиса(
		КонтекстВзаимодействия,
		ПараметрыЗапроса,
		КонтекстОбработчика);
	
КонецПроцедуры

// Выполнение команды останова механизма ИПП. Закрытие всех форм,
// при необходимости отображается форма ошибки обращения к серсису ИПП
// и записывается ошибка в журнал регистрации.
//
Процедура ОстановитьМеханизм(КонтекстВзаимодействия, СтруктураКоманды)
	
	ЗакрытьВсеФормы(КонтекстВзаимодействия);
	
	ПараметрыКоманды = Неопределено;
	СтруктураКоманды.Свойство("Параметры", ПараметрыКоманды);
	
	Если ПараметрыКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	КодОшибки = Неопределено;
	Для каждого ПараметрКоманды Из ПараметрыКоманды Цикл
		
		Если ПараметрКоманды.Свойство("errorCode", КодОшибки) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СокрЛП(Строка(КодОшибки)) <> "0" И КодОшибки <> Неопределено Тогда
		ИнтернетПоддержкаПользователейВызовСервера.ЗаписатьОшибкуВЖурналРегистрации(КодОшибки);
		ПараметрыФормы = ПараметрыФормыОшибкиОбращения(КонтекстВзаимодействия);
		ПараметрыФормы.Вставить("ОписаниеОшибки", КодОшибки);
		ОткрытьФорму("ОбщаяФорма.ИнтернетПоддержкаПользователейОшибкаДоступаКИнтернету",
			ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для организации бизнес-процессов

// Отправка на сервер управляющей команды для освобождения ресурсов сервиса.
// Обработка ответа сервиса не выполняется.
//
Процедура ЗавершитьБизнесПроцесс(КонтекстВзаимодействия) Экспорт
	
	Если КонтекстВзаимодействия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОповеститьОЗавершенииБизнесПроцесса(КонтекстВзаимодействия.ОбработчикиЗавершенияБизнесПроцесса,
		КонтекстВзаимодействия);
	
	ЗакрытьВсеФормы(КонтекстВзаимодействия);
	ПараметрыОбращенияКСервисуИПП = Новый Структура;
	ПараметрыОбращенияКСервисуИПП.Вставить("ОбработатьОтвет"             , Ложь);
	ПараметрыОбращенияКСервисуИПП.Вставить("ОтобразитьСостояниеОбращения", Ложь);
	
	ОбработатьКомандуФормы(КонтекстВзаимодействия, Неопределено, "CloseBP", ПараметрыОбращенияКСервисуИПП);
	
	КэшWSDLОписаний = Неопределено;
	ОсновныеПараметры = КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры;
	ОсновныеПараметры.Свойство("КэшWSDLОписаний", КэшWSDLОписаний);
	Если КэшWSDLОписаний <> Неопределено Тогда
		ИнтернетПоддержкаПользователейВызовСервера.ОчиститьКэшWSDLОписаний(КэшWSDLОписаний);
	КонецЕсли;
	
КонецПроцедуры

// Обращение к сервису ИПП с заданным параметром.
// Передается один параметр с заданным именем и значением "true".
//
Процедура ОбработатьКомандуФормы(
	КонтекстВзаимодействия,
	Форма,
	ИмяКоманды,
	ПараметрыОбращенияКСервисуИПП = Неопределено) Экспорт
	
	ПараметрыЗапроса        = Новый Массив;
	ПараметрыЗапроса.Добавить(Новый Структура("Имя, Значение", ИмяКоманды, "true"));
	
	ОбработкаКомандСервиса(КонтекстВзаимодействия, Форма, ПараметрыЗапроса, , ПараметрыОбращенияКСервисуИПП);
	
КонецПроцедуры

// Обработка выхода пользователя из ИПП (нажатие ссылки "Выход" на форме).
//
Процедура ОбработатьВыходПользователя(КонтекстВзаимодействия, Форма) Экспорт
	
	ДопПараметры = Новый Структура("КонтекстВзаимодействия, Форма", КонтекстВзаимодействия, Форма);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОтветеПользователяНаВопросОВыходе", ЭтотОбъект, ДопПараметры);
	
	ТекстВопроса = ВопросПриВыходеАвторизированногоПользователя(КонтекстВзаимодействия);
	ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

// Асинхронный обработчик ответа пользователя на вопрос о выходе из ИПП в
// процедуре ОбработатьВыходПользователя().
//
Процедура ПриОтветеПользователяНаВопросОВыходе(РезультатВопроса, ДопПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗакрытьВсеФормы(ДопПараметры.КонтекстВзаимодействия);
		ИнтернетПоддержкаПользователейВызовСервера.ОчиститьНастройкиИПППользователя();
		ОбработатьКомандуФормы(ДопПараметры.КонтекстВзаимодействия, ДопПараметры.Форма, "exitUser");
	КонецЕсли;
	
КонецПроцедуры

// Открытие диалога отправки сообщения в службу тех. поддержки ИПП.
//
Процедура ОткрытьДиалогОтправкиЭлектронногоПисьма(КонтекстВзаимодействия, ПараметрыПисьма) Экспорт
	
	Если ПараметрыПисьма = Неопределено Тогда
		ПараметрыПисьма = Новый Структура;
	КонецЕсли;
	
	КСКонтекст = КонтекстВзаимодействия.КСКонтекст;
	ПараметрыПисьма.Вставить("МестоЗапуска", КСКонтекст.ОсновныеПараметры.МестоЗапуска);
	ПараметрыПисьма.Вставить("ПриНачалеРаботыСистемы",
		КонтекстВзаимодействия.КСКонтекст.ПриНачалеРаботыСистемы);
	
	ПараметрыПисьма.Вставить("Логин",
		ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(КСКонтекст, "login"));
	
	ФормаОтправкиЭлектронногоПисьма = ПолучитьФорму(
		"Обработка.БазовыеФункцииИнтернетПоддержки.Форма.ОтправкаЭлектронногоПисьма",
		ПараметрыПисьма);
	
	ФормаОтправкиЭлектронногоПисьма.КонтекстВзаимодействия = КонтекстВзаимодействия;
	ФормаОтправкиЭлектронногоПисьма.Открыть();
	
КонецПроцедуры

// Непосредственная отправка электронного сообщения в службу тех. поддержки ИПП
//
Функция ОтправитьЭлектронноеСообщениеСлужбеТехПоддержки(СтруктураСообщения, КонтекстВзаимодействия) Экспорт
	
	Если КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры.ОбращениеССервера Тогда
		Возврат ИнтернетПоддержкаПользователейВызовСервера.ОтправитьЭлектронноеПисьмоЧерезСервис(
			СтруктураСообщения,
			КонтекстВзаимодействия.КСКонтекст.ОсновныеПараметры.СетевыеПараметрыИПП);
	Иначе
		Возврат ИнтернетПоддержкаПользователейКлиентСервер.ОтправитьЭлектронноеПисьмоЧерезСервис(
			СтруктураСообщения,
			КонтекстВзаимодействия.СетевыеПараметрыИПП);
	КонецЕсли;
	
КонецФункции

// Возвращает пустой список обработчиков оповещения о завершении
// бизнес-процесса.
//
// Возвращаемое значение:
//	Структура - пустой список обработчиков оповещения о завершении
//				бизнес-процесса.
//		* Обработано - Булево - Истина, если оповещение выполнено,
//			Ложь - в противном случае.
//		* МестоЗапуска - точка входа бизнес-процесса;
//
Функция НовыйОбработчикиЗавершенияБизнесПроцесса(МестоЗапуска)
	
	Результат = Новый Структура;
	Результат.Вставить("Обработано"  , Ложь);
	Результат.Вставить("МестоЗапуска", МестоЗапуска);
	
	Возврат Результат;
	
КонецФункции

// Выполняет вызов обработчиков оповещения о завершении бизнес-процесса.
//
// Параметры:
//	ОбработчикиЗавершенияБизнесПроцесса - Структура - обработчики оповещения о
//		завершении бизнес-процесса (см. функцию
//		НовыйОбработчикиЗавершенияБизнесПроцесса())
//	КонтекстВзаимодействия - Структура, Неопределено - контекст бизнес-процесса.
//		см. функцию
//		ИнтернетПоддержкаПользователейВызовСервера.НовыйКонтекстВзаимодействия()
//
Процедура ОповеститьОЗавершенииБизнесПроцесса(
	ОбработчикиЗавершенияБизнесПроцесса,
	КонтекстВзаимодействия)
	
	Если ОбработчикиЗавершенияБизнесПроцесса = Неопределено
		ИЛИ ОбработчикиЗавершенияБизнесПроцесса.Обработано Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбработчикиЗавершенияБизнесПроцесса.Свойство("ОповещенияОбАвторизации") Тогда
		// Оповещение об авторизации
		Если КонтекстВзаимодействия = Неопределено
			ИЛИ НЕ КонтекстВзаимодействия.Свойство("БизнесПроцессУспешноЗавершен")
			ИЛИ НЕ КонтекстВзаимодействия.БизнесПроцессУспешноЗавершен
			ИЛИ НЕ КонтекстВзаимодействия.Свойство("ВведенныеЛогинИПароль") Тогда
			РезультатДляОповещения = Неопределено;
		Иначе
			РезультатДляОповещения = КонтекстВзаимодействия.ВведенныеЛогинИПароль;
		КонецЕсли;
		Для каждого Обработчик Из ОбработчикиЗавершенияБизнесПроцесса.ОповещенияОбАвторизации Цикл
			ВыполнитьОбработкуОповещения(Обработчик, РезультатДляОповещения);
		КонецЦикла;
		ОбработчикиЗавершенияБизнесПроцесса.Обработано = Истина;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Процедуры и функции для работы с параметрами ИПП в контексте взаимодействия

// Удаление сессионных параметров контекста.
//
Процедура ОчиститьСессию(КонтекстВзаимодействия)
	
	СессионныеПараметры = КонтекстВзаимодействия.КСКонтекст.СессионныеПараметры;
	КоличествоПараметров = СессионныеПараметры.Количество();
	Если КоличествоПараметров > 0 Тогда
		Для ОбратныйИндекс = 1 По КоличествоПараметров Цикл
			Индекс = КоличествоПараметров - ОбратныйИндекс;
			Если СессионныеПараметры[Индекс].ОбластьВидимости <> "startUp" Тогда
				СессионныеПараметры.Удалить(Индекс);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Интерфейсные процедуры и функции

// Отображение состояния обращения к веб-сервису ИПП.
//
Процедура ОтобразитьСостояниеОбращениеКСервису()
	
	Состояние(
		,
		,
		НСтр("ru = 'Ожидание ответа от сервера Интернет-поддержки пользователей'"),
		БиблиотекаКартинок.ИнтернетПоддержкаПользователей);
	
КонецПроцедуры

// Закрытие всех форм контекста.
//
Процедура ЗакрытьВсеФормы(КонтекстВзаимодействия)
	
	ФормыОбработки = КонтекстВзаимодействия.ФормыОбработки;
	Если ТипЗнч(ФормыОбработки) = Тип("Соответствие") Тогда
		ТипУправляемаяФорма = Тип("УправляемаяФорма");
		Для каждого КлючЗначение Из ФормыОбработки Цикл
			Форма = КлючЗначение.Значение;
			Если ТипЗнч(Форма) = ТипУправляемаяФорма И Форма.Открыта() Тогда
				Форма.ПрограммноеЗакрытие = Истина;
				Форма.Закрыть();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Программное закрытие формы контекста ИПП.
//
Процедура ЗакрытьФормуПрограммно(ЗакрываемаяФорма)
	
	Если ЗакрываемаяФорма <> Неопределено Тогда
		
		Если ЗакрываемаяФорма.Открыта() Тогда
			
			Попытка
				ЗакрываемаяФорма.ПрограммноеЗакрытие = Истина;
			Исключение
			КонецПопытки;
			
			ЗакрываемаяФорма.Закрыть();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Определяет, открыта ли заданная форма контекста.
//
Функция ФормаОткрыта(КонтекстВзаимодействия, ИмяПроверяемойФормы) Экспорт
	
	ФормыОбработки = КонтекстВзаимодействия.ФормыОбработки;
	
	Если ТипЗнч(ФормыОбработки) <> Тип("Соответствие") Тогда
		ФормыОбработки = Новый Соответствие;
	КонецЕсли;
	
	ПроверяемаяФорма = ФормыОбработки[ИмяПроверяемойФормы];
	Если ПроверяемаяФорма = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат ПроверяемаяФорма.Открыта();
	КонецЕсли;
	
КонецФункции

// Регистрация открытой внутренней формы ИПП в контексте взаимодействия.
//
Процедура ОбработатьОткрытиеФормы(КонтекстВзаимодействия, ОткрытаяФорма) Экспорт
	
	Если КонтекстВзаимодействия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормыОбработки = КонтекстВзаимодействия.ФормыОбработки;
	
	Если ТипЗнч(ФормыОбработки) <> Тип("Соответствие") Тогда
		ФормыОбработки = Новый Соответствие;
	КонецЕсли;
	
	ФормыОбработки[ОткрытаяФорма.ИмяФормы] = ОткрытаяФорма;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочие служебные процедуры и функции

// Вспомогательная функция для преобразования значения из фиксированного типа.
// Параметры:
//	ЗначениеФиксированногоТипа - Произвольный - значение фиксированного типа
//		из которого необходимо получить значение нефиксированного типа.
//
// Возвращаемое значение:
//	Произвольный - полученное значение аналогичного нефиксированного типа.
//
Функция ЗначениеИзФиксированногоТипа(ЗначениеФиксированногоТипа)
	
	Результат = Неопределено;
	ТипЗначения = ТипЗнч(ЗначениеФиксированногоТипа);
	
	Если ТипЗначения = Тип("ФиксированнаяСтруктура") Тогда
		
		Результат = Новый Структура;
		Для каждого КлючЗначение Из ЗначениеФиксированногоТипа Цикл
			Результат.Вставить(КлючЗначение.Ключ, ЗначениеИзФиксированногоТипа(КлючЗначение.Значение));
		КонецЦикла;
		
	ИначеЕсли ТипЗначения = Тип("ФиксированноеСоответствие") Тогда
		
		Результат = Новый Соответствие;
		Для каждого КлючЗначение Из ЗначениеФиксированногоТипа Цикл
			Результат.Вставить(КлючЗначение.Ключ, ЗначениеИзФиксированногоТипа(КлючЗначение.Значение));
		КонецЦикла;
		
	Иначе
		
		Результат = ЗначениеФиксированногоТипа;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Определяет текст вопроса при выходе авторизованного пользователя из ИПП.
//
Функция ВопросПриВыходеАвторизированногоПользователя(КонтекстВзаимодействия) Экспорт
	
	ЛогинПользователя = ИнтернетПоддержкаПользователейКлиентСервер.ЗначениеСессионногоПараметра(
		КонтекстВзаимодействия.КСКонтекст,
		"login");
	
	ТекстВопроса = НСтр("ru = 'Подключение пользователя с логином %1 к Интернет-поддержке будет
					|прекращено. Для нового подключения нужно заново ввести логин и пароль.
					|Перейти к авторизации нового пользователя?'");
	ТекстВопроса = СтрЗаменить(ТекстВопроса, "%1", ЛогинПользователя);
	
	Возврат ТекстВопроса;
	
КонецФункции

// Итерационное копирование списка значений.
//
Процедура СкопироватьСписокЗначенийИтерационно(Источник, Приемник) Экспорт
	
	Приемник.Очистить();
	Для каждого ЭлементИсточника Из Источник Цикл
		Приемник.Добавить(ЭлементИсточника.Значение, ЭлементИсточника.Представление);
	КонецЦикла;
	
КонецПроцедуры

// Возвращает параметры формы "ОбщаяФорма.ИнтернетПоддержкаПользователейОшибкаДоступаКИнтернету",
// формаируемые из контекста взаимодействия с сервисом ИПП.
//
Функция ПараметрыФормыОшибкиОбращения(КонтекстВзаимодействия)
	
	КСКонтекст = КонтекстВзаимодействия.КСКонтекст;
	ОсновныеПараметры = КСКонтекст.ОсновныеПараметры;
	
	ПараметрыФормыОшибкиДоступа = Новый Структура("МестоЗапуска, СтартовыеПараметры, ПриНачалеРаботыСистемы",
		ОсновныеПараметры.МестоЗапуска,
		КонтекстВзаимодействия.СтартовыеПараметрыМеханизма,
		КСКонтекст.ПриНачалеРаботыСистемы);
	
	Возврат ПараметрыФормыОшибкиДоступа;
	
КонецФункции

#КонецОбласти
