Процедура УправлениеЭУ()
	
	Элементы.Продолжить.Доступность = (ЗначениеВыбора = 1);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭУ();
	
КонецПроцедуры


&НаКлиенте
Процедура ПереключательСогласенПриИзменении(Элемент)
	
	УправлениеЭУ();
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПродолжить(Команда)
	
	Закрыть(КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ОсновнойТекст) Тогда 
		Элементы.ОсновнойТекст.Заголовок = Параметры.ОсновнойТекст;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ТекстПереключатель1) Тогда 
		Элементы.ПереключательСогласен.СписокВыбора.Добавить(0, Параметры.ТекстПереключатель1, Истина);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Параметры.ТекстПереключатель2) Тогда 
		Элементы.ПереключательСогласен.СписокВыбора.Добавить(1, Параметры.ТекстПереключатель2);
	КонецЕсли;

КонецПроцедуры
