#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПерезаполнитьЗначенияПоУмолчанию() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации";
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	Иначе
		Выборка = Результат.Выбрать();
	КонецЕсли;
	
	НастройкиУчетаЗарплаты  = РегистрыСведений.НастройкиУчетаЗарплаты.СоздатьМенеджерЗаписи();
	РезервЕжегодныхОтпусков = Справочники.Резервы.НайтиПоНаименованию("Резерв ежегодных отпусков", Истина);
	
	Пока Выборка.Следующий() Цикл
		
		НастройкиУчетаЗарплаты.Организация = Выборка.Организация;
		НастройкиУчетаЗарплаты.Прочитать();
		НастройкиУчетаЗарплаты.Организация = Выборка.Организация;
		НастройкиУчетаЗарплаты.ИспользоватьФорматОбменаЗУП25 = НастройкиУчетаЗарплаты.ИспользоватьФорматОбменаЗУП25;
		НастройкиУчетаЗарплаты.СписаниеДепонированныхСумм    = НастройкиУчетаЗарплаты.СписаниеДепонированныхСумм;
		НастройкиУчетаЗарплаты.РезервОтпусков = РезервЕжегодныхОтпусков;
		
		Попытка
			НастройкиУчетаЗарплаты.Записать();
		Исключение
			ТекстСообщения	= НСтр("ru = 'Не выполнено обновление записей регистра сведений ""Настройки учета зарплаты""'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьПорядокПримененияВычетовПоНДФЛ() Экспорт
	
	Если Константы.УчетЗарплатыИКадровВоВнешнейПрограмме.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УчетнаяПолитикаПоНДФЛ.ГоловнаяОрганизация
	|ПОМЕСТИТЬ ВТ_УПНДФЛ
	|ИЗ
	|	РегистрСведений.УчетнаяПолитикаПоНДФЛ КАК УчетнаяПолитикаПоНДФЛ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Организации.Ссылка
	|ПОМЕСТИТЬ ВТ_Организации
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.Ссылка = Организации.ГоловнаяОрганизация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Организации.Ссылка
	|ИЗ
	|	ВТ_Организации КАК ВТ_Организации,
	|	ВТ_УПНДФЛ КАК ВТ_УПНДФЛ
	|ГДЕ
	|	НЕ ВТ_Организации.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_УПНДФЛ.ГоловнаяОрганизация
	|				ИЗ
	|					ВТ_УПНДФЛ КАК ВТ_УПНДФЛ)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	УчетнаяПолитикаПоНДФЛ  = РегистрыСведений.УчетнаяПолитикаПоНДФЛ.СоздатьМенеджерЗаписи();
	Пока Выборка.Следующий() Цикл
		
		УчетнаяПолитикаПоНДФЛ.ГоловнаяОрганизация = Выборка.Ссылка;
		УчетнаяПолитикаПоНДФЛ.Прочитать();		
		УчетнаяПолитикаПоНДФЛ.ГоловнаяОрганизация = Выборка.Ссылка;
		УчетнаяПолитикаПоНДФЛ.ОсобенностиИсчисленияНДФЛ = Перечисления.ОсобенностиИсчисленияНДФЛ.СтандартныеВычетыНарастающимИтогом;
			
		Попытка
			УчетнаяПолитикаПоНДФЛ.Записать();
		Исключение
			ТекстСообщения	= НСтр("ru = 'Не выполнено обновление записей регистра сведений ""Учетная политика по НДФЛ""'");
			ЗаписьЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ВызватьИсключение;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли