&НаКлиенте
Перем ОтветПередЗакрытием;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ЗакрыватьПриЗакрытииВладельца = Истина;
	
	ГоловнаяОрганизация	= Параметры.ГоловнаяОрганизация;
	ДиректКостинг = ?(Параметры.ДиректКостинг, 1, 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если НЕ Модифицированность Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтветПередЗакрытием <> Истина Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения(
			"ПередЗакрытиемЗавершение",
			ЭтотОбъект);
			
		ТекстВопроса = НСтр("ru='Сохранить изменения?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ОК(Команда)

	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Модифицированность = Ложь;
	ПараметрыЗакрытия = ПолучитьПараметрыЗакрытия();
	Закрыть(ПараметрыЗакрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура МетодыРаспределенияОбщепроизводственныхИОбщехозяйственныхРасходов(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", ГоловнаяОрганизация));
	ОткрытьФорму("РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.ФормаСписка", ПараметрыФормы);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Если НЕ ПроверитьЗаполнение() Тогда
			Возврат;
		КонецЕсли;
		ОтветПередЗакрытием	= Истина;
		ПараметрыЗакрытия = ПолучитьПараметрыЗакрытия();
		Закрыть(ПараметрыЗакрытия);
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		ОтветПередЗакрытием	= Истина;
		Закрыть();
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьПараметрыЗакрытия()
	
	ПараметрыЗакрытия = Новый Структура;
	ПараметрыЗакрытия.Вставить("ДиректКостинг", ?(ДиректКостинг = 1, Истина, Ложь));
	
	Возврат ПараметрыЗакрытия;
	
КонецФункции