
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбновитьСтавкиРефинансирования() Экспорт
	
	Если АвтономнаяРаботаСлужебный.ЭтоАвтономноеРабочееМесто() Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьСтавкуРефинансирования('20030217', 18);
	УстановитьСтавкуРефинансирования('20030621', 16);
	УстановитьСтавкуРефинансирования('20040115', 14);
	УстановитьСтавкуРефинансирования('20040615', 13);
	УстановитьСтавкуРефинансирования('20051226', 12);
	УстановитьСтавкуРефинансирования('20060626', 11.5);
	УстановитьСтавкуРефинансирования('20061023', 11);
	УстановитьСтавкуРефинансирования('20070129', 10.5);
	УстановитьСтавкуРефинансирования('20070619', 10);
	УстановитьСтавкуРефинансирования('20080204', 10.25);
	УстановитьСтавкуРефинансирования('20080429', 10.5);
	УстановитьСтавкуРефинансирования('20080610', 10.75);
	УстановитьСтавкуРефинансирования('20080714', 11);
	УстановитьСтавкуРефинансирования('20081112', 12);
	УстановитьСтавкуРефинансирования('20081201', 13);
	УстановитьСтавкуРефинансирования('20090424', 12.5);
	УстановитьСтавкуРефинансирования('20090514', 12);
	УстановитьСтавкуРефинансирования('20090605', 11.5);
	УстановитьСтавкуРефинансирования('20090713', 11);
	УстановитьСтавкуРефинансирования('20090810', 10.75);
	УстановитьСтавкуРефинансирования('20090915', 10.5);
	УстановитьСтавкуРефинансирования('20090930', 10);
	УстановитьСтавкуРефинансирования('20091030', 9.5);
	УстановитьСтавкуРефинансирования('20091125', 9);
	УстановитьСтавкуРефинансирования('20091228', 8.75);
	УстановитьСтавкуРефинансирования('20100224', 8.5);
	УстановитьСтавкуРефинансирования('20100329', 8.25);
	УстановитьСтавкуРефинансирования('20100430', 8);
	УстановитьСтавкуРефинансирования('20100601', 7.75);
	УстановитьСтавкуРефинансирования('20110228', 8);
	УстановитьСтавкуРефинансирования('20110503', 8.25);
	УстановитьСтавкуРефинансирования('20111226', 8);
	УстановитьСтавкуРефинансирования('20120914', 8.25);

КонецПроцедуры

Процедура УстановитьСтавкуРефинансирования(Дата, Ставка)
	
	МенеджерЗаписи = РегистрыСведений.СтавкаРефинансированияЦБ.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.Прочитать();
	Если МенеджерЗаписи.Выбран() И МенеджерЗаписи.Размер = Ставка Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи.Период = Дата;
	МенеджерЗаписи.Размер = Ставка;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

#КонецЕсли