////////////////////////////////////////////////////////////////////////////////
// Подсистема "Криптография".
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

Функция ПоддерживаемыеКриптопровайдеры() Экспорт
	
	СписокКриптопровайдеров = Новый Массив;
	СписокКриптопровайдеров.Добавить(КриптопровайдерCryptoPro());
	СписокКриптопровайдеров.Добавить(КриптопровайдерViPNet());
	
	Возврат Новый ФиксированныйМассив(СписокКриптопровайдеров);
	
КонецФункции

Функция КриптопровайдерCryptoPro() Экспорт
	
	Возврат Новый ФиксированнаяСтруктура(Новый Структура("Имя, Путь, Тип", "Crypto-Pro GOST R 34.10-2001 Cryptographic Service Provider", "", 75));
	
КонецФункции

Функция КриптопровайдерViPNet() Экспорт
	
	Возврат Новый ФиксированнаяСтруктура(Новый Структура("Имя, Путь, Тип", "Infotecs Cryptographic Service Provider", "", 2));
	
КонецФункции

#КонецОбласти