&НаКлиенте
Перем СтарыйВидОперации;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();


	// СчетДт

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СчетДт");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтметкаНезаполненногоСчетДт", ВидСравненияКомпоновкиДанных.НеРавно, Истина);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);


	// СчетКт

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СчетКт");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтметкаНезаполненногоСчетКт", ВидСравненияКомпоновкиДанных.НеРавно, Истина);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);


	// Только для валютной дебиторской задолженности

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаДебиторскаяЗадолженностьКурсВзаиморасчетов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаДебиторскаяЗадолженностьКратностьВзаиморасчетов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаДебиторскаяЗадолженностьВспомогательнаяКурсВзаиморасчетов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаДебиторскаяЗадолженностьВспомогательнаяКратностьВзаиморасчетов");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ДебиторскаяЗадолженность.КурсВзаиморасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветРамки);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);


	// Только для валютной кредиторской задолженности

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаКредиторскаяЗадолженностьКурсВзаиморасчетов");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаКредиторскаяЗадолженностьКратностьВзаиморасчетов");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.КредиторскаяЗадолженность.КурсВзаиморасчетовДоступность", ВидСравненияКомпоновкиДанных.Равно, Ложь);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ЦветРамки);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);


	// Не используются при списании задолженности

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаДебиторскаяЗадолженностьСуммаНУ");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаКредиторскаяЗадолженностьСуммаНУ");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ТаблицаДебиторскаяЗадолженностьВспомогательнаяСуммаНУ");

	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности);
	СписокЗначений.Добавить(Перечисления.ВидыОперацийКорректировкаДолга.Прочее);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВидОперации", ВидСравненияКомпоновкиДанных.НеВСписке, СписокЗначений);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);


	// Разница

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Разница");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Разница", ВидСравненияКомпоновкиДанных.Заполнено);
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов);
	СписокЗначений.Добавить(Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности);

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ВидОперации", ВидСравненияКомпоновкиДанных.ВСписке, СписокЗначений);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.РезультатПроблемаЦвет);


	// Дебитор, ДебиторВспомогательный

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Дебитор");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ДебиторВспомогательный");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтметкаНезаполненногоДебитор", ВидСравненияКомпоновкиДанных.НеРавно, Истина);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);


	// Кредитор

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "Кредитор");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ОтметкаНезаполненногоКредитор", ВидСравненияКомпоновкиДанных.НеРавно, Истина);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);

	УстановитьСостояниеДокумента();
	
	// Инициализируем реквизиты формы:
	ПоказыватьВДокументахСчетаУчета = Истина;
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	ОбновитьФлагиУсловногоОформления(ЭтаФорма);
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
	
КонецПроцедуры

&НаСервере 
Процедура УправлениеФормой()

	//Управление доступностью курсом и кратностью расчетов
	Элементы.КурсДокумента.Видимость = ЭтаФорма.КурсВалютыВШапке;
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов") 
		ИЛИ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности") Тогда
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.Видимость = Ложь;
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорСчетУчетаРасчетов.Видимость = Ложь;
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.СчетаУчета.Видимость = Ложь;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
			Элементы.ВидАванса.Заголовок = "Зачесть аванс";
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда
			Элементы.ВидАванса.Заголовок = "Зачесть задолженность";
		КонецЕсли;
		
		Элементы.ВидАванса.Видимость = Истина;
		
		Элементы.ТипАванса.Видимость = Истина;
		
		Элементы.ВидЗадолженностиДляПереноса.Видимость = Ложь;
		
		//Пропишем виды значений списка выбора переключателя "Зачет аванса"/"Зачет задолженности"
		//Получаем список выбора
		СписокЗначенийПереключателяВидАванса = Элементы.ВидАванса.СписокВыбора;
		
		//Проверяем, если текущее значение на в списке, соответствующем виду операции, то
		Если (СписокЗначенийПереключателяВидАванса.НайтиПоЗначению(Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя) = Неопределено 
			И Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов)
			ИЛИ (СписокЗначенийПереключателяВидАванса.НайтиПоЗначению(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя) = Неопределено 
			И Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности)
			ИЛИ СписокЗначенийПереключателяВидАванса.Количество() > 2 Тогда
			
			//очищаем список
			СписокЗначенийПереключателяВидАванса.Очистить();
			
		КонецЕсли;
		
		//Если список пустой, то заполняем его значениями соответствующими виду операции
		Если СписокЗначенийПереключателяВидАванса.Количество() = 0 Тогда
			
			Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
				
				СписокЗначенийПереключателяВидАванса.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя, "Покупателя");
				СписокЗначенийПереключателяВидАванса.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Поставщику");
				
				Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ПустаяСсылка()
					ИЛИ (НЕ Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя
					И НЕ Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику) Тогда
					Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя;
				КонецЕсли;	
				
			Иначе
				
				СписокЗначенийПереключателяВидАванса.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя, "Покупателя");
				СписокЗначенийПереключателяВидАванса.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Поставщику");
				
				Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ПустаяСсылка()
					ИЛИ (НЕ Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя
					И НЕ Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику) Тогда
					Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя;
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;
		
		Если Объект.ТипАвансаЗадолженности = Перечисления.ТипыЗадолженности.ПустаяСсылка() Тогда
			Объект.ТипАвансаЗадолженности = Перечисления.ТипыЗадолженности.СамогоКонтрагента;
		КонецЕсли;	
		
		//Зададим представление элементов списка выбора переключателя "В счет задолженности" в зависимости от выбранных значений
		//переключателя "Зачет авансов"/"Зачет задолженности" и вида операции
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
			
			Если НЕ Элементы.ТипАванса.СписокВыбора[0].Представление = "Покупателя перед нашей организацией"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
				Элементы.ТипАванса.СписокВыбора[0].Представление = "Покупателя перед нашей организацией";
			ИначеЕсли НЕ Элементы.ТипАванса.СписокВыбора[0].Представление = "Нашей организации перед покупателем"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда
				Элементы.ТипАванса.СписокВыбора[0].Представление = "Нашей организации перед покупателем";
			КонецЕсли;
			
			Если НЕ Элементы.ТипАванса.СписокВыбора[1].Представление = "Третьего лица перед нашей организацией"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
				Элементы.ТипАванса.СписокВыбора[1].Представление = "Третьего лица перед нашей организацией";
			ИначеЕсли НЕ Элементы.ТипАванса.СписокВыбора[1].Представление = "Нашей организации перед третьим лицом"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда
				Элементы.ТипАванса.СписокВыбора[1].Представление = "Нашей организации перед третьим лицом";
			КонецЕсли;
			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			
			Если НЕ Элементы.ТипАванса.СписокВыбора[0].Представление = "Нашей организации перед поставщиком"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
				Элементы.ТипАванса.СписокВыбора[0].Представление = "Нашей организации перед поставщиком";
			ИначеЕсли НЕ Элементы.ТипАванса.СписокВыбора[0].Представление = "Поставщика перед нашей организацией"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда
				Элементы.ТипАванса.СписокВыбора[0].Представление = "Поставщика перед нашей организацией";
			КонецЕсли;
			
			Если НЕ Элементы.ТипАванса.СписокВыбора[1].Представление = "Нашей организации перед третьим лицом"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
				Элементы.ТипАванса.СписокВыбора[1].Представление = "Нашей организации перед третьим лицом";
			ИначеЕсли НЕ Элементы.ТипАванса.СписокВыбора[1].Представление = "Третьего лица перед нашей организацией"
				и Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда
				Элементы.ТипАванса.СписокВыбора[1].Представление = "Третьего лица перед нашей организацией";
			КонецЕсли;
			
		КонецЕсли;
		
		//Зададим видимость и заголовки зависимым элементам формы.
		Если Объект.ТипАвансаЗадолженности = Перечисления.ТипыЗадолженности.СамогоКонтрагента Тогда
		
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя
				или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
				
				Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок = "Авансы покупателя (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок = "Авансы покупателя (кредиторская задолженность)";
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность покупателя (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность покупателя (дебиторская задолженность)";
					КонецЕсли;	
					
					Если Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Истина;
					КонецЕсли;	
					
					Если НЕ Элементы.Кредитор.Заголовок = "Покупатель (кредитор)" Тогда
						Элементы.Кредитор.Заголовок = "Покупатель (кредитор)";
					КонецЕсли;	
					
					Если Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Ложь;
					КонецЕсли;	
					
				Иначе
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Заголовок = "Задолженность покупателя (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженность.Заголовок = "Задолженность покупателя (дебиторская задолженность)";
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок = "Задолженность перед покупателем (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок = "Задолженность перед покупателем (кредиторская задолженность)";
					КонецЕСли;	
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
					КонецЕсли;	
					
					Если НЕ Элементы.Дебитор.Заголовок   = "Покупатель (дебитор)" Тогда
						Элементы.Дебитор.Заголовок = "Покупатель (дебитор)";
					КонецЕсли;	
					
					
					Если НЕ Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Ложь;
					КонецЕсли;
					
					Если Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Ложь;
					КонецЕсли;	
					
				КонецЕсли;	
				
			ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику
				или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
				
				Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Заголовок  =  "Авансы поставщику (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженность.Заголовок  =  "Авансы поставщику (дебиторская задолженность)";
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок =  "Задолженность поставщику (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок =  "Задолженность поставщику (кредиторская задолженность)";
					КонецЕсли;	
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;	
					
					Если Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
					КонецЕсли;	
					
					Если НЕ Элементы.Дебитор.Заголовок = "Поставщик (дебитор)" Тогда
						Элементы.Дебитор.Заголовок = "Поставщик (дебитор)";
					КонецЕсли;	
					
					Если НЕ Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Ложь;
					КонецЕсли;
					
					Если Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Ложь;
					КонецЕсли;	
					
				Иначе
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок = "Задолженность поставщику (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок = "Задолженность поставщику (кредиторская задолженность)";
					КонецЕсли;	
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность поставщика (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность поставщика (дебиторская задолженность)";
					КонецЕсли;	
					
					Если Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Истина;
					КонецЕсли;	
					
					Если НЕ Элементы.Кредитор.Заголовок   = "Поставщик (кредитор)" Тогда
						Элементы.Кредитор.Заголовок   = "Поставщик (кредитор)";
					КонецЕсли;	
					
					Если Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Ложь;
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЕсли;
			
		Иначе
			
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя
				или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
				
				Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок = "Авансы покупателя (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок = "Авансы покупателя (кредиторская задолженность)";
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность третьего лица (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность третьего лица (дебиторская задолженность)";
					КонецЕсли;	
					
					Если Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Истина;
					КонецЕсли;	
					
					Если НЕ Элементы.Кредитор.Заголовок = "Покупатель (кредитор)" Тогда
						Элементы.Кредитор.Заголовок               = "Покупатель (кредитор)";
					КонецЕсли;	
					
					Если НЕ Элементы.ДебиторВспомогательный.Заголовок = "Третье лицо (дебитор)" Тогда
						Элементы.ДебиторВспомогательный.Заголовок = "Третье лицо (дебитор)";
					КонецЕсли;	
					
					Если Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Истина;
					КонецЕсли;	
					
				Иначе
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Заголовок  =  "Задолженность покупателя (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженность.Заголовок  =  "Задолженность покупателя (дебиторская задолженность)";
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок =  "Задолженность перед третьим лицом (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок =  "Задолженность перед третьим лицом (кредиторская задолженность)";
					КонецЕсли;	
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
					КонецЕсли;	
					
					Если НЕ Элементы.Дебитор.Заголовок  = "Покупатель (дебитор)" Тогда
						Элементы.Дебитор.Заголовок  = "Покупатель (дебитор)";
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Заголовок = "Третье лицо (кредитор)" Тогда
						Элементы.Кредитор.Заголовок = "Третье лицо (кредитор)";
					КонецЕсли;	
					
					Если НЕ Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Ложь;
					КонецЕсли;
					
				КонецЕсли;	
				
			ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику
				или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
				
				Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Заголовок  =  "Авансы поставщику (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженность.Заголовок  =  "Авансы поставщику (дебиторская задолженность)";
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок =  "Задолженность перед третьим лицом (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок =  "Задолженность перед третьим лицом (кредиторская задолженность)";
					КонецЕсли;	
					
					Если НЕ Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
					КонецЕсли;	
					
					Если НЕ Элементы.Дебитор.Заголовок  = "Поставщик (дебитор)" Тогда
						Элементы.Дебитор.Заголовок  = "Поставщик (дебитор)";
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Заголовок = "Третье лицо (кредитор)" Тогда
						Элементы.Кредитор.Заголовок = "Третье лицо (кредитор)";
					КонецЕсли;	
					
					Если НЕ Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Истина;
					КонецЕсли;
					
					Если Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Ложь;
					КонецЕсли;	
					
				Иначе
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Заголовок = "Задолженность поставщику (кредиторская задолженность)" Тогда
						Элементы.КредиторскаяЗадолженность.Заголовок = "Задолженность поставщику (кредиторская задолженность)";
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность третьего лица (дебиторская задолженность)" Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Заголовок = "Задолженность третьего лица (дебиторская задолженность)";
					КонецЕсли;	
					
					Если Элементы.ДебиторскаяЗадолженность.Видимость Тогда
						Элементы.ДебиторскаяЗадолженность.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.КредиторскаяЗадолженность.Видимость Тогда
						Элементы.КредиторскаяЗадолженность.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость Тогда
						Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Заголовок   = "Поставщик (кредитор)" Тогда
						Элементы.Кредитор.Заголовок   = "Поставщик (кредитор)";
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторВспомогательный.Заголовок = "Третье лицо (дебитор)" Тогда
						Элементы.ДебиторВспомогательный.Заголовок = "Третье лицо (дебитор)";
					КонецЕсли;	
					
					Если Элементы.Дебитор.Видимость Тогда
						Элементы.Дебитор.Видимость = Ложь;
					КонецЕсли;
					
					Если НЕ Элементы.Кредитор.Видимость Тогда
						Элементы.Кредитор.Видимость = Истина;
					КонецЕсли;
					
					Если НЕ Элементы.ДебиторВспомогательный.Видимость Тогда
						Элементы.ДебиторВспомогательный.Видимость = Истина;
					КонецЕсли;	
					
				КонецЕсли;	
				
			КонецЕсли;
			
		КонецЕсли;	
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности 
		или Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ПустаяСсылка() Тогда
			Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя;
		КонецЕсли;	
		
		Элементы.ВидАванса.Видимость = Ложь;
		Элементы.ТипАванса.Видимость = Ложь;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда
			Элементы.СчетаУчета.Видимость           = Ложь;
		Иначе
			
			Элементы.СчетаУчета.Заголовок           = "Счет списания";
			Элементы.СчетаУчета.Видимость           = Истина;
			
		КонецЕсли;
		
		Элементы.ВидЗадолженностиДляПереноса.Заголовок = ?(Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности, "Перенести", "Списать");
		
		Элементы.ВидЗадолженностиДляПереноса.Видимость = Истина;
		
		СписокВыбораПереключателя = Элементы.ВидЗадолженностиДляПереноса.СписокВыбора;
		
		Если СписокВыбораПереключателя.Количество() < 4 Тогда
			
			СписокВыбораПереключателя.Очистить();
			
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя, "Задолженность покупателя");
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя,        "Авансы покупателя");
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Задолженность поставщику");
			СписокВыбораПереключателя.Добавить(Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику,        "Авансы поставщику");
			
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ПустаяСсылка() Тогда
				Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя;
			КонецЕсли;	
			
		КонецЕсли;	
		
		Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
		
		Элементы.ДебиторВспомогательный.Видимость = Ложь;
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя 
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			
			Элементы.Дебитор.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Поставщик (дебитор)", "Покупатель (дебитор)");
			Элементы.Кредитор.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Новый поставщик",     "Новый покупатель");
			
			Элементы.ДебиторскаяЗадолженность.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику, "Авансы поставщику (дебиторская задолженность)", "Задолженность покупателя (дебиторская задолженность)");
			
			Элементы.ДебиторскаяЗадолженность.Видимость  = Истина;
			Элементы.КредиторскаяЗадолженность.Видимость = Ложь;
			
			Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
				
				Элементы.ГруппаСчетДт.Видимость = Истина;
				Элементы.ГруппаСчетКт.Видимость = Ложь;
				
				Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Ложь;
				Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость  = Ложь;
				
				Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
				Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного  = Ложь;
				
			Иначе
				
				Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Истина;
				Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость  = Истина;
				
				Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Истина;
				Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного  = Истина;
				
			КонецЕсли;	

			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя 
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			
			Элементы.Дебитор.Заголовок  = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Поставщик (кредитор)", "Покупатель (кредитор)");
			Элементы.Кредитор.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Новый поставщик",     "Новый покупатель");
			
			Элементы.КредиторскаяЗадолженность.Заголовок = ?(Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику, "Задолженность поставщику (кредиторская задолженность)", "Авансы покупателя (кредиторская задолженность)");
			
			Элементы.ДебиторскаяЗадолженность.Видимость  = Ложь;
			Элементы.КредиторскаяЗадолженность.Видимость = Истина;
			
			Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда
				
				Элементы.ГруппаСчетДт.Видимость = Ложь;
				Элементы.ГруппаСчетКт.Видимость = Истина;
				
				Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Ложь;
				Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость  = Ложь;
				
				Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
				Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного  = Ложь;
				
			Иначе
				
				Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость = Истина;
				Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость  = Истина;
				
				Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Истина;
				Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного  = Истина;
				
			КонецЕсли;	
			
		КонецЕсли;
		
		Элементы.Дебитор.Видимость                = Истина;
		Элементы.Кредитор.Видимость               = ?(Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности, Истина, Ложь);
		
	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее или НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.Видимость               = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.Видимость                = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.Видимость = Ложь;
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость               = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.Видимость                = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорСчетУчетаРасчетов.Видимость = Ложь;
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного               = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.АвтоОтметкаНезаполненного                = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ТаблицаКредиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного               = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного                = Ложь;
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорСчетУчетаРасчетов.АвтоОтметкаНезаполненного = Ложь;
		
		Элементы.ВидАванса.Видимость = Ложь;
		Элементы.ТипАванса.Видимость = Ложь;
		Элементы.ВидЗадолженностиДляПереноса.Видимость = Ложь;
		
		Элементы.Дебитор.Заголовок  = "Дебитор";
		Элементы.Кредитор.Заголовок = "Кредитор";
		
		Элементы.Дебитор.Видимость                = Истина;
		Элементы.Кредитор.Видимость               = Истина;
		Элементы.ДебиторВспомогательный.Видимость = Ложь;
		
		Элементы.ДебиторскаяЗадолженность.Заголовок  = "Дебиторская задолженность";
		Элементы.КредиторскаяЗадолженность.Заголовок = "Кредиторская задолженность";
		
		Элементы.ДебиторскаяЗадолженность.Видимость  = Истина;
		Элементы.КредиторскаяЗадолженность.Видимость = Истина;
		Элементы.ДебиторскаяЗадолженностьВспомогательная.Видимость = Ложь;
		
		Элементы.СчетаУчета.Заголовок = "Счета учета";
		Элементы.СчетаУчета.Видимость = Истина;
		
		Элементы.ГруппаСчетДт.Видимость = Истина;
		Элементы.ГруппаСчетКт.Видимость = Истина;
		
	КонецЕсли;

	Если Элементы.СчетаУчета.Видимость Тогда
		
		ВидимостьСубконто = Ложь;
		
		Если Объект.ВидОперации  = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности 
			или Объект.ВидОперации  = Перечисления.ВидыОперацийКорректировкаДолга.Прочее 
			или НЕ ЗначениеЗаполнено(Объект.ВидОперации) Тогда
			ВидимостьСубконто = Истина;
		КонецЕсли;
		
		Элементы.ЗаголовокСубконтоДт1.Видимость = ВидимостьСубконто;
		Элементы.ЗаголовокСубконтоДт2.Видимость = ВидимостьСубконто;
		Элементы.ЗаголовокСубконтоДт3.Видимость = ВидимостьСубконто;
		Элементы.СубконтоДт1.Видимость 			= ВидимостьСубконто;
		Элементы.СубконтоДт2.Видимость 			= ВидимостьСубконто;
		Элементы.СубконтоДт3.Видимость 			= ВидимостьСубконто;

		Элементы.ЗаголовокСубконтоКт1.Видимость = ВидимостьСубконто;
		Элементы.ЗаголовокСубконтоКт2.Видимость = ВидимостьСубконто;
		Элементы.ЗаголовокСубконтоКт3.Видимость = ВидимостьСубконто;
		Элементы.СубконтоКт1.Видимость 			= ВидимостьСубконто;
		Элементы.СубконтоКт2.Видимость 			= ВидимостьСубконто;
		Элементы.СубконтоКт3.Видимость 			= ВидимостьСубконто;
	КонецЕсли;

	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетДт, "Дт");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Дт", "Дт");
	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетКт, "Кт");
	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Кт", "Кт");
	УстановитьФлагОтметкиНезаполненногоСчетов(ЭтаФорма);
	УстановитьФлагОтметкиНезаполненногоДебитора(ЭтаФорма);
	УстановитьФлагОтметкиНезаполненногоКредитора(ЭтаФорма);
	
	УстановитьПараметрыВыбора();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьПризнакАвансаВСтроке(Знач ИмяТабЧасти, ДанныеСтроки, Знач РеквизитыДоговора)

	Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
		ДанныеСтроки.ЭтоАванс = РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
			ИЛИ (РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
					ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку
					ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
					ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку)
				И (БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(ДанныеСтроки.СчетУчетаРасчетов, ПланыСчетов.Хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)
					ИЛИ БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(ДанныеСтроки.СчетУчетаРасчетов, ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчикамиВал));
	ИначеЕсли ИмяТабЧасти = "КредиторскаяЗадолженность" Тогда
		ДанныеСтроки.ЭтоАванс = РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем
			ИЛИ (РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
					ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку
					ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером
					ИЛИ РеквизитыДоговора.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку)
				И (БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(ДанныеСтроки.СчетУчетаРасчетов, ПланыСчетов.Хозрасчетный.РасчетыСПокупателямиИЗаказчиками)
					ИЛИ БухгалтерскийУчетВызовСервераПовтИсп.СчетВИерархии(ДанныеСтроки.СчетУчетаРасчетов, ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчикамиВал));
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	ТаблицаДоговоров = Объект.ДебиторскаяЗадолженность.Выгрузить(, "ДоговорКонтрагента");
	Для Каждого СтрокаКредиторки Из Объект.КредиторскаяЗадолженность Цикл
		СтрокаДоговора = ТаблицаДоговоров.Добавить();
		СтрокаДоговора.ДоговорКонтрагента = СтрокаКредиторки.ДоговорКонтрагента;
	КонецЦикла; 
	ТаблицаДоговоров.Свернуть("ДоговорКонтрагента");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокДоговоров", ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорКонтрагента"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента,
	|	ДоговорыКонтрагентов.ВидДоговора,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.РасчетыВУсловныхЕдиницах
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка В(&СписокДоговоров)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорКонтрагента";
	РеквизитыДоговоров = Запрос.Выполнить().Выгрузить();
	РеквизитыДоговоров.Индексы.Добавить("ДоговорКонтрагента");
	
	Для Каждого ДанныеСтроки Из Объект.ДебиторскаяЗадолженность Цикл
		СтрокаДоговора = РеквизитыДоговоров.Найти(ДанныеСтроки.ДоговорКонтрагента, "ДоговорКонтрагента");
		Если СтрокаДоговора <> Неопределено Тогда
			УстановитьПризнакАвансаВСтроке("ДебиторскаяЗадолженность", ДанныеСтроки, СтрокаДоговора);
			Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
				
				Если НЕ ДанныеСтроки.ЭтоАванс Тогда
					ДанныеСтроки.КурсВзаиморасчетовДоступность = СтрокаДоговора.ВалютаВзаиморасчетов <> Объект.ВалютаДокумента;
				Иначе
					ДанныеСтроки.КурсВзаиморасчетовДоступность = Ложь;
				КонецЕсли;
				
			Иначе
				ДанныеСтроки.КурсВзаиморасчетовДоступность = НЕ ДанныеСтроки.ЭтоАванс;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого ДанныеСтроки Из Объект.КредиторскаяЗадолженность Цикл
		СтрокаДоговора = РеквизитыДоговоров.Найти(ДанныеСтроки.ДоговорКонтрагента, "ДоговорКонтрагента");
		Если СтрокаДоговора <> Неопределено Тогда
			УстановитьПризнакАвансаВСтроке("КредиторскаяЗадолженность", ДанныеСтроки, СтрокаДоговора);
			Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
				
				Если НЕ ДанныеСтроки.ЭтоАванс Тогда
					ДанныеСтроки.КурсВзаиморасчетовДоступность = СтрокаДоговора.ВалютаВзаиморасчетов <> Объект.ВалютаДокумента;
				Иначе
					ДанныеСтроки.КурсВзаиморасчетовДоступность = Ложь;
				КонецЕсли;
				
			Иначе
				ДанныеСтроки.КурсВзаиморасчетовДоступность = НЕ ДанныеСтроки.ЭтоАванс;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста 
Процедура ОбновитьФлагиУсловногоОформления(Форма)

	Форма.КурсВалютыВШапке = Форма.Объект.ВалютаДокумента <> Форма.ВалютаРегламентированногоУчета 
		И ЗначениеЗаполнено(Форма.Объект.ВалютаДокумента);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовкиИДоступностьСубконто(Форма, Счет, Суффикс = "")

	ПоляФормы = Новый Структура("Субконто1, Субконто2, Субконто3",
		"Субконто"+Суффикс+"1", "Субконто"+Суффикс+"2", "Субконто"+Суффикс+"3");

	ЗаголовкиПолей = Новый Структура("Субконто1, Субконто2, Субконто3",
		"ЗаголовокСубконто"+Суффикс+"1", "ЗаголовокСубконто"+Суффикс+"2", "ЗаголовокСубконто"+Суффикс+"3");

	БухгалтерскийУчетКлиентСервер.ПриВыбореСчета(Счет, Форма, ПоляФормы, ЗаголовкиПолей);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбора()
	
	МассивПараметровДебиторскойЗадолженности  = Новый Массив;
	МассивПараметровКредиторскойЗадолженности = Новый Массив;
	
	Если Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
		МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВалютаВзаиморасчетов", Объект.ВалютаДокумента));
		МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВалютаВзаиморасчетов", Объект.ВалютаДокумента));
	Иначе
		МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ОплатаВВалюте", Ложь));
		МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ОплатаВВалюте", Ложь));
	КонецЕсли;
	
	Если НЕ Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
		
		МассивВидовДоговоровДебиторскойЗадолженности  = Новый Массив;
		МассивВидовДоговоровКредиторскойЗадолженности = Новый Массив;
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов Тогда
			
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
				
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
			Иначе
				
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
			КонецЕсли;
			
			МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровДебиторскойЗадолженности)));
			МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровКредиторскойЗадолженности)));
			
		ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда
			
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			
			МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровДебиторскойЗадолженности)));
			МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровКредиторскойЗадолженности)));
			
		Иначе
			
			Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
				
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
				МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровКредиторскойЗадолженности)));
				
			ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
				
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
				МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровДебиторскойЗадолженности)));
				
			ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
				
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
				МассивПараметровДебиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровДебиторскойЗадолженности)));
				
			ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
				
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
				МассивВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
				
				МассивПараметровКредиторскойЗадолженности.Добавить(Новый ПараметрВыбора("Отбор.ВидДоговора", Новый ФиксированныйМассив(МассивВидовДоговоровКредиторскойЗадолженности)));
				
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЕсли;	
	
	НовыеПараметрыВыбораДебиторскойЗадолженности  = Новый ФиксированныйМассив(МассивПараметровДебиторскойЗадолженности);
	НовыеПараметрыВыбораКредиторскойЗадолженности = Новый ФиксированныйМассив(МассивПараметровКредиторскойЗадолженности);
	
	Элементы.ТаблицаДебиторскаяЗадолженностьДоговорКонтрагента.ПараметрыВыбора                = НовыеПараметрыВыбораДебиторскойЗадолженности;
	Элементы.ТаблицаКредиторскаяЗадолженностьДоговорКонтрагента.ПараметрыВыбора               = НовыеПараметрыВыбораКредиторскойЗадолженности;
	Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяДоговорКонтрагента.ПараметрыВыбора = НовыеПараметрыВыбораДебиторскойЗадолженности;
	
	Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.ПараметрыВыбора                = НовыеПараметрыВыбораДебиторскойЗадолженности;
	Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.ПараметрыВыбора               = НовыеПараметрыВыбораКредиторскойЗадолженности;
	Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяКорДоговорКонтрагента.ПараметрыВыбора = НовыеПараметрыВыбораКредиторскойЗадолженности;
	
	СвязиДоговораКредиторки = Новый Массив;
	СвязиДоговораКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
	
	СвязиДоговораДебиторки = Новый Массив;
	СвязиДоговораДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));

	СвязиДокументаКредиторки = Новый Массив;
	СвязиДокументаКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
	
	СвязиДокументаДебиторки = Новый Массив;
	СвязиДокументаДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Организация", "Объект.Организация"));
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов
		или Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности Тогда

		СвязиДоговораКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентКредитор"));
		СвязиДокументаКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.КонтрагентКредитор"));
		
		СвязиДоговораДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентДебитор"));
		СвязиДокументаДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.КонтрагентДебитор"));
		
		Элементы.ТаблицаКредиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		Элементы.ТаблицаКредиторскаяЗадолженностьСделка.СвязиПараметровВыбора             = Новый ФиксированныйМассив(СвязиДокументаКредиторки);
		
		Элементы.ТаблицаДебиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораДебиторки);
		Элементы.ТаблицаДебиторскаяЗадолженностьСделка.СвязиПараметровВыбора             = Новый ФиксированныйМассив(СвязиДокументаДебиторки);
		
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораДебиторки);
		Элементы.ТаблицаДебиторскаяЗадолженностьВспомогательнаяСделка.СвязиПараметровВыбора             = Новый ФиксированныйМассив(СвязиДокументаДебиторки);

	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности Тогда

		СвязиДоговораКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентКредитор"));
		
		СвязиДоговораДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентДебитор"));
		СвязиДокументаДебиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.КонтрагентДебитор"));
		
		Элементы.ТаблицаКредиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора    = Новый ФиксированныйМассив(СвязиДоговораДебиторки);
		Элементы.ТаблицаКредиторскаяЗадолженностьСделка.СвязиПараметровВыбора                = Новый ФиксированныйМассив(СвязиДокументаДебиторки);
		Элементы.ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		
		Элементы.ТаблицаДебиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора    = Новый ФиксированныйМассив(СвязиДоговораДебиторки);
		Элементы.ТаблицаДебиторскаяЗадолженностьСделка.СвязиПараметровВыбора                = Новый ФиксированныйМассив(СвязиДокументаДебиторки);
		Элементы.ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);

	ИначеЕсли Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности Тогда

		СвязиДоговораКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.КонтрагентДебитор"));
		СвязиДокументаКредиторки.Добавить(Новый СвязьПараметраВыбора("Отбор.Контрагент", "Объект.КонтрагентДебитор"));
		
		Элементы.ТаблицаКредиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		Элементы.ТаблицаКредиторскаяЗадолженностьСделка.СвязиПараметровВыбора             = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		
		Элементы.ТаблицаДебиторскаяЗадолженностьДоговорКонтрагента.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиДоговораКредиторки);
		Элементы.ТаблицаДебиторскаяЗадолженностьСделка.СвязиПараметровВыбора             = Новый ФиксированныйМассив(СвязиДоговораКредиторки);

	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагОтметкиНезаполненногоСчетов(Форма)
	
	// Проверяем реквизиты шапки:
	Если Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности") Тогда
		
		Если Форма.Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.АвансыПокупателя")
			или Форма.Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику") Тогда
			Форма.ОтметкаНезаполненногоСчетДт = Ложь;
			Форма.ОтметкаНезаполненногоСчетКт = Истина;
		Иначе
			Форма.ОтметкаНезаполненногоСчетДт = Истина;
			Форма.ОтметкаНезаполненногоСчетКт = Ложь;
		КонецЕсли;
		
	ИначеЕсли Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности") Тогда
		
		Если (Форма.Объект.ДебиторскаяЗадолженность.Количество() > 0) и (Форма.Объект.КредиторскаяЗадолженность.Количество() = 0) Тогда
			
			Форма.ОтметкаНезаполненногоСчетДт = Ложь;
			Форма.ОтметкаНезаполненногоСчетКт = Истина;
			
		ИначеЕсли (Форма.Объект.ДебиторскаяЗадолженность.Количество() = 0) и (Форма.Объект.КредиторскаяЗадолженность.Количество() > 0) Тогда
			
			Форма.ОтметкаНезаполненногоСчетДт = Истина;
			Форма.ОтметкаНезаполненногоСчетКт = Ложь;
			
		ИначеЕсли (Форма.Объект.ДебиторскаяЗадолженность.Количество() > 0) 
			и (Форма.Объект.КредиторскаяЗадолженность.Количество() > 0)	
			И (Форма.Объект.СуммаДтЗадолженности <> Форма.СуммаКтЗадолженности) Тогда
			
			Форма.ОтметкаНезаполненногоСчетДт = Истина;
			Форма.ОтметкаНезаполненногоСчетКт = Истина;
			
		КонецЕсли;
		
	Иначе
		
		Форма.ОтметкаНезаполненногоСчетДт = Ложь;
		Форма.ОтметкаНезаполненногоСчетКт = Ложь;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагОтметкиНезаполненногоДебитора(Форма)
	
	Если Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.Прочее") Тогда
		
		Если Форма.Объект.ДебиторскаяЗадолженность.Количество() = 0 Тогда
			Форма.ОтметкаНезаполненногоДебитор = Ложь;
		КонецЕсли;
		
	Иначе
		Форма.ОтметкаНезаполненногоДебитор = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьФлагОтметкиНезаполненногоКредитора(Форма)
	
	Если Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.Прочее") Тогда
		
		Если Форма.Объект.КредиторскаяЗадолженность.Количество() = 0 Тогда
			Форма.ОтметкаНезаполненногоКредитор = Ложь;
		КонецЕсли;
		
	Иначе
		Форма.ОтметкаНезаполненногоКредитор = Истина;
	КонецЕсли;	
	
КонецПроцедуры

// Заполнение табличных частей

&НаКлиенте
Процедура ВыполнитьКомандуЗаполнения(ИмяКнопки)

	Если Объект.Проведен Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'Заполнение возможно только в непроведенном документе'"));
		Возврат;
	КонецЕсли;

	ОчиститьСообщения();

	СтрокаСообщения = НСтр("ru = 'Заполнение невозможно!'") ;
	Продолжать = Истина;
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов") 
		или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.КонтрагентДебитор) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Дебитор'"),,, СтрокаСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка,
				"КонтрагентДебитор", "Объект");
			Продолжать = Ложь;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(Объект.КонтрагентКредитор) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Кредитор'"),,, СтрокаСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка,
				"КонтрагентКредитор", "Объект");
			Продолжать = Ложь;
		КонецЕсли;

	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности")
		или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.КонтрагентДебитор) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
			НСтр("ru = 'Контрагент'"),,, СтрокаСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка,
			"КонтрагентДебитор", "Объект");
			Продолжать = Ложь;
			
		КонецЕсли;
		
	Иначе
		
		Если НЕ ЗначениеЗаполнено(Объект.КонтрагентДебитор) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Дебитор'"),,, СтрокаСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка,
				"КонтрагентДебитор", "Объект");
			Продолжать = Ложь;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект.КонтрагентКредитор) Тогда
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Поле", "Заполнение",
				НСтр("ru = 'Кредитор'"),,, СтрокаСообщения);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Объект.Ссылка,
				"КонтрагентКредитор", "Объект");
			Продолжать = Ложь;
		КонецЕсли;

	КонецЕсли;

	Если НЕ Продолжать Тогда
		Возврат;
	КонецЕсли;

	ТекстВопроса = "";

	Если ИмяКнопки = "ЗаполнитьВзаиморасчеты" И (Объект.ДебиторскаяЗадолженность.Количество() > 0 ИЛИ Объект.КредиторскаяЗадолженность.Количество() > 0) Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением табличные части будут очищены. Заполнить?'");
	ИначеЕсли ИмяКнопки = "ЗаполнитьДебиторку" И Объект.ДебиторскаяЗадолженность.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением дебиторская задолженность будет очищена. Заполнить?'");
	ИначеЕсли ИмяКнопки = "ЗаполнитьКредиторку" И Объект.КредиторскаяЗадолженность.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru = 'Перед заполнением кредиторская задолженность будет очищена. Заполнить?'");
	КонецЕсли;

	Если ТекстВопроса <> "" Тогда
		ДополнительныеПараметры = Новый Структура("ИмяКнопки", ИмяКнопки);
		Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемТабличнойЧастиЗавершение", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да );
	Иначе
		ЗаполнитьТаблицыРасчетовНаСервере(ИмяКнопки);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВопросПередЗаполнениемТабличнойЧастиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьТаблицыРасчетовНаСервере(ДополнительныеПараметры.ИмяКнопки)
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицыРасчетовНаСервере(ИмяКомандыЗаполнения)

	СписокВидовДоговоровДебиторскойЗадолженности  = Новый Массив;
	
	Если НЕ Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя 
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя 
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику Тогда
			
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			
		КонецЕсли;
		
	Иначе
		
		СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
		СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
		СписокВидовДоговоровДебиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		
	КонецЕсли;	
	
	СписокВидовДоговоровКредиторскойЗадолженности = Новый Массив;
	
	Если НЕ Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда 
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя Тогда
			
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			
		ИначеЕсли Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику 
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПоставщику
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПокупателя Тогда
			
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
			СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
			
		КонецЕсли;
		
	Иначе
		
		СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
		СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
		СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентом);
		СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером);
		СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомитентомНаЗакупку);
		СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку);
		СписокВидовДоговоровКредиторскойЗадолженности.Добавить(Перечисления.ВидыДоговоровКонтрагентов.Прочее);
		
	КонецЕсли;
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетАвансов
		или Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности 
		или Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.Прочее Тогда
		
		Если ИмяКомандыЗаполнения = "ЗаполнитьВзаиморасчеты" или ИмяКомандыЗаполнения = "ЗаполнитьДебиторку" Тогда
			Объект.ДебиторскаяЗадолженность.Очистить();
			Документы.КорректировкаДолга.ЗаполнитьОстаткамиВзаиморасчетов(Объект, Объект.КонтрагентДебитор,  Перечисления.ВидыЗадолженности.Дебиторская, НЕ ЗначениеЗаполнено(Параметры.Ключ), СписокВидовДоговоровДебиторскойЗадолженности);
		КонецЕсли; 
		
		Если ИмяКомандыЗаполнения = "ЗаполнитьВзаиморасчеты" или ИмяКомандыЗаполнения = "ЗаполнитьКредиторку" Тогда
			Объект.КредиторскаяЗадолженность.Очистить();
			Документы.КорректировкаДолга.ЗаполнитьОстаткамиВзаиморасчетов(Объект, ?(Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности или Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности, Объект.КонтрагентДебитор, Объект.КонтрагентКредитор), Перечисления.ВидыЗадолженности.Кредиторская, НЕ ЗначениеЗаполнено(Параметры.Ключ), СписокВидовДоговоровКредиторскойЗадолженности);
		КонецЕсли;
		
	Иначе
		
		Если Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.АвансыПокупателя
			или Объект.ВидАвансаЗадолженности = Перечисления.ВидыАвансаЗадолженности.ЗадолженностьПоставщику Тогда
			Если ИмяКомандыЗаполнения = "ЗаполнитьВзаиморасчеты" или ИмяКомандыЗаполнения = "ЗаполнитьКредиторку" Тогда
				Объект.КредиторскаяЗадолженность.Очистить();
				Документы.КорректировкаДолга.ЗаполнитьОстаткамиВзаиморасчетов(Объект, ?(Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.ПереносЗадолженности или Объект.ВидОперации = Перечисления.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности, Объект.КонтрагентДебитор, Объект.КонтрагентКредитор), Перечисления.ВидыЗадолженности.Кредиторская, НЕ ЗначениеЗаполнено(Параметры.Ключ), СписокВидовДоговоровКредиторскойЗадолженности);
			КонецЕсли;
			
		Иначе
			
			Если ИмяКомандыЗаполнения = "ЗаполнитьВзаиморасчеты" или ИмяКомандыЗаполнения = "ЗаполнитьДебиторку" Тогда
				Объект.ДебиторскаяЗадолженность.Очистить();
				Документы.КорректировкаДолга.ЗаполнитьОстаткамиВзаиморасчетов(Объект, Объект.КонтрагентДебитор,  Перечисления.ВидыЗадолженности.Дебиторская, НЕ ЗначениеЗаполнено(Параметры.Ключ), СписокВидовДоговоровДебиторскойЗадолженности);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;	

	Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
		Объект.СуммаДтЗадолженности = Объект.ДебиторскаяЗадолженность.Итог("Сумма");
		Объект.СуммаКтЗадолженности = Объект.КредиторскаяЗадолженность.Итог("Сумма");
	Иначе
		Объект.СуммаДтЗадолженности = Объект.ДебиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
		Объект.СуммаКтЗадолженности = Объект.КредиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
	КонецЕсли;
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
	
	ЗаполнитьДобавленныеКолонкиТаблиц();

КонецПроцедуры

&НаКлиенте
Функция ПолучитьСтруктуруРеквизитовСтроки()

	Возврат Новый Структура("ДоговорКонтрагента, КорДоговорКонтрагента, Сделка, Сумма, СуммаВзаиморасчетов, 
		|КурсВзаиморасчетов, КратностьВзаиморасчетов, СчетУчетаРасчетов, КорСчетУчетаРасчетов, СуммаНУ,
		|ЭтоАванс, КурсВзаиморасчетовДоступность"); 

КонецФункции

// Обслуживание реквизитов счетов и их субконто

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСписокПараметров(Знач Форма, Знач ШаблонИмяПоляОбъекта, Знач ИмяСчета)

	Объект = Форма.Объект;
	
	СписокПараметров = Новый Структура;
	Для Индекс = 1 По 3 Цикл
		ИмяПоля = СтрЗаменить(ШаблонИмяПоляОбъекта, "%Индекс%", Индекс);
		Если ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Контрагенты") Тогда
			СписокПараметров.Вставить("Контрагент", Объект[ИмяПоля]);
			СписокПараметров.Вставить("ИндексРеквизитаКонтрагент", Индекс);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			СписокПараметров.Вставить("ДоговорКонтрагента", Объект[ИмяПоля]);
			СписокПараметров.Вставить("ИндексРеквизитаДоговора", Индекс);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Номенклатура") Тогда
			СписокПараметров.Вставить("Номенклатура", Объект[ИмяПоля]);
		ИначеЕсли ТипЗнч(Объект[ИмяПоля]) = Тип("СправочникСсылка.Склады") Тогда
			СписокПараметров.Вставить("Склад", Объект[ИмяПоля]);
		КонецЕсли;
	КонецЦикла;
	СписокПараметров.Вставить("Организация", Объект.Организация);
	СписокПараметров.Вставить("СчетУчета"  , Объект[ИмяСчета]);
	
	Возврат СписокПараметров;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьПараметрыВыбораПолейСубконто(Форма, Знач СуффиксРеквизита, Знач СуффиксЭлемента)

	ИмяСчета = ?(СуффиксЭлемента = "Кт", "СчетКт", "СчетДт");

	ПараметрыДокумента = ПолучитьСписокПараметров(Форма, "Субконто" + СуффиксРеквизита + "%Индекс%", ИмяСчета);
	
	БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораПолейСубконто(
		Форма, Форма.Объект, "Субконто" + СуффиксРеквизита + "%Индекс%",
		"Субконто" + СуффиксЭлемента + "%Индекс%", ПараметрыДокумента);

КонецПроцедуры

// Изменение связанных реквизитов

&НаСервере 
Функция ПолучитьНовыеКурсыВалют()

	Если Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета Тогда
		Возврат РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВалютаРеглУчета", ВалютаРегламентированногоУчета);
	ТаблицаДоговоров = Объект.ДебиторскаяЗадолженность.Выгрузить(, "ДоговорКонтрагента");
	ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(Объект.КредиторскаяЗадолженность.Выгрузить(, "ДоговорКонтрагента"), ТаблицаДоговоров);
	Запрос.УстановитьПараметр("СписокДоговоров", ТаблицаДоговоров.ВыгрузитьКолонку("ДоговорКонтрагента"));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Договоры.Ссылка КАК ДоговорКонтрагента,
	|	Договоры.ВалютаВзаиморасчетов
	|ПОМЕСТИТЬ ДоговорыИВалюты
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Договоры
	|ГДЕ
	|	Договоры.ВалютаВзаиморасчетов <> &ВалютаРеглУчета
	|	И Договоры.Ссылка В (&СписокДоговоров)
	|	И Договоры.Организация = &Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договоры.ВалютаВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
	|	КурсыВалютСрезПоследних.Курс,
	|	КурсыВалютСрезПоследних.Кратность
	|ПОМЕСТИТЬ НовыйКурсы
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(
	|			&Дата,
	|			Валюта В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					ДоговорыИВалюты.ВалютаВзаиморасчетов
	|				ИЗ
	|					ДоговорыИВалюты КАК ДоговорыИВалюты)) КАК КурсыВалютСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыИВалюты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	ДоговорыИВалюты.ВалютаВзаиморасчетов,
	|	НовыйКурсы.Курс,
	|	НовыйКурсы.Кратность
	|ИЗ
	|	ДоговорыИВалюты КАК ДоговорыИВалюты
	|		ЛЕВОЕ СОЕДИНЕНИЕ НовыйКурсы КАК НовыйКурсы
	|		ПО ДоговорыИВалюты.ВалютаВзаиморасчетов = НовыйКурсы.Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорКонтрагента";
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

&НаСервере
Процедура ИзменитьКурсВТабличнойЧасти(ТабличнаяЧасть, НовыеКурсы)
	
	Если НЕ НовыеКурсы = Неопределено Тогда

		Для Каждого СтрокаТаблицы Из ТабличнаяЧасть Цикл
			
			Если Объект.ВалютаДокумента <> ВалютаРегламентированногоУчета И 
				(НЕ СтрокаТаблицы.ЭтоАванс ИЛИ НЕ ЗначениеЗаполнено(СтрокаТаблицы.КурсВзаиморасчетов)) Тогда
				
				СтрокаТаблицы.КурсВзаиморасчетов      = НовыеКурсы.Курс;
				СтрокаТаблицы.КратностьВзаиморасчетов = НовыеКурсы.Кратность;
				
				ПересчитатьСуммуПоСтрокеНаСервере(СтрокаТаблицы, Объект, ВалютаРегламентированногоУчета, Ложь);
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры

&НаСервереБезКонтекста 
Процедура ПересчитатьСуммуПоСтрокеНаСервере(СтрокаДанных, ДанныеОбъекта, ВалютаРегламентированногоУчета, ПересчетВалютнойСуммы = Истина)

	Если СтрокаДанных = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВалютаДоговора = СтрокаДанных.ДоговорКонтрагента.ВалютаВзаиморасчетов;
	РасчетыВУЕ = СтрокаДанных.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах;
	Если РасчетыВУЕ Тогда
		Если ПересчетВалютнойСуммы Тогда
			СтрокаДанных.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаДанных.Сумма,
					ВалютаРегламентированногоУчета, ВалютаДоговора,
					1, СтрокаДанных.КурсВзаиморасчетов,
					1,СтрокаДанных.КратностьВзаиморасчетов);
		Иначе
			СтрокаДанных.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаДанных.СуммаВзаиморасчетов,
					ВалютаДоговора, ВалютаРегламентированногоУчета,
					СтрокаДанных.КурсВзаиморасчетов, 1,
					СтрокаДанных.КратностьВзаиморасчетов, 1);
		КонецЕсли;
	Иначе
		Если ПересчетВалютнойСуммы Тогда
			СтрокаДанных.СуммаВзаиморасчетов = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаДанных.Сумма,
					ДанныеОбъекта.ВалютаДокумента, ВалютаДоговора,
					ДанныеОбъекта.КурсДокумента, СтрокаДанных.КурсВзаиморасчетов,
					ДанныеОбъекта.КратностьДокумента,СтрокаДанных.КратностьВзаиморасчетов);
		Иначе
			СтрокаДанных.Сумма = РаботаСКурсамиВалютКлиентСервер.ПересчитатьИзВалютыВВалюту(СтрокаДанных.СуммаВзаиморасчетов,
					ВалютаДоговора, ДанныеОбъекта.ВалютаДокумента,
					СтрокаДанных.КурсВзаиморасчетов, ДанныеОбъекта.КурсДокумента,
					СтрокаДанных.КратностьВзаиморасчетов, ДанныеОбъекта.КратностьДокумента);
		КонецЕсли;
	КонецЕсли;
	
	СтрокаДанных.СуммаНУ = СтрокаДанных.Сумма;

КонецПроцедуры

&НаСервере 
Процедура ПриИзмененииДатыНаСервере()

	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);
	
	Если Объект.ДебиторскаяЗадолженность.Количество() > 0 ИЛИ Объект.КредиторскаяЗадолженность.Количество() > 0 Тогда
		
		НовыеКурсы = ПолучитьНовыеКурсыВалют();
		ИзменитьКурсВТабличнойЧасти(Объект.ДебиторскаяЗадолженность, НовыеКурсы);
		ИзменитьКурсВТабличнойЧасти(Объект.КредиторскаяЗадолженность, НовыеКурсы);
		
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ВидОперацииПриИзмененииСервер()
	
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииСервер()

	ОбщегоНазначенияБПКлиентСервер.УстановитьПараметрыФункциональныхОпцийФормыДокумента(ЭтаФорма);	
	
	Объект.ДебиторскаяЗадолженность.Очистить();
	Объект.КредиторскаяЗадолженность.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ПодразделениеПоУмолчанию = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновноеПодразделениеОрганизации");
		
		Если НЕ ЗначениеЗаполнено(Объект.ПодразделениеОрганизации) Тогда
			Если ПодразделениеПоУмолчанию.Владелец = Объект.Организация Тогда
				Объект.ПодразделениеОрганизации = ПодразделениеПоУмолчанию;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.СчетДт) Тогда
		ОчиститьСубконтоПриСменеОрганизации("Дт", Объект.СчетДт);
	КонецЕсли;	
	
	
	Если ЗначениеЗаполнено(Объект.СчетКт) Тогда
		ОчиститьСубконтоПриСменеОрганизации("Кт", Объект.СчетКт);
	КонецЕсли;	
	
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура ОчиститьСубконтоПриСменеОрганизации(Префикс, Знач СчетСписанияПереноса)
	
	ДанныеСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(СчетСписанияПереноса);
	
	Для НомерСубконто = 1 по ДанныеСчета.КоличествоСубконто Цикл
		
		Если ТипЗнч(Объект["Субконто"+Префикс+НомерСубконто]) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
			
			Если ТипЗнч(Объект["Субконто"+Префикс+НомерСубконто].Владелец) = Тип("СправочникСсылка.Организации") Тогда
				
				Если Объект["Субконто"+Префикс+НомерСубконто].Владелец <> Объект.Организация Тогда
					Объект["Субконто"+Префикс+НомерСубконто] = Справочники.БанковскиеСчета.ПустаяСсылка();
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Объект["Субконто"+Префикс+НомерСубконто]) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			
			Если Объект["Субконто"+Префикс+НомерСубконто].Организация <> Объект.Организация Тогда
				Объект["Субконто"+Префикс+НомерСубконто] = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры	

&НаСервере
Процедура КонтрагентКредиторПриИзмененииСервер()
	
	КоличествоСтрокКоллекции = Объект.ДебиторскаяЗадолженность.Количество();
	
	Для Сч = 0 по (КоличествоСтрокКоллекции - 1) Цикл
		Объект.ДебиторскаяЗадолженность.Получить(Сч).КорДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЦикла;
	
	КоличествоСтрокКоллекции = Объект.КредиторскаяЗадолженность.Количество();
	
	Для Сч = 0 по (КоличествоСтрокКоллекции - 1) Цикл
		Объект.КредиторскаяЗадолженность.Получить(Сч).КорДоговорКонтрагента = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Процедура ВалютаДокументаПриИзмененииСервер(ПараметрыОбработки = Неопределено)

	Если ПараметрыОбработки = Неопределено Тогда
		ПараметрыОбработки = Новый Структура;
		ПараметрыОбработки.Вставить("ВалютаРасчетовПередИзменением", Неопределено);
		ПараметрыОбработки.Вставить("КурсДоИзменения", Объект.КурсДокумента);
	КонецЕсли; 
	
	Если ПараметрыОбработки.ВалютаРасчетовПередИзменением <> Объект.ВалютаДокумента Тогда
		
		Объект.ДебиторскаяЗадолженность.Очистить();
		Объект.КредиторскаяЗадолженность.Очистить();
		
		СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
		Объект.КурсДокумента      = СтруктураКурсаДокумента.Курс;
		Объект.КратностьДокумента = СтруктураКурсаДокумента.Кратность;
		
	КонецЕсли; 
	
	ЕстьСтроки = Объект.ДебиторскаяЗадолженность.Количество() + Объект.КредиторскаяЗадолженность.Количество() > 0;
	Если ПараметрыОбработки.КурсДоИзменения <> Объект.КурсДокумента И ЕстьСтроки Тогда
		КурсДокументаПриИзмененииСервер();
	КонецЕсли;
	
	ОбновитьФлагиУсловногоОформления(ЭтаФорма);
	ЗаполнитьДобавленныеКолонкиТаблиц();
	УправлениеФормой();

КонецПроцедуры

&НаСервере
Процедура КурсДокументаПриИзмененииСервер()

	КурсИКратность = Новый Структура("Курс, Кратность", Объект.КурсДокумента, Объект.КратностьДокумента);
	ИзменитьКурсВТабличнойЧасти(Объект.ДебиторскаяЗадолженность,  КурсИКратность);
	ИзменитьКурсВТабличнойЧасти(Объект.КредиторскаяЗадолженность, КурсИКратность);

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриИзмененииДоговораВСтроке(ДанныеСтроки, ДанныеОбъекта, ИмяТабЧасти, ВалютаРегламентированногоУчета)

	Если ЗначениеЗаполнено(ДанныеСтроки.ДоговорКонтрагента) Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСтроки.ДоговорКонтрагента, "ВидДоговора, ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");
	
		Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
			Контрагент = ДанныеОбъекта.КонтрагентДебитор;
		Иначе
			Контрагент = ДанныеОбъекта.КонтрагентКредитор;
		КонецЕсли;
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(ДанныеОбъекта.Организация, Контрагент, ДанныеСтроки.ДоговорКонтрагента);

		Если ДанныеСтроки.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			
			Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
				ДанныеСтроки.СчетУчетаРасчетов = СчетаУчета.СчетАвансов;
			Иначе
				ДанныеСтроки.СчетУчетаРасчетов = СчетаУчета.СчетРасчетов;
			КонецЕсли;
					
		ИначеЕсли ДанныеСтроки.ДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			
			Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
				ДанныеСтроки.СчетУчетаРасчетов = СчетаУчета.СчетРасчетовПокупателя;
			Иначе
				ДанныеСтроки.СчетУчетаРасчетов = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
			
		КонецЕсли;

		СчетУчетаРасчетов = ДанныеСтроки.СчетУчетаРасчетов;
	
		Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
			УстановитьПризнакАвансаВСтроке("ДебиторскаяЗадолженность", ДанныеСтроки, РеквизитыДоговора);
		Иначе
			УстановитьПризнакАвансаВСтроке("КредиторскаяЗадолженность", ДанныеСтроки, РеквизитыДоговора);
		КонецЕсли;
		
		Если ДанныеОбъекта.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
			ДанныеСтроки.КурсВзаиморасчетовДоступность = РеквизитыДоговора.ВалютаВзаиморасчетов <> ДанныеОбъекта.ВалютаДокумента;
		Иначе
			ДанныеСтроки.КурсВзаиморасчетовДоступность = ДанныеСтроки.ЭтоАванс;
		КонецЕсли; 
			
		Если ДанныеСтроки.ЭтоАванс Тогда
			
			ДанныеСтроки.КурсВзаиморасчетов = Документы.КорректировкаДолга.ПолучитьКурсВалютыАванса(ДанныеСтроки.ДоговорКонтрагента, ДанныеОбъекта.Организация, ДанныеОбъекта.Дата, ДанныеОбъекта.КурсДокумента);
			ДанныеСтроки.КратностьВзаиморасчетов = ДанныеОбъекта.КратностьДокумента;
			
			ДанныеСтроки.КурсВзаиморасчетовДоступность = НЕ ДанныеСтроки.ЭтоАванс;
			
		Иначе
			Если ДанныеСтроки.КурсВзаиморасчетовДоступность Тогда
				
				КурсДоговора = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ДанныеСтроки.ДоговорКонтрагента.ВалютаВзаиморасчетов,ДанныеОбъекта.Дата);
				
				ДанныеСтроки.КурсВзаиморасчетов      = КурсДоговора.Курс;
				ДанныеСтроки.КратностьВзаиморасчетов = КурсДоговора.Кратность;
				
			Иначе
				
				ДанныеСтроки.КурсВзаиморасчетов = ДанныеОбъекта.КурсДокумента;
				ДанныеСтроки.КратностьВзаиморасчетов = ДанныеОбъекта.КратностьДокумента;
				
			КонецЕсли;	
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПриИзмененииКорДоговораВСтроке(ДанныеСтроки, ДанныеОбъекта, ИмяТабЧасти)
	
	Если ЗначениеЗаполнено(ДанныеСтроки.ДоговорКонтрагента) Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСтроки.ДоговорКонтрагента, "ВидДоговора, ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");
	
		Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
			Контрагент = ДанныеОбъекта.КонтрагентДебитор;
		Иначе
			Контрагент = ДанныеОбъекта.КонтрагентКредитор;
		КонецЕсли;
		
		СчетаУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаРасчетовСКонтрагентом(ДанныеОбъекта.Организация, Контрагент, ДанныеСтроки.КорДоговорКонтрагента);

		Если ДанныеСтроки.КорДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
			
			Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
				ДанныеСтроки.КорСчетУчетаРасчетов = СчетаУчета.СчетАвансов;
			Иначе
				ДанныеСтроки.КорСчетУчетаРасчетов = СчетаУчета.СчетРасчетов;
			КонецЕсли;
					
		ИначеЕсли ДанныеСтроки.КорДоговорКонтрагента.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
			
			Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
				ДанныеСтроки.КорСчетУчетаРасчетов = СчетаУчета.СчетРасчетовПокупателя;
			Иначе
				ДанныеСтроки.КорСчетУчетаРасчетов = СчетаУчета.СчетАвансовПокупателя;
			КонецЕсли;
			
		КонецЕсли;

		КорСчетУчетаРасчетов = ДанныеСтроки.КорСчетУчетаРасчетов;
		
	КонецЕсли;
	
КонецПроцедуры	

&НаСервереБезКонтекста
Процедура ПриИзмененииСчетаРасчетовВСтроке(ДанныеСтроки, ДанныеОбъекта, ИмяТабЧасти, ВалютаРегламентированногоУчета)

	Если ЗначениеЗаполнено(ДанныеСтроки.ДоговорКонтрагента) Тогда
		
		РеквизитыДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСтроки.ДоговорКонтрагента, "ВидДоговора, ВалютаВзаиморасчетов, РасчетыВУсловныхЕдиницах");
	
		Если ИмяТабЧасти = "ДебиторскаяЗадолженность" Тогда
			УстановитьПризнакАвансаВСтроке("ДебиторскаяЗадолженность", ДанныеСтроки, РеквизитыДоговора);
		Иначе
			УстановитьПризнакАвансаВСтроке("КредиторскаяЗадолженность", ДанныеСтроки, РеквизитыДоговора);
		КонецЕсли;
		
		Если ДанныеСтроки.ЭтоАванс Тогда
			
			ДанныеСтроки.КурсВзаиморасчетов = Документы.КорректировкаДолга.ПолучитьКурсВалютыАванса(ДанныеСтроки.ДоговорКонтрагента, ДанныеОбъекта.Организация, ДанныеОбъекта.Дата, ДанныеОбъекта.КурсДокумента);
			ДанныеСтроки.КратностьВзаиморасчетов = ДанныеОбъекта.КратностьДокумента;
			
			ДанныеСтроки.КурсВзаиморасчетовДоступность = НЕ ДанныеСтроки.ЭтоАванс;
			
		Иначе
			ДанныеСтроки.КурсВзаиморасчетов = ДанныеОбъекта.КурсДокумента;
			ДанныеСтроки.КратностьВзаиморасчетов = ДанныеОбъекта.КратностьДокумента;
		КонецЕсли;
	
	КонецЕсли;

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ БСП

// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

&НаСервере
Процедура ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(ИмяЭлемента, РезультатВыполнения)
	
	ДополнительныеОтчетыИОбработки.ВыполнитьНазначаемуюКомандуНаСервере(ЭтаФорма, ИмяЭлемента, РезультатВыполнения);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьНазначаемуюКоманду(Команда)
	
	Если НЕ ДополнительныеОтчетыИОбработкиКлиент.ВыполнитьНазначаемуюКомандуНаКлиенте(ЭтаФорма, Команда.Имя) Тогда
		РезультатВыполнения = Неопределено;
		ДополнительныеОтчетыИОбработкиВыполнитьНазначаемуюКомандуНаСервере(Команда.Имя, РезультатВыполнения);
		ДополнительныеОтчетыИОбработкиКлиент.ПоказатьРезультатВыполненияКоманды(ЭтаФорма, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки

// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНД ФОРМЫ

&НаКлиенте
Процедура ЗаполнитьВзаиморасчеты(Команда)

	ВыполнитьКомандуЗаполнения(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДебиторку(Команда)

	ВыполнитьКомандуЗаполнения(Команда.Имя);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКредиторку(Команда)

	ВыполнитьКомандуЗаполнения(Команда.Имя);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Шапка документа

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)

	ВидОперацииПриИзмененииСервер();
	
	Если НЕ Объект.ВидОперации = СтарыйВидОперации Тогда
	
		Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.Прочее") Тогда
			
			Объект.ДебиторскаяЗадолженность.Очистить();
			Объект.КредиторскаяЗадолженность.Очистить();
			
			Объект.СчетДт = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
			Объект.СчетКт = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.ПустаяСсылка");
			
			Объект.СубконтоДт1 = Неопределено;
			Объект.СубконтоДт2 = Неопределено;
			Объект.СубконтоДт3 = Неопределено;
			Объект.СубконтоКт1 = Неопределено;
			Объект.СубконтоКт2 = Неопределено;
			Объект.СубконтоКт3 = Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;	
	
	УстановитьФлагОтметкиНезаполненногоДебитора(ЭтаФорма);
	УстановитьФлагОтметкиНезаполненногоКредитора(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)

	ПриИзмененииДатыНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)

	ОрганизацияПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура ВалютаДокументаПриИзменении(Элемент)

	ВалютаДокументаПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура КурсДокументаПриИзменении(Элемент)

	КурсДокументаПриИзмененииСервер();

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентДебиторПриИзменении(Элемент)
	
	Если Элемент = Элементы.Дебитор Тогда

		Объект.ДебиторскаяЗадолженность.Очистить();
		Объект.КредиторскаяЗадолженность.Очистить();
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов")
			или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности") Тогда
			
			Если Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.АвансыПоставщику")
				или Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПокупателя")
				и Объект.ТипАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.СамогоКонтрагента") Тогда
				Объект.КонтрагентКредитор = Объект.КонтрагентДебитор;
			КонецЕсли;
			
			Объект.ДебиторскаяЗадолженность.Очистить();
			
		ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности")
			или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности") Тогда
			
			Объект.КредиторскаяЗадолженность.Очистить();
			Объект.ДебиторскаяЗадолженность.Очистить();
			
		Иначе
			Объект.ДебиторскаяЗадолженность.Очистить();
		КонецЕсли;
		
	Иначе
		Объект.ДебиторскаяЗадолженность.Очистить();
	КонецЕсли;	

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентКредиторПриИзменении(Элемент)
	
	Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетАвансов")
		или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности") Тогда
		
		Если Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.АвансыПокупателя")
			или Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику")
			и Объект.ТипАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.СамогоКонтрагента") Тогда
			Объект.КонтрагентДебитор = Объект.КонтрагентКредитор;
		КонецЕсли;
		
		Объект.КредиторскаяЗадолженность.Очистить();
		
	ИначеЕсли Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности")
		или Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.СписаниеЗадолженности") Тогда
		
		Если Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ПереносЗадолженности") Тогда
			КонтрагентКредиторПриИзмененииСервер();
		КонецЕсли;	
		
	Иначе
		Объект.КредиторскаяЗадолженность.Очистить();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидАвансаПриИзменении(Элемент)
	
	УправлениеФормой();
	
	Если НЕ Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийКорректировкаДолга.ЗачетЗадолженности") Тогда
	
		Объект.ДебиторскаяЗадолженность.Очистить();
		Объект.КредиторскаяЗадолженность.Очистить();
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипАвансаПриИзменении(Элемент)
	
	УправлениеФормой();
	
	Если Объект.ТипАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ТипыЗадолженности.СамогоКонтрагента") Тогда
		
		Если Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.АвансыПокупателя")
			или Объект.ВидАвансаЗадолженности = ПредопределенноеЗначение("Перечисление.ВидыАвансаЗадолженности.ЗадолженностьПоставщику") Тогда
			
			Объект.КонтрагентДебитор = Объект.КонтрагентКредитор;
			
			Объект.КредиторскаяЗадолженность.Очистить();
			
		Иначе
			
			Объект.КонтрагентКредитор = Объект.КонтрагентДебитор;
			
			Объект.ДебиторскаяЗадолженность.Очистить();
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗадолженностиДляПереносаПриИзменении(Элемент)
		
	УправлениеФормой();
	
	Объект.ДебиторскаяЗадолженность.Очистить();
	Объект.КредиторскаяЗадолженность.Очистить();
	
КонецПроцедуры


// Закладка "СчетаУчета"
&НаКлиенте
Процедура СчетДтПриИзменении(Элемент)

	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетДт, "Дт");

	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								  "СубконтоДт1", "СубконтоДт2", "СубконтоДт3");
	ЗначенияСубконто = Новый Соответствие;
	ЗначенияСубконто.Вставить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы"), 
		БухгалтерскийУчетВызовСервераПовтИсп.ОсновнаяНоменклатурнаяГруппа());

	БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Объект.СчетДт, Объект, ПоляОбъекта,, ЗначенияСубконто);


	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Дт", "Дт");

КонецПроцедуры

&НаКлиенте
Процедура СчетДтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = БухгалтерскийУчетКлиент.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура СчетКтПриИзменении(Элемент)

	УстановитьЗаголовкиИДоступностьСубконто(ЭтаФорма, Объект.СчетКт, "Кт");

	ПоляОбъекта = Новый Структура("Субконто1, Субконто2, Субконто3",
								  "СубконтоКт1", "СубконтоКт2", "СубконтоКт3");
	ЗначенияСубконто = Новый Соответствие;
	ЗначенияСубконто.Вставить(ПредопределенноеЗначение("ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.НоменклатурныеГруппы"), 
		БухгалтерскийУчетВызовСервераПовтИсп.ОсновнаяНоменклатурнаяГруппа());

	БухгалтерскийУчетКлиентСервер.ПриИзмененииСчета(Объект.СчетДт, Объект, ПоляОбъекта,, ЗначенияСубконто);


	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Кт", "Кт");

КонецПроцедуры

&НаКлиенте
Процедура СчетКтОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = БухгалтерскийУчетКлиент.СчетМожноИспользоватьВПроводках(ВыбранноеЗначение);

КонецПроцедуры

&НаКлиенте
Процедура СубконтоДт1ПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Дт", "Дт");

КонецПроцедуры

&НаКлиенте
Процедура СубконтоДт2ПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Дт", "Дт");

КонецПроцедуры

&НаКлиенте
Процедура СубконтоДт3ПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Дт", "Дт");

КонецПроцедуры

&НаКлиенте
Процедура СубконтоКт1ПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Кт", "Кт");

КонецПроцедуры

&НаКлиенте
Процедура СубконтоКт2ПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Кт", "Кт");

КонецПроцедуры

&НаКлиенте
Процедура СубконтоКт3ПриИзменении(Элемент)

	ИзменитьПараметрыВыбораПолейСубконто(ЭтаФорма, "Кт", "Кт");

КонецПроцедуры


// Закладка "ДебиторскаяЗадолженность"

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьПриИзменении(Элемент)
	
	Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
		Объект.СуммаДтЗадолженности = Объект.ДебиторскаяЗадолженность.Итог("Сумма");
	Иначе
		Объект.СуммаДтЗадолженности = Объект.ДебиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
	КонецЕсли;
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьДоговорКонтрагентаПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента, КонтрагентДебитор, КонтрагентКредитор");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;
	
	ПриИзмененииДоговораВСтроке(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "ДебиторскаяЗадолженность", ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьКорДоговорКонтрагентаПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента, КонтрагентДебитор, КонтрагентКредитор");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;
	
	ПриИзмененииКорДоговораВСтроке(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "ДебиторскаяЗадолженность");
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьКурсВзаиморасчетовПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПересчитатьСуммуПоСтрокеНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта, ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьСуммаПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПересчитатьСуммуПоСтрокеНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта, ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьСуммаВзаиморасчетовПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПересчитатьСуммуПоСтрокеНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта, ВалютаРегламентированногоУчета, Ложь);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьСчетУчетаРасчетовПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПриИзмененииСчетаРасчетовВСтроке(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "ДебиторскаяЗадолженность", ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьПослеУдаления(Элемент)
	
	УстановитьФлагОтметкиНезаполненногоСчетов(ЭтаФорма);
	
	УстановитьФлагОтметкиНезаполненногоДебитора(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаДебиторскаяЗадолженностьПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		
		УстановитьФлагОтметкиНезаполненногоСчетов(ЭтаФорма);
		
		УстановитьФлагОтметкиНезаполненногоДебитора(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры


// Закладка "КредиторскаяЗадолженность"

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьПриИзменении(Элемент)
	
	Если Объект.ВалютаДокумента = ВалютаРегламентированногоУчета Тогда
		Объект.СуммаКтЗадолженности = Объект.КредиторскаяЗадолженность.Итог("Сумма");
	Иначе
		Объект.СуммаКтЗадолженности = Объект.КредиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
	КонецЕсли;
	Разница = Объект.СуммаДтЗадолженности - Объект.СуммаКтЗадолженности;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьДоговорКонтрагентаПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента, КонтрагентДебитор, КонтрагентКредитор");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;
	
	ПриИзмененииДоговораВСтроке(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "КредиторскаяЗадолженность", ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьКурсВзаиморасчетовПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПересчитатьСуммуПоСтрокеНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта, ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьКорДоговорКонтрагентаПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента, КонтрагентДебитор, КонтрагентКредитор");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;
	
	ПриИзмененииКорДоговораВСтроке(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "КредиторскаяЗадолженность");
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьСуммаПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПересчитатьСуммуПоСтрокеНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта, ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьСуммаВзаиморасчетовПриИзменении(Элемент)

	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПересчитатьСуммуПоСтрокеНаСервере(ДанныеСтрокаТаблицы, ПараметрыОбъекта, ВалютаРегламентированногоУчета, Ложь);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);

КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьСчетУчетаРасчетовПриИзменении(Элемент)
	
	ДанныеСтрокаТаблицы = ПолучитьСтруктуруРеквизитовСтроки();
	ЗаполнитьЗначенияСвойств(ДанныеСтрокаТаблицы, Элемент.Родитель.Родитель.ТекущиеДанные);
	
	ПараметрыОбъекта = Новый Структура("Организация, Дата, Ссылка,  
		|ВалютаДокумента, КурсДокумента, КратностьДокумента");
	ЗаполнитьЗначенияСвойств(ПараметрыОбъекта, Объект);
	ПараметрыОбъекта.Ссылка = Объект.Ссылка;

	ПриИзмененииСчетаРасчетовВСтроке(ДанныеСтрокаТаблицы, ПараметрыОбъекта, "КредиторскаяЗадолженность", ВалютаРегламентированногоУчета);
	
	ЗаполнитьЗначенияСвойств(Элемент.Родитель.Родитель.ТекущиеДанные, ДанныеСтрокаТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если НоваяСтрока Тогда
		
		УстановитьФлагОтметкиНезаполненногоСчетов(ЭтаФорма);
		
		УстановитьФлагОтметкиНезаполненногоКредитора(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаКредиторскаяЗадолженностьПослеУдаления(Элемент)
	
	УстановитьФлагОтметкиНезаполненногоСчетов(ЭтаФорма);
	
	УстановитьФлагОтметкиНезаполненногоКредитора(ЭтаФорма);
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = ПредопределенноеЗначение("РежимЗаписиДокумента.Проведение") Тогда
		КлючеваяОперация = "ПроведениеКорректировкаДолга";
		ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени(КлючеваяОперация);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаПечать);
	// Конец СтандартныеПодсистемы.Печать
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьСостояниеДокумента();	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	УстановитьПараметрыВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	ОбщегоНазначенияБПКлиент.ОбработкаОповещенияФормыДокумента(ЭтаФорма, Объект.Ссылка, ИмяСобытия, Параметр, Источник);
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтарыйвидОперации = Объект.ВидОперации;
	
КонецПроцедуры

