#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
		
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализНДФЛПоМесяцам");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Налогооблагаемая сумма, примененные вычеты, сопоставление исчисленного, 
		|удержанного и перечисленного налогов по месяцам налогового периода'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "АнализУплатыНДФЛ");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Удержанный и уплаченный НДФЛ, задолженность по налогу.
		|При перечислении НДФЛ одновременно с выплатой зарплаты 
		|задолженность не образуется'");
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "СводнаяСправка");
	НастройкиВарианта.Описание =
		НСтр("ru = 'Краткая информация, отображаемая в справках 2-НДФЛ'");
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли