////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетВнутренний: служебные методы кадрового учета, работающие на стороне сервера.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Функция ЗапросВТВсеЗначенияДоступаСотрудников(Сотрудники) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТВсеЗначенияДоступаСотрудников(Сотрудники);
	
КонецФункции

Процедура СформироватьКадровыеДвижения(РегистраторОбъект, Движения, КадровыеДвижения) Экспорт
	
	КадровыйУчетБазовый.СформироватьКадровыеДвижения(РегистраторОбъект, Движения, КадровыеДвижения);
	
КонецПроцедуры

Функция СреднесписочнаяЧисленностьРаботающих(Организация, НачалоПериода, КонецПериода) Экспорт 
	Возврат КадровыйУчетБазовый.СреднесписочнаяЧисленностьРаботающих(Организация, НачалоПериода, КонецПериода)	
КонецФункции

Функция НеобходимыКадровыеДанныеФизическогоЛица(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыКадровыеДанныеФизическогоЛица(ИмяПоля);
	
КонецФункции

Функция ЗапросВТСотрудникиОрганизации(ТолькоРазрешенные, ИмяВТСотрудникиОрганизации, Параметры) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТСотрудникиОрганизации(ТолькоРазрешенные, ИмяВТСотрудникиОрганизации, Параметры);
	
КонецФункции

Функция ДополнительныеСведенияУнифицированнойФормыТ2(СтрокиДанных, ДатаОтчета) Экспорт
	
	Возврат КадровыйУчетБазовый.ДополнительныеСведенияУнифицированнойФормыТ2(СтрокиДанных, ДатаОтчета);
	
КонецФункции

Функция ОтчетВидаКарточкаСотрудника(КлючВарианта) Экспорт
	
	Возврат Ложь;
	
КонецФункции

Процедура ВывестиМакетыОтчетовПоСотрудникам(КлючВарианта, ДокументРезультат, Данные, Группировки, Период, СоответствиеПользовательскихПолей, РаботникКадровойСлужбыРасшифровкаПодписи) Экспорт
	
	// В этой конфигурации ничего не делаем.
	
КонецПроцедуры

Функция СформироватьЗапросДляТ1(МассивОбъектов) Экспорт
	
	Возврат КадровыйУчетБазовый.СформироватьЗапросДляТ1(МассивОбъектов);
	
КонецФункции

Функция СформироватьЗапросДляТ5(МассивОбъектов) Экспорт
	
	Возврат КадровыйУчетБазовый.СформироватьЗапросДляТ5(МассивОбъектов);
	
КонецФункции

Функция СформироватьЗапросДляТ6(МассивОбъектов) Экспорт
	
	Возврат КадровыйУчетБазовый.СформироватьЗапросДляТ6(МассивОбъектов);
	
КонецФункции

Функция СформироватьЗапросДляТ8(МассивОбъектов) Экспорт
	
	Возврат КадровыйУчетБазовый.СформироватьЗапросДляТ8(МассивОбъектов);		
	
КонецФункции	

Процедура СоздатьВТДанныеДокументовКадровыхПеремещений(МенеджерВременныхТаблиц, МассивОбъектов) Экспорт
	
	КадровыйУчетБазовый.СоздатьВТДанныеДокументовКадровыхПеремещений(МенеджерВременныхТаблиц, МассивОбъектов);
	
КонецПроцедуры

Процедура СоздатьВТДанныеДокументовПриемНаРаботу(МенеджерВременныхТаблиц, МассивОбъектов) Экспорт
	
	КадровыйУчетБазовый.СоздатьВТДанныеДокументовПриемНаРаботу(МенеджерВременныхТаблиц, МассивОбъектов);
	
КонецПроцедуры

Процедура СоздатьВТДанныеДокументовУвольнение(МенеджерВременныхТаблиц, МассивОбъектов) Экспорт
	
	КадровыйУчетБазовый.СоздатьВТДанныеДокументовУвольнение(МенеджерВременныхТаблиц, МассивОбъектов);
	
КонецПроцедуры

Функция КадровыеДанныеДляПечатиКадровыхПриказов() Экспорт
	
	Возврат КадровыйУчетБазовый.КадровыеДанныеДляПечатиКадровыхПриказов();
	
КонецФункции

Функция ЗапросВТТарифныеСтавкиСотрудников(ТолькоРазрешенные, ИмяВТТарифныеСтавкиСотрудников, ИмяВременнойТаблицыОтборовСотрудников, ПоляОтбораСотрудников, ПоляОтбораПериодическихДанных) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТТарифныеСтавкиСотрудников(ТолькоРазрешенные, ИмяВТТарифныеСтавкиСотрудников, ИмяВременнойТаблицыОтборовСотрудников, ПоляОтбораСотрудников, ПоляОтбораПериодическихДанных);
	
КонецФункции

Процедура ОбновитьТекущиеКадровыеДанныеСотрудников(Запрос) Экспорт
	
	КадровыйУчетБазовый.ОбновитьТекущиеКадровыеДанныеСотрудников(Запрос);
	
КонецПроцедуры

Процедура ПеренестиТекущиеКадровыеДанныеСотрудниковИзСправочникаВРегистры() Экспорт
	
	КадровыйУчетБазовый.ПеренестиТекущиеКадровыеДанныеСотрудниковИзСправочникаВРегистры();
	
КонецПроцедуры

Процедура ПеренестиТекущиеВидыЗанятостиСправочниковВРегистр() Экспорт
	
	КадровыйУчетБазовый.ПеренестиТекущиеВидыЗанятостиСправочниковВРегистр();
	
КонецПроцедуры

Процедура ОбновитьТекущиеТарифныеСтавки(МассивСотрудниковДляОбновления) Экспорт
	
	КадровыйУчетБазовый.ОбновитьТекущиеТарифныеСтавки(МассивСотрудниковДляОбновления);
	
КонецПроцедуры

Функция ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц() Экспорт
		
	Возврат КадровыйУчетБазовый.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
	
КонецФункции

Функция ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице() Экспорт

	Возврат КадровыйУчетБазовый.ПараметрыПолученияСотрудниковОрганизацийПоВременнойТаблице();
	
КонецФункции

Функция ПараметрыПолученияРабочихМестВОрганизацийПоСпискуФизическихЛиц() Экспорт
	
	Возврат КадровыйУчетБазовый.ПараметрыПолученияРабочихМестВОрганизацийПоСпискуФизическихЛиц();
	
КонецФункции

Функция ПараметрыПолученияРабочихМестВОрганизацийПоВременнойТаблице() Экспорт
	
	Возврат КадровыйУчетБазовый.ПараметрыПолученияРабочихМестВОрганизацийПоВременнойТаблице();
	
КонецФункции

Функция ОписанияСоставаНачисленийПоВременнойТаблице(МенеджерВременныхТаблиц, ИмяВТСотрудникиПериоды, ИмяПоляПериод, ИмяПоляСотрудник) Экспорт
	
	Возврат КадровыйУчетБазовый.ОписанияСоставаНачисленийПоВременнойТаблице(МенеджерВременныхТаблиц, ИмяВТСотрудникиПериоды, ИмяПоляПериод, ИмяПоляСотрудник);
	
КонецФункции

Процедура ОбновитьВидыКонтактнойИнформацииФизическогоЛица() Экспорт
	
	КадровыйУчетБазовый.ОбновитьВидыКонтактнойИнформацииФизическогоЛица();
	
КонецПроцедуры

Процедура ОбновитьСобытияУвольнений(МенеджерВременныхТаблиц) Экспорт
	
	КадровыйУчетБазовый.ОбновитьСобытияУвольнений(МенеджерВременныхТаблиц);
	
КонецПроцедуры

Функция ПараметрыПолученияОсновныхСотрудниковФизическихЛиц(СписокФизическихЛиц, Организация, НачалоПериода, ОкончаниеПериода) Экспорт
	
	Возврат КадровыйУчетБазовый.ПараметрыПолученияОсновныхСотрудниковФизическихЛиц(СписокФизическихЛиц, Организация, НачалоПериода, ОкончаниеПериода);
	
КонецФункции

Функция ДоговорыФизическихЛиц(ТаблицаФизическихЛиц) Экспорт
	
	Возврат КадровыйУчетБазовый.ДоговорыФизическихЛиц(ТаблицаФизическихЛиц);
	
КонецФункции

#Область ПолучениеРабочихМестСотрудниковОрганизации

Функция ПараметрыДляЗапросВТРабочиеМестаСотрудников() Экспорт
	
	Возврат КадровыйУчетБазовый.ПараметрыДляЗапросВТРабочиеМестаСотрудников();
	
КонецФункции

Функция ЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(ТолькоРазрешенные, ИмяВТРабочиеМестаСотрудников, Параметры) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТРабочиеМестаСотрудниковПоВременнойТаблице(ТолькоРазрешенные, ИмяВТРабочиеМестаСотрудников, Параметры);
	
КонецФункции

Функция ПоляВТРабочиеМестаСотрудников() Экспорт
	
	Возврат КадровыйУчетБазовый.ПоляВТРабочиеМестаСотрудников();
	
КонецФункции

#КонецОбласти

#Область КадровыеДанныеФизическихЛиц

// Формирует временную таблицу, содержащую поля с запрашиваемыми кадровыми данными  носящими периодический характер.
// Содержит обязательные поля ФизическоеЛицо и Период.
//
// Параметры:
//	ТолькоРазрешенные 	- Булево, если Истина то текст запроса будет построен с использованием
//						  ключевого слова РАЗРЕШЕННЫЕ.
//	ОписательВременнойТаблицыОтборов - структура, описывающая временную таблицу, служащую фильтром
//						  по физическим лицам для получения кадровых данных 
//						  см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц.
//	КадровыеДанные - Строка, перечисление имен кадровых данных, разделенных запятыми.
//				   - Массив, содержащий строки имен кадровых данных.
//  ИмяВТПостоянныеКадровыеДанныеФизическихЛиц - Строка, указывает оригинальное имя временной таблицы,
//						  формируемой методом
//
//	Список полей, допустимых в параметре КадровыеДанные, если сведений в базе данных нет, возвращается
//  		NULL, исключения приведены в скобках, поле указания типа кадровых данных.
//
//			- Все имена кадровых данных, разрешенных для метода ЗапросВТПостоянныеКадровыеДанныеФизическихЛиц.
//
//			Информация о гражданстве
//			- Страна - СправочникСсылка.СтраныМира (Справочники.СтраныМира.Россия)
//
//			Информация о документе, удостоверяющем личность.
//			- ДокументВид 				- СправочникСсылка.ВидыДокументовФизическихЛиц
//			- ДокументКодМВД 			- Строка
//			- ДокументСерия 			- Строка
//			- ДокументНомер 			- Строка
//			- ДокументДатаВыдачи 		- Дата
//			- ДокументСрокДействия 		- Дата
//			- ДокументКемВыдан 			- Строка
//			- ДокументКодПодразделения 	- Строка
//			- ДокументПредставление 	- Строка
//
//			Информация о фамилии, имени, отчестве.
//			- Фамилия 	- Строка;
//			- Имя 		- Строка;
//			- Отчество 	- Строка;
//			- ФИОПолные - Строка, полные фамилия имя отчество;
//			- ФамилияИО - Строка, фамилия и инициалы;
//			- ИОФамилия - Строка, инициалы и фамилия.
//
//			Информация о сведениях об инвалидности.
//			- Инвалидность 						- Булево
//			- ИнвалидностьДатаВыдачи 			- Дата
//			- ИнвалидностьСрокДействияСправки 	- Дата
//
//			- СтатусНалогоплательщика - СправочникСсылка.СтатусыНалогоплательщиковПоНДФЛ
//										(Справочники.СтатусыНалогоплательщиковПоНДФЛ.Резидент).
//
//			- ВидЗастрахованногоЛица - ПеречислениеСсылка.ВидыЗастрахованныхЛицОбязательногоСтрахования
//										(Перечисления.ВидыЗастрахованныхЛицОбязательногоСтрахования.ГражданеРФ).
//
Функция ЗапросВТКадровыеДанныеФизическихЛиц(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ПоляОтбораПериодическихДанных, ИмяВТКадровыеДанныеФизическихЛиц) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТКадровыеДанныеФизическихЛиц(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ПоляОтбораПериодическихДанных, ИмяВТКадровыеДанныеФизическихЛиц);
	
КонецФункции

// Формирует временную таблицу, содержащую поля с запрашиваемыми кадровыми данными, не носящими
// периодический характер. Содержит обязательное поле ФизическоеЛицо.
//
// Параметры:
//	ТолькоРазрешенные - Булево, если Истина то текст запроса будет построен с использованием
//						ключевого слова РАЗРЕШЕННЫЕ.
//	ОписательВременнойТаблицыОтборов - структура, описывающая временную таблицу, служащую фильтром
//						по физическим лицам для получения кадровых данных 
//						см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовФизическихЛиц.
//	КадровыеДанные	- Строка, перечисление имен кадровых данных, разделенных запятыми.
//					- Массив, содержащий строки имен кадровых данных.
//  ИмяВТПостоянныеКадровыеДанныеФизическихЛиц - Строка, указывает оригинальное имя временной таблицы,
//						формируемой методом
//
//	Список полей, допустимых в параметре КадровыеДанные, если сведений в базе данных нет, возвращается
//  		NULL
//
//			- Имена всех реквизитов справочника ФизическиеЛица.
//
//			Контактная информация физического лица:
//
//			- АдресДляИнформирования 				- Строка, адрес в формате хранения в базе данных.
//			- АдресДляИнформированияПредставление	- Строка
//
//			- АдресЗаПределамиРФ					- Строка
//			- АдресЗаПределамиРФПредставление		- Строка
//
//			- АдресМестаПроживания					- Строка
//			- АдресМестаПроживанияПредставление		- Строка
//
//			- АдресПоПрописке						- Строка
//			- АдресПоПропискеПредставление			- Строка
//
//			- ТелефонДомашний						- Строка
//			- ТелефонДомашнийПредставление			- Строка
//
//			- ТелефонРабочий						- Строка
//			- ТелефонРабочийПредставление			- Строка
//
Функция ЗапросВТПостоянныеКадровыеДанныеФизическихЛиц(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ИмяВТПостоянныеКадровыеДанныеФизическихЛиц) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТПостоянныеКадровыеДанныеФизическихЛиц(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ИмяВТПостоянныеКадровыеДанныеФизическихЛиц);
	
КонецФункции

Функция НеобходимыЗначенияРеквизитовСправочникаФизическиеЛица(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыЗначенияРеквизитовСправочникаФизическиеЛица(ИмяПоля);
			
КонецФункции

Функция НеобходимыПостоянныеКадровыеДанныеФизическихЛиц(Знач ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыПостоянныеКадровыеДанныеФизическихЛиц(ИмяПоля)
	
КонецФункции

// Контактная информация

Функция НеобходимаКонтактнаяИнформацияФизическогоЛица(ИмяПоля) Экспорт

	Возврат КадровыйУчетБазовый.НеобходимаКонтактнаяИнформацияФизическогоЛица(ИмяПоля);
	
КонецФункции

#КонецОбласти

#Область КадровыеДанныеСотрудников

// Формирует временную таблицу, содержащую поля с запрашиваемыми кадровыми данными сотрудников, в том числе носящими
// периодический характер.
// Содержит обязательные поля Сотрудник, ФизическоеЛицо и Период, соответствующие переданным во временной таблице
// отборов.
//
// Параметры:
//	ТолькоРазрешенные 	- Булево, если Истина то текст запроса будет построен с использованием
//						  ключевого слова РАЗРЕШЕННЫЕ.
//	ОписательВременнойТаблицыОтборов - структура, описывающая временную таблицу, служащую фильтром
//						  по сотрудникам для получения кадровых данных 
//						  см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовСотрудников.
//	КадровыеДанные - Строка, перечисление имен кадровых данных, разделенных запятыми.
//				   - Массив, содержащий строки имен кадровых данных.
//  ФормироватьСПериодичностьДень - Булево, при получении кадровых данных, хранящихся в периодических
//						  регистрах сведений с периодичностью менее чем День, значение Истина позволяет 
//						  отбирать самое последние значения в пределах дня.
//  ИмяВТПостоянныеКадровыеДанныеСотрудников - Строка, указывает оригинальное имя временной таблицы,
//						  формируемой методом
//
//	Список полей, допустимых в параметре КадровыеДанные, если сведений в базе данных нет, возвращается
//  		NULL, исключения приведены в скобках, поле указания типа кадровых данных.
//
//			- Все имена кадровых данных физических лиц (см. ЗапросВТКадровыеДанныеФизическихЛиц).
//
//			- Все имена кадровых данных, разрешенных для метода ЗапросВТПостоянныеКадровыеДанныеСотрудников.
//
//			Информация о рабочем месте.
//			- Организация 		- СправочникСсылка.Организации
//			- Подразделение 	- СправочникСсылка.ПодразделенияОрганизаций
//			- Должность 		- СправочникСсылка.Должности
//			- ВидЗанятости 		- ПеречисленияСсылка.ВидыЗанятости
//			- ВидСобытия 		- ПеречисленияСсылка. ВидыКадровыхСобытий
//			- КоличествоСтавок	- Число, в этой конфигурации всегда 1.
//
//			Информация о свойствах рабочего места.
//			- ЯвляетсяЧленомЛетногоЭкипажа 			- Булево (Ложь)
//			- ЯвляетсяШахтером 						- Булево (Ложь)
//			- ЯвляетсяФармацевтом 					- Булево (Ложь)
//			- ЯвляетсяРаботникомСДосрочнойПенсией 	- ПеречислениеСсылка.ВидыРаботСДосрочнойПенсией
//														(Перечисления.ВидыРаботСДосрочнойПенсией.ПустаяСсылка).
//			- ЯвляетсяЧленомЭкипажаСуднаПодФлагомРФ - Булево (Ложь)
//
//			Информация об оплате труда.
//			- ТарифнаяСтавка 		- Число
//			- ФОТ 			 		- Число
//			- Надбавка 		 		- Число, в этой конфигурации всегда 0.
//			- СпособРасчетаАванса	- ПеречислениеСсылка.СпособыРасчетаАванса
//			- Аванс					- Число
//
//			Информация об учете затрат.
//			- СтатьяФинансирования 				- СправочникСсылка.СтатьиФинансированияЗарплата
//			- СпособОтраженияЗарплатыВБухучете 	- СправочникСсылка.СпособыОтраженияЗарплатыВБухУчете
//			- ОтношениеКЕНВД 					- ПеречислениеСсылка.ОтношениеКЕНВДЗатратНаЗарплату
//			- УчетЗатратДокументОснование 		- ДокументСсылка.ПриемНаРаботу
//
Функция ЗапросВТКадровыеДанныеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИмяВТКадровыеДанныеСотрудников) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТКадровыеДанныеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ПоляОтбораПериодическихДанных, ФормироватьСПериодичностьДень, ИмяВТКадровыеДанныеСотрудников);
	
КонецФункции

// Формирует временную таблицу, содержащую поля с запрашиваемыми кадровыми данными сотрудников, не носящими
// периодический характер. Содержит обязательные поля Сотрудник и ФизическоеЛицо, в соответствии переданному
// в таблице отборов.
//
// Параметры:
//	ТолькоРазрешенные - Булево, если Истина то текст запроса будет построен с использованием
//						ключевого слова РАЗРЕШЕННЫЕ.
//	ОписательВременнойТаблицыОтборов - структура, описывающая временную таблицу, служащую фильтром
//						по сотрудникам для получения кадровых данных 
//						см. КадровыйУчет.ОписаниеВременнойТаблицыОтборовСотрудников.
//	КадровыеДанные	- Строка, перечисление имен кадровых данных, разделенных запятыми.
//					- Массив, содержащий строки имен кадровых данных.
//  ИмяВТПостоянныеКадровыеДанныеСотрудников - Строка, указывает оригинальное имя временной таблицы,
//						формируемой методом
//
//	Список полей, допустимых в параметре КадровыеДанные, если сведений в базе данных нет, возвращается
//  		NULL, исключения приведены в скобках, поле указания типа кадровых данных.
//
//			- Все имена кадровых данных физических лиц (см. ЗапросВТПостоянныеКадровыеДанныеФизическихЛиц).
//
//			- Имена всех реквизитов справочника Сотрудники.
//
//			Текущие кадровые данные
//			- ТабельныйНомер					- Строка, возвращается значение реквизита Код справочника.
//			- ДатаПриема 						- Дата (01.01.0001)
//			- ДатаУвольнения					- Дата (01.01.0001)
//			- ТекущаяОрганизация				- СправочникСсылка.Организации 
//													(Справочники.Организации.ПустаяСсылка).
//			- ТекущееПодразделение				- СправочникСсылка.ПодразделенияОрганизаций
//													(Справочники.ПодразделенияОрганизаций.ПустаяСсылка).
//			- ТекущаяДолжность					- СправочникСсылка.Должности
//													(Справочники.Должности.ПустаяСсылка).
//			- ТекущийВидЗанятости				- ПеречисленияСсылка.ВидыЗанятости
//													(Перечисления.ВидыЗанятости.ПустаяСсылка).
//			- ОсновноеРабочееМестоВОрганизации	- Булево (Ложь) 
//			- ОформленПоТрудовомуДоговору		- Булево (Ложь) 
//
//			Текущие данные об оплате работы.
//			- ТекущаяТарифнаяСтавка			- Число (0)
//			- ТекущийСпособРасчетаАванса	- ПеречислениеСсылка.СпособыРасчетаАванса
//												(ПеречислениеСсылка.СпособыРасчетаАванса.ПустаяСсылка).
//			- ТекущийАванс					- Число (0)
//
//			Данные приказа о приеме
//			- ПриказОПриеме			- ДокументСсылка.ПриемНаРаботу
//			- ПриказОПриемеДата		- Дата
//			- ПриказОПриемеНомер	- Строка
//
//			Данные приказа об увольнении.
//			- ПриказОбУвольнении			- ДокументСсылка.Увольнение
//			- ПриказОбУвольненииДата		- Дата
//			- ПриказОбУвольненииНомер		- Строка
//			- ПриказОбУвольненииСтатьяТКРФ	- Строка
//
Функция ЗапросВТПостоянныеКадровыеДанныеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ИмяВТПостоянныеКадровыеДанныеСотрудников) Экспорт

	Возврат КадровыйУчетБазовый.ЗапросВТПостоянныеКадровыеДанныеСотрудников(ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, КадровыеДанные, ИмяВТПостоянныеКадровыеДанныеСотрудников);
	
КонецФункции

Функция НеобходимыПостоянныеКадровыеДанныеСотрудников(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыПостоянныеКадровыеДанныеСотрудников(ИмяПоля)
	
КонецФункции

// Текущие кадровые данные

Функция НеобходимыСведенияТекущихКадровыхДанныхСотрудников(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыСведенияТекущихКадровыхДанныхСотрудников(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымСведенийТекущихКадровыхДанныхСотрудников(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.ПутьКДаннымСведенийТекущихКадровыхДанныхСотрудников(ИмяПоля);
	
КонецФункции

Функция НеобходимыСведенияТекущихТарифныхСтавкахСотрудников(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыСведенияТекущихТарифныхСтавкахСотрудников(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымСведенийТекущихТарифныхСтавокСотрудников(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.ПутьКДаннымСведенийТекущихТарифныхСтавокСотрудников(ИмяПоля);
	
КонецФункции

// Сведения о приказах на прием и увольнение.

Функция ЗапросВТСведенийПриказовОПриеме(ИмяВТКадроваяИсторияСотрудников, ТолькоРазрешенные, ИмяВТСведенийПриказовОПриеме) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТСведенийПриказовОПриеме(ИмяВТКадроваяИсторияСотрудников, ТолькоРазрешенные, ИмяВТСведенийПриказовОПриеме);
	
КонецФункции

Функция ЗапросВТСведенийПриказовОбУвольнении(ИмяВТКадроваяИсторияСотрудников, ТолькоРазрешенные, ИмяВТСведенийПриказовОбУвольнении) Экспорт
	
	Возврат КадровыйУчетБазовый.ЗапросВТСведенийПриказовОбУвольнении(ИмяВТКадроваяИсторияСотрудников, ТолькоРазрешенные, ИмяВТСведенийПриказовОбУвольнении);
	
КонецФункции

Функция НеобходимыСведенияПриказаОПриеме(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыСведенияПриказаОПриеме(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымСведенийПриказаОПриемеОбУвольнении(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.ПутьКДаннымСведенийПриказаОПриемеОбУвольнении(ИмяПоля);
	
КонецФункции

// Сведения кадровой истории сотрудников.

Функция НеобходимыСведенияКадровойИсторииСотрудников(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыСведенияКадровойИсторииСотрудников(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымСведенийКадровойИсторииСотрудников(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.ПутьКДаннымСведенийКадровойИсторииСотрудников(ИмяПоля);
	
КонецФункции

Процедура ДобавитьТекстЗапросаВТСведенияКадроваяИсторияСотрудников(Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ИсточникиДанных) Экспорт
	
	КадровыйУчетБазовый.ДобавитьТекстЗапросаВТСведенияКадроваяИсторияСотрудников(Запрос, ТолькоРазрешенные, ОписательВременнойТаблицыОтборов, ПоляОтбораПериодическихДанных, ИсточникиДанных);
	
КонецПроцедуры

// Сведения об оплате труда

Функция НеобходимыСведенияОбОплатеТруда(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.НеобходимыСведенияОбОплатеТруда(ИмяПоля);
	
КонецФункции

Функция ПутьКДаннымСведенийОбОплатеТруда(ИмяПоля) Экспорт
	
	Возврат КадровыйУчетБазовый.ПутьКДаннымСведенийОбОплатеТруда(ИмяПоля);
	
КонецФункции

#КонецОбласти

#Область СобытияРегистровСведений

Процедура КадроваяИсторияСотрудниковПередЗаписью(НаборЗаписей, Отказ) Экспорт
	
	КадровыйУчетБазовый.КадроваяИсторияСотрудниковПередЗаписью(НаборЗаписей, Отказ);
	
КонецПроцедуры

Процедура КадроваяИсторияСотрудниковПриЗаписи(НаборЗаписей, Отказ) Экспорт
	
	КадровыйУчетБазовый.КадроваяИсторияСотрудниковПриЗаписи(НаборЗаписей, Отказ);
	
КонецПроцедуры

Процедура ПлановыеНачисленияПередЗаписью(НаборЗаписей, Отказ) Экспорт
	
	КадровыйУчетБазовый.ПлановыеНачисленияПередЗаписью(НаборЗаписей, Отказ);
	
КонецПроцедуры

Процедура ПлановыеНачисленияПриЗаписи(НаборЗаписей, Отказ) Экспорт
	
	КадровыйУчетБазовый.ПлановыеНачисленияПриЗаписи(НаборЗаписей, Отказ);
	
КонецПроцедуры

#КонецОбласти

Функция ТаблицаНачисленийСотрудниковПоВременнойТаблице(МенеджерВременныхТаблиц, ИмяВТСотрудникиПериоды, ИмяПоляПериод, ИмяПоляСотрудник) Экспорт
	
	Возврат КадровыйУчетБазовый.ТаблицаНачисленийСотрудниковПоВременнойТаблице(МенеджерВременныхТаблиц, ИмяВТСотрудникиПериоды, ИмяПоляПериод, ИмяПоляСотрудник);
	
КонецФункции

#КонецОбласти
