
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Справочники.Организации.ИспользуетсяНесколькоОрганизаций() Тогда
		
		СписокОрганизаций = Новый СписокЗначений;
		
		ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
		ПустаяОрганизация	= Справочники.Организации.ПустаяСсылка();
		
		Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
			СписокОрганизаций.Добавить(ОсновнаяОрганизация);
			СписокОрганизаций.Добавить(ПустаяОрганизация);
			ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма, , , СписокОрганизаций);
		КонецЕсли;
		
	КонецЕсли;
	
	ПустойДоговор = БухгалтерскийУчетПереопределяемый.ПолучитьПустоеЗначениеДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		
		СписокОрганизаций = Новый СписокЗначений;
				
		ПустаяОрганизация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка");
		Если ЗначениеЗаполнено(Параметр) Тогда
			СписокОрганизаций.Добавить(Параметр);
			СписокОрганизаций.Добавить(ПустаяОрганизация);
		КонецЕсли;
		
		ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(Список, , СписокОрганизаций);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СписокПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(Список, Настройки, "Организация");
	
КонецПроцедуры