// В версии ПРОФ учет по элементам затрат не поддерживается

Функция ПоддерживаетсяУчетПоЭлементамЗатрат() Экспорт
	
	Возврат Ложь;
	
КонецФункции

Функция ПредопределенныеСчетаРасходов() Экспорт
	
	Возврат Новый ФиксированныйМассив(Новый Массив);
	
КонецФункции

Процедура ПодготовитьОписаниеКоллекцииСумм(ОписаниеСумм, РазрезыУчетаРасходов) Экспорт
	
КонецПроцедуры

Процедура СоздатьСтруктуруСтоимостиЗапасов(МенеджерВременныхТаблиц, Период, Организация, РазрезыУчетаРасходов, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура СоздатьКлючиЭлементовЗатрат(МенеджерВременныхТаблиц, РазрезыУчетаРасходов, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура ДополнитьГрафЗатрат(Вершины, ОписаниеСумм, МенеджерВременныхТаблиц, РазрезыУчетаРасходов, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура УстановитьОсновнойЭлемент(Вершина, ОписаниеСумм) Экспорт
	
КонецПроцедуры

Процедура Исправить(Суммы, ОписаниеСумм) Экспорт
	
КонецПроцедуры

Функция ПараметрыФормированияПроводок(РазрезыУчетаРасходов, МенеджерВременныхТаблиц, ОписаниеСумм, ОписаниеСуммПроводок) Экспорт
	
	Возврат Неопределено;
	
КонецФункции

Процедура ДобавитьПроводки(Проводки, СводнаяПроводка, Суммы, ПараметрыФормированияПроводок) Экспорт
	
КонецПроцедуры

Процедура ДополнитьРезультат(Результат, Протокол, ОписаниеСумм, МенеджерВременныхТаблиц, Организация, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияСтруктураСтоимостиЗапасов(РезультатРасчета, Движения, Реквизиты) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияСтруктураСтоимостиЗапасовПриВводеНачальныхОстатков(ДанныеДокумента, Движения, Период, Организация, Подразделение) Экспорт
	
КонецПроцедуры
