#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СрокПолезногоИспользованияНУ = ?(НачислятьАмортизациюНУ, СрокПолезногоИспользованияНУ,0);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	ПорядокСписанияНИОКРНаРасходыНУ = ?(Дата < '20120101', Перечисления.ПорядокСписанияНИОКРНУ.Равномерно, 
	Перечисления.ПорядокСписанияНИОКРНУ.ПриПринятииКУчету);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ДОКУМЕНТА
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	Если РучнаяКорректировка Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПроведения = Документы.ПринятиеКУчетуНМА.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// ПОДГОТОВКА ПРОВЕДЕНИЯ ПО ДАННЫМ ИНФОРМАЦИОННОЙ БАЗЫ
	
	УчетНМА.ПроверитьВозможностьИзмененияСостоянияНМА(
		ПараметрыПроведения.СостоянияНМА,
		Отказ);
		
	ПараметрыПринятияКУчетуНМА = Документы.ПринятиеКУчетуНМА.ПодготовитьТаблицыПараметровПринятиеКУчетуНМА(
		ПараметрыПроведения.ПринятиеКУчетуНМА, ПараметрыПроведения.СпособОтраженияРасходов);
		
	// Учет доходов и расходов ИП
	ТаблицаПринятияКУчетуНМАИП	= УчетДоходовИРасходовПредпринимателя.ПодготовитьТаблицуПринятияКУчетуНМА(
		ПараметрыПроведения.ПервоначальныеСведенияНМАИП, ПараметрыПроведения.ПринятиеКУчетуНМА);
		
	// ФОРМИРОВАНИЕ ДВИЖЕНИЙ
	
	УчетНМА.СформироватьДвиженияСостоянияНМАОрганизаций(ПараметрыПроведения.СостоянияНМА,
		ПараметрыПроведения.ПринятиеКУчетуНМА, Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияПринятиеКУчетуНМА(
		ПараметрыПринятияКУчетуНМА.ТаблицаПринятияКУчетуНМА, ПараметрыПринятияКУчетуНМА.ТаблицаСписания,
		Движения, Отказ);

	УчетНМА.СформироватьДвиженияРегистрацияСчетовБухгалтерскогоУчетаНМА(
		ПараметрыПроведения.СчетаБухгалтерскогоУчетаНМА,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияИзменениеСпособовОтраженияРасходовПоАмортизацииНМАБУ(
		ПараметрыПроведения.СпособыОтраженияРасходовПоАмортизацииНМАБУ,
		Движения, Отказ);

	УчетНМА.СформироватьДвиженияРегистрацияПервоначальныхСведенийНМАБУ(
		ПараметрыПроведения.ПервоначальныеСведенияНМАБУ,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияРегистрацияПервоначальныхСведенийНМАНУ(
		ПараметрыПроведения.ПервоначальныеСведенияНМАНУ,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияРегистрацияПервоначальныхСведенийНМАУСН(
		ПараметрыПроведения.ТаблицаОплатНМАУСН,
		ПараметрыПроведения.ПервоначальныеСведенияНМАУСН,
		Движения, Отказ);
		
	УчетНМА.СформироватьДвиженияНачислениеАмортизацииНМАСпециальныйКоэффициентНУ(
		ПараметрыПроведения.НачислениеАмортизацииНМАСпециальныйКоэффициентНУ,
		Движения, Отказ);
		
	// Учет НДС
	УчетНДС.СформироватьДвиженияПринятиеНаУчетНМА(
		ПараметрыПроведения.РеквизитыНДС,
		Движения, Отказ);
		
	УчетНДСРаздельный.СформироватьДвиженияПринятиеНаУчетНМА(
		ПараметрыПроведения.НМАНДС,
		ПараметрыПроведения.СписанныеНМАНДС,
		ПараметрыПроведения.РеквизитыНДС,
		Движения, Отказ);
		
	// Учет доходов и расходов ИП
	УчетДоходовИРасходовПредпринимателя.СформироватьДвиженияПринятиеКУчетуНМА(
		ТаблицаПринятияКУчетуНМАИП,
		ПараметрыПроведения.ПринятиеКУчетуНМА, Движения, Отказ);
		
	УчетДоходовИРасходовПредпринимателя.РегистрацияСведенийОбОплатеОСиНМА(
		ТаблицаПринятияКУчетуНМАИП,
		ПараметрыПроведения.ПринятиеКУчетуНМА, Движения, Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	МассивНепроверяемыхРеквизитов = Новый Массив;

	ПрименениеПБУ18 = УчетнаяПолитика.ПоддержкаПБУ18(Организация, Дата);
	РаздельныйУчетНДСНаСчете19	= УчетнаяПолитика.РаздельныйУчетНДСНаСчете19(Организация, Дата);
	
	Если ПрименениеПБУ18 Тогда
		Если СтоимостьНУ + СтоимостьПР + СтоимостьВР = 0 Тогда
			ТекстСообщения = НСтр("ru = 'Поля ""Стоимость (НУ)"", ""Стоимость (ПР)"", ""Стоимость (ВР)"" не заполнены.
				|Хотя бы одно из этих полей должно быть заполнено.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "СтоимостьНУ");
		КонецЕсли;
		МассивНепроверяемыхРеквизитов.Добавить("СтоимостьНУ");
	КонецЕсли;
	
	Если НЕ РаздельныйУчетНДСНаСчете19 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СпособУчетаНДС");
	КонецЕсли;
	
	Если НЕ ПрименениеПБУ18 ИЛИ ВидОбъектаУчета = Перечисления.ВидыОбъектовУчетаНМА.НематериальныйАктив Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ПорядокСписанияНИОКРНаРасходыНУ");
	КонецЕсли;
	
	Если ВидОбъектаУчета <> Перечисления.ВидыОбъектовУчетаНМА.НематериальныйАктив Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СчетНачисленияАмортизации");
	КонецЕсли;
	
	Если Не НачислятьАмортизациюБУ Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СрокПолезногоИспользованияБУ");
		МассивНепроверяемыхРеквизитов.Добавить("СпособНачисленияАмортизацииБУ");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецЕсли