#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбменДанными.Загрузка Тогда
		Если НЕ ЭтотОбъект.Значение И Справочники.Организации.КоличествоОрганизаций() > 1 Тогда
			СообщениеОбОшибке = 
				НСтр("ru = 'Невозможно отключить учет по организациям. В справочнике организаций присутствует несколько элементов.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , , , Отказ);
			Возврат
		КонецЕсли;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РежимТакси = Константы.ИнтерфейсТакси.Получить();
	Константы.НеВестиУчетПоОрганизациям82.Установить(НЕ РежимТакси И НЕ ЭтотОбъект.Значение);
	
КонецПроцедуры

#КонецЕсли