
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ВедомостьНаВыплатуЗарплаты") Тогда
		ВидМестаВыплаты = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ВидМестаВыплаты");
		Если ВидМестаВыплаты <> ПредопределенноеЗначение("Перечисление.ВидыМестВыплатыЗарплаты.БанковскийСчет") Тогда
			ТекстСообщения = НСтр("ru = 'Для формирования платежных поручений укажите место выплаты ""Перечислением на счет в банке""!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецЕсли;
	Иначе		
		ЗарплатныйПроект = ОбщегоНазначенияБПВызовСервера.ЗначениеРеквизитаОбъекта(ПараметрКоманды, "ЗарплатныйПроект");
		Если ЗначениеЗаполнено(ЗарплатныйПроект) Тогда
			ТекстСообщения = НСтр("ru = 'Платежные поручения на каждого работника не формируются для перечисления по зарплатному проекту!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);			
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ВыплатаЗарплатыПлатежнымиПоручениями.Форма", Новый Структура("ПлатежнаяВедомость", ПараметрКоманды), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
			
КонецПроцедуры
