#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Интерфейс77 = Константы.ИнтерфейсВерсии77.Получить();
	Интерфейс82 = Константы.ИнтерфейсВерсии82.Получить();
	
	Если НЕ Интерфейс77 И НЕ Интерфейс82 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Параметры.ВариантПредложения = "ВключитьСтандартныйИнтерфейс" Тогда
		Элементы.ГруппаСтраницыПояснения.ТекущаяСтраница = ?(Интерфейс77, 
			Элементы.ГруппаВключитьСтандартныйИнтерфейс77, Элементы.ГруппаВключитьСтандартныйИнтерфейс82);
	ИначеЕсли Параметры.ВариантПредложения = "ИзменитьКомандныйИнтерфейс" Тогда
		Если РольДоступна("ПолныеПрава") Тогда
			Элементы.ГруппаСтраницыПояснения.ТекущаяСтраница = ?(Интерфейс77, 
				Элементы.ГруппаИзменитьКомандныйИнтерфейс77, Элементы.ГруппаИзменитьКомандныйИнтерфейс82);
		Иначе
			Элементы.ГруппаСтраницыПояснения.ТекущаяСтраница = ?(Интерфейс77, 
				Элементы.ГруппаИзменитьКомандныйИнтерфейсНеполныеПрава77, Элементы.ГруппаИзменитьКомандныйИнтерфейсНеполныеПрава82);
		КонецЕсли;
	Иначе
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВключитьСтандартныйИнтерфейс(Команда)
	
	ЗаписатьНастройки();
	ПропуститьПредупреждениеПередЗавершениемРаботыСистемы = Истина;
	ЗавершитьРаботуСистемы(Ложь, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НапомнитьПозже(Команда)
	
	ОбновитьНастройки();	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьНастройки()
	
	ОбщегоНазначенияБП.УстановитьРежимКомандногоИнтерфейса("ИнтерфейсТакси");
	ХранилищеОбщихНастроек.Сохранить(ВРег("ДатаСменыИнтерфейса"),,Дата('00010101'),,);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНастройки()
	
	ХранилищеОбщихНастроек.Сохранить(ВРег("ДатаСменыИнтерфейса"),,ТекущаяДата(),,);
	
КонецПроцедуры

#КонецОбласти
