
Процедура ОбновитьРегистрациюВНалоговомОргане(Форма, КПП, КодНалоговогоОргана, РегистрацияВНалоговомОргане) Экспорт
	
	Форма.Модифицированность = Истина;
	
	Форма.ЗначениеВРеквизитФормы(РегистрацияВНалоговомОргане.ПолучитьОбъект(), "РегистрацияВНалоговомОргане");
	Форма.Объект.РегистрацияВНалоговомОргане = РегистрацияВНалоговомОргане.Ссылка;
	
	//Установим КПП и код налогового органа из обновленной регистрации
	Если КПП <> Форма.РегистрацияВНалоговомОргане.КПП Тогда
		КПП = Форма.РегистрацияВНалоговомОргане.КПП;
	КонецЕсли;
	
	Если КодНалоговогоОргана <> Форма.РегистрацияВНалоговомОргане.Код Тогда
		КодНалоговогоОргана = Форма.РегистрацияВНалоговомОргане.Код;
	КонецЕсли;
	
	Форма.ОтчетностьПодписываетПредставитель = ?(ЗначениеЗаполнено(Форма.РегистрацияВНалоговомОргане.Представитель), 1, 0);
	
	УстановитьАктуальноеЗначениеИстории(Форма, "ИсторияРегистрацийВНалоговомОргане", Новый Структура("РегистрацияВНалоговомОргане", РегистрацияВНалоговомОргане.Ссылка));
	
КонецПроцедуры

Процедура ЗаписатьРегистрациюВНалоговомОргане(Форма, ТекущийОбъект, ВладелецРегистрации) Экспорт
	
	ОбъектРегистрации = Форма.РеквизитФормыВЗначение("РегистрацияВНалоговомОргане");
	// В ПередЗаписьюНаСервере в свойство РегистрацияВНалоговомОргане устанавливается 
	// значение ссылки на новую регистрацию. 
	// Если это значение установлено и регистрация еще не сохранялась, то нужно установить ссылку нового
	Если НЕ ЗначениеЗаполнено(ОбъектРегистрации.Ссылка)
		И ЗначениеЗаполнено(ТекущийОбъект.РегистрацияВНалоговомОргане) Тогда
		ОбъектРегистрации.УстановитьСсылкуНового(ТекущийОбъект.РегистрацияВНалоговомОргане);
	КонецЕсли;
	ОбъектРегистрации.Владелец = ВладелецРегистрации;
	ОбъектРегистрации.Записать();
	
	Форма.ЗначениеВРеквизитФормы(ОбъектРегистрации, "РегистрацияВНалоговомОргане");
	
	Если ТекущийОбъект.РегистрацияВНалоговомОргане <> ОбъектРегистрации.Ссылка Тогда
		ТекущийОбъект.РегистрацияВНалоговомОргане = ОбъектРегистрации.Ссылка;
	КонецЕсли;
	
	УстановитьАктуальноеЗначениеИстории(Форма, "ИсторияРегистрацийВНалоговомОргане", Новый Структура("РегистрацияВНалоговомОргане", ТекущийОбъект.РегистрацияВНалоговомОргане));
	
КонецПроцедуры

Процедура УстановитьНовуюРегистрацию(Форма, ВладелецРегистрации, КПП, КодНалоговогоОргана) Экспорт
	
	СвойстваПредставителя = Новый Структура("Доверенность, ДокументПредставителя, Представитель, УполномоченноеЛицоПредставителя");
	ЗаполнитьЗначенияСвойств(СвойстваПредставителя, Форма.РегистрацияВНалоговомОргане);
	
	КодыОКТМО = Новый Структура("КодПоОКТМО, КодПоОКАТО");
	ЗаполнитьЗначенияСвойств(КодыОКТМО, Форма.РегистрацияВНалоговомОргане);
	
	РеквизитыНалоговогоОргана = Новый Структура("Код, Наименование, НаименованиеИФНС");
	ЗаполнитьЗначенияСвойств(РеквизитыНалоговогоОргана, Форма.РегистрацияВНалоговомОргане);
	
	Форма.ЗначениеВРеквизитФормы(Справочники.РегистрацииВНалоговомОргане.СоздатьЭлемент(), "РегистрацияВНалоговомОргане");
	Форма.РегистрацияВНалоговомОргане.Владелец = ВладелецРегистрации;
	Форма.РегистрацияВНалоговомОргане.КПП      = КПП;
	Форма.РегистрацияВНалоговомОргане.Код      = КодНалоговогоОргана;
	Если РеквизитыНалоговогоОргана.Код = Форма.РегистрацияВНалоговомОргане.Код Тогда
		ЗаполнитьЗначенияСвойств(Форма.РегистрацияВНалоговомОргане, РеквизитыНалоговогоОргана);
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Форма.РегистрацияВНалоговомОргане, СвойстваПредставителя);
	ЗаполнитьЗначенияСвойств(Форма.РегистрацияВНалоговомОргане, КодыОКТМО);
	Форма.Объект.РегистрацияВНалоговомОргане = Справочники.РегистрацииВНалоговомОргане.ПустаяСсылка();
	
	Форма.ОтчетностьПодписываетПредставитель = ?(ЗначениеЗаполнено(Форма.РегистрацияВНалоговомОргане.Представитель), 1, 0);
	
КонецПроцедуры

Процедура ЗаписатьНаборЗаписейИсторииРегистрацийВНалоговомОргане(Форма, Владелец) Экспорт
	
	Набор = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
	Набор.Отбор.СтруктурнаяЕдиница.Установить(Владелец);
	
	История = Форма.ИсторияРегистрацийВНалоговомОрганеНаборЗаписей.Выгрузить();
	История.ЗаполнитьЗначения(Владелец, "СтруктурнаяЕдиница");
	Набор.Загрузить(История);
	Набор.Записать();
	
КонецПроцедуры

Процедура ПрочитатьНаборЗаписейИсторииРегистрацийВНалоговомОргане(Форма, Владелец) Экспорт
	
	Набор = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.СоздатьНаборЗаписей();
	Набор.Отбор.СтруктурнаяЕдиница.Установить(Владелец);
	Набор.Прочитать();
	Форма.ЗначениеВРеквизитФормы(Набор, "ИсторияРегистрацийВНалоговомОрганеНаборЗаписей");
	Форма.ИсторияРегистрацийВНалоговомОрганеНаборЗаписей.Сортировать("Период");
	
КонецПроцедуры

Функция АктуальнаяЗаписьИстории(Форма) Экспорт
	
	ИсторияНаборЗаписей = Форма.ИсторияРегистрацийВНалоговомОрганеНаборЗаписей;
	
	КоличествоЗаписей = ИсторияНаборЗаписей.Количество();
	ДатаОтсчетаПериодическихСведений = РегистрыСведений.ИсторияРегистрацийВНалоговомОргане.ДатаОтсчетаПериодическихСведений();
	
	Если КоличествоЗаписей > 0 Тогда
		АктуальнаяЗаписьИстории = ИсторияНаборЗаписей[КоличествоЗаписей - 1];
	Иначе
		АктуальнаяЗаписьИстории = ИсторияНаборЗаписей.Добавить();
		АктуальнаяЗаписьИстории.Период = ДатаОтсчетаПериодическихСведений;
	КонецЕсли;
	
	Возврат АктуальнаяЗаписьИстории;
	
КонецФункции

Процедура УстановитьАктуальноеЗначениеИстории(Форма, ИмяРегистраСведений, АктуальныеЗначения)
	
	ИсторияНаборЗаписей = Форма[ИмяРегистраСведений+"НаборЗаписей"];
	
	ИсторияНаборЗаписей.Сортировать("Период");
	
	КоличествоЗаписей = ИсторияНаборЗаписей.Количество();
	ДатаОтсчетаПериодическихСведений = РегистрыСведений[ИмяРегистраСведений].ДатаОтсчетаПериодическихСведений();
	
	Если КоличествоЗаписей > 0 Тогда
		// Самая первая запись действует с начала истории
		ИсторияНаборЗаписей[0].Период = ДатаОтсчетаПериодическихСведений;
		
		АктуальнаяЗаписьИстории = ИсторияНаборЗаписей[КоличествоЗаписей - 1];
	Иначе
		АктуальнаяЗаписьИстории = ИсторияНаборЗаписей.Добавить();
		АктуальнаяЗаписьИстории.Период = ДатаОтсчетаПериодическихСведений;
	КонецЕсли;
	Для Каждого Значение Из АктуальныеЗначения Цикл
		АктуальнаяЗаписьИстории[Значение.Ключ] = Значение.Значение;
	КонецЦикла;
	
КонецПроцедуры

