#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;

Функция ПолныйШифрСтрахователяФСС(ШифрСтрахователяФСС, СистемыНалогообложения, ВидПлательщикаСтраховыхВзносов) Экспорт
	
	ПолныйШифр = Новый Структура;
	ПолныйШифр.Вставить("Часть1", ШифрСтрахователяФСС);
	ПолныйШифр.Вставить("Часть2", "");
	ПолныйШифр.Вставить("Часть3", "");
	
	ПрименяетсяОСНО = Найти(СистемыНалогообложения, "ОСНО") > 0;
	ПрименяетсяУСН  = Найти(СистемыНалогообложения, "УСН") > 0;
	ПрименяетсяЕНВД = Найти(СистемыНалогообложения, "ЕНВД") > 0;
	ПрименяетсяЕСХН = Найти(СистемыНалогообложения, "ЕСХН") > 0;
	ПрименяетсяПСН  = Найти(СистемыНалогообложения, "ПСН") > 0;
	
	Если ЗначениеЗаполнено(ШифрСтрахователяФСС) Тогда
		КодТипаНалогообложения = "";
		
		Если ШифрСтрахователяФСС = "071"
		   И ПрименяетсяОСНО И НЕ ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И НЕ ПрименяетсяПСН Тогда
			КодТипаНалогообложения = "00";
		КонецЕсли;
		
		Если ШифрСтрахователяФСС = "071"
		   И НЕ ПрименяетсяОСНО И ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И НЕ ПрименяетсяПСН Тогда
			КодТипаНалогообложения = "01";
		КонецЕсли;
		
		Если ШифрСтрахователяФСС = "071"
		   И НЕ ПрименяетсяОСНО И НЕ ПрименяетсяУСН И ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И НЕ ПрименяетсяПСН Тогда
			КодТипаНалогообложения = "02";
		КонецЕсли;
				
		Если ШифрСтрахователяФСС = "121"
		   И НЕ ПрименяетсяОСНО И ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И НЕ ПрименяетсяПСН Тогда
			КодТипаНалогообложения = "01";
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(КодТипаНалогообложения) Тогда
			// ОСНО.
			Если ПрименяетсяОСНО И НЕ ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И НЕ ПрименяетсяПСН Тогда
				КодТипаНалогообложения = "00";
			КонецЕсли;
			
			// УСН.
			Если НЕ ПрименяетсяОСНО И ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И НЕ ПрименяетсяПСН Тогда
				КодТипаНалогообложения = "01";
			КонецЕсли;
			
			// ЕНВД.
			Если НЕ ПрименяетсяОСНО И НЕ ПрименяетсяУСН И ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И НЕ ПрименяетсяПСН Тогда
				КодТипаНалогообложения = "02";
			КонецЕсли;
			
			// ПСН.
			Если НЕ ПрименяетсяОСНО И НЕ ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И ПрименяетсяПСН Тогда
				КодТипаНалогообложения = "00";
			КонецЕсли;
			
			// ОСНО + ПСН.
			Если ПрименяетсяОСНО И НЕ ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И ПрименяетсяПСН Тогда
				КодТипаНалогообложения = "00";
			КонецЕсли;
			
			// ЕНВД + ПСН.
			Если НЕ ПрименяетсяОСНО И НЕ ПрименяетсяУСН И ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И ПрименяетсяПСН Тогда
				КодТипаНалогообложения = "02";
			КонецЕсли;
			
			// УСН + ПСН и шифр страхователя не 171.
			Если ЗначениеЗаполнено(ШифрСтрахователяФСС) И ШифрСтрахователяФСС <> "171"
			   И НЕ ПрименяетсяОСНО И ПрименяетсяУСН И НЕ ПрименяетсяЕНВД И НЕ ПрименяетсяЕСХН И ПрименяетсяПСН Тогда
				КодТипаНалогообложения = "01";
			КонецЕсли;
		КонецЕсли;
		
		ПолныйШифр.Вставить("Часть2", КодТипаНалогообложения);
		ПолныйШифр.Вставить("Часть3", ВидПлательщикаСтраховыхВзносов);
	КонецЕсли;
	
	Возврат ПолныйШифр;
	
КонецФункции

#КонецЕсли
