#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	НайденныеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(
		Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ЭкспортНакопленнойСтатистики));
		
	Для Каждого РегламентноеЗадание Из НайденныеРегламентныеЗадания Цикл
		РегламентноеЗадание.Использование = Значение;
		РегламентноеЗадание.Записать();
	КонецЦикла;
	
	Если Значение Тогда
		Константы.НижняяГраницаСчитыванияСтатистики.Установить(ТекущаяДата());	
	КонецЕсли;
		
КонецПроцедуры

#КонецЕсли