////////////////////////////////////////////////////////////////////////////////
// КадровыйУчетВнутреннийКлиентСервер: методы кадрового учета, работающие на стороне 
//							клиента и сервера.
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// См. КадровыйУчетКлиентСервер.ОбработкаПолученияДанныхВыбораВидовЗанятости.
//
Процедура ОбработкаПолученияДанныхВыбораВидовЗанятости(ДанныеВыбора, Параметры, СтандартнаяОбработка) Экспорт
	
	// В этой конфигурации ничего не делается.
	
КонецПроцедуры

#КонецОбласти
