////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен Зарплата 3 Бухгалтерия 3"
// Серверные процедуры и функции, обслуживающие подписки на события.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьНастройкиИспользованияОбменаЗарплата3Бухгалтерия3ПриЗаписи(Источник, Отказ) Экспорт
	
	Если Метаданные.ПодпискиНаСобытия.ЗаписатьНастройкиИспользованияОбменаЗарплата3Бухгалтерия3.Источник.Типы().Количество() <> 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("Загрузка") Или Источник.ДополнительныеСвойства.Свойство("ПолучениеСообщенияОбмена") Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникСсылка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, "НомерОтправленного, НомерПринятого");
	
	Если ИсточникСсылка.НомерОтправленного <> Источник.НомерОтправленного Или ИсточникСсылка.НомерПринятого <> Источник.НомерПринятого Тогда
		Возврат;
	КонецЕсли;
	
	МетаданныеПланаОбмена = Источник.Метаданные();
	
	Если МетаданныеПланаОбмена.Реквизиты.Найти("ИспользоватьОтборПоОрганизациям") = Неопределено
		Или МетаданныеПланаОбмена.ТабличныеЧасти.Найти("Организации") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяПланаОбмена = МетаданныеПланаОбмена.Имя;
	ПолноеИмяПланаОбмена = МетаданныеПланаОбмена.ПолноеИмя();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ЭтотУзел", ПланыОбмена[ИмяПланаОбмена].ЭтотУзел());
	
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбменЗарплата3Бухгалтерия3.ИспользоватьОтборПоОрганизациям
	|ИЗ
	|	#ПолноеИмяПланаОбмена КАК ОбменЗарплата3Бухгалтерия3
	|ГДЕ
	|	ОбменЗарплата3Бухгалтерия3.Ссылка <> &ЭтотУзел";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяПланаОбмена", ПолноеИмяПланаОбмена);
	
	ЕстьОбмены = Не Запрос.Выполнить().Пустой();
	Если Не ЕстьОбмены Тогда
		Константы.ИспользоватьОбменЗарплата3Бухгалтерия3ПоВсемОрганизациям.Установить(Ложь);
		НаборЗаписей = РегистрыСведений.ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МИНИМУМ(ОбменЗарплата3Бухгалтерия3.ИспользоватьОтборПоОрганизациям) КАК ИспользоватьОтборПоОрганизациям
	|ИЗ
	|	#ПолноеИмяПланаОбмена КАК ОбменЗарплата3Бухгалтерия3
	|ГДЕ
	|	ОбменЗарплата3Бухгалтерия3.Ссылка <> &ЭтотУзел";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяПланаОбмена", ПолноеИмяПланаОбмена);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Если Не Выборка.ИспользоватьОтборПоОрганизациям Тогда
		Константы.ИспользоватьОбменЗарплата3Бухгалтерия3ПоВсемОрганизациям.Установить(Истина);
		НаборЗаписей = РегистрыСведений.ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям.СоздатьНаборЗаписей();
		НаборЗаписей.Записать();
		Возврат;
	КонецЕсли;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОбменЗарплата3Бухгалтерия3Организации.Организация,
	|	ИСТИНА КАК Используется
	|ИЗ
	|	#ПолноеИмяПланаОбменаТаблицаОрганизации КАК ОбменЗарплата3Бухгалтерия3Организации
	|ГДЕ
	|	ОбменЗарплата3Бухгалтерия3Организации.Ссылка <> &ЭтотУзел";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ПолноеИмяПланаОбменаТаблицаОрганизации", ПолноеИмяПланаОбмена + ".Организации");
	НаборЗаписей = РегистрыСведений.ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(Запрос.Выполнить().Выгрузить());
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти
