#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
    Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
        Возврат;
	КонецЕсли;
	
	КадровыйУчет.ЗапомнитьСписокСотрудниковДляОбновления(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
    Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
        Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("МассивСотрудниковДляОбновления") Тогда
		КадровыйУчет.ОбновитьТекущиеТарифныеСтавки(ДополнительныеСвойства.МассивСотрудниковДляОбновления);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
