&НаСервере
Перем КонтекстЭДОСервер;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.ИмяФайла) Тогда 
		Заголовок = Параметры.ИмяФайла + " - просмотр";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Параметры.Содержимое) Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("ПереноситьПоСловам") И Параметры.ПереноситьПоСловам Тогда
		Элементы.ПолеTEXTДокумента.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.ПолеTEXTДокумента.МногострочныйРежим = Истина;
		Элементы.ПолеTEXTДокумента.Шрифт = Новый Шрифт(Элементы.ПолеTEXTДокумента.Шрифт, , 10);
	КонецЕсли;
	
	Содержимое = Параметры.Содержимое;
	
	ТипСодержимого = ТипЗнч(Содержимое);
	Если ТипСодержимого = Тип("ДвоичныеДанные") Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Параметры.ИмяФайла);
		Содержимое.Записать(ИмяВременногоФайла);
		Если НЕ Параметры.Свойство("КодировкаТекста") ИЛИ НЕ ЗначениеЗаполнено(Параметры.КодировкаТекста) Тогда
			Текст = Новый ЧтениеТекста(ИмяВременногоФайла);
		Иначе
			Текст = Новый ЧтениеТекста(ИмяВременногоФайла, Параметры.КодировкаТекста);
		КонецЕсли;
		ТекстСодержимого = Текст.Прочитать();
		TEXTДокумент = ТекстСодержимого;
		
	ИначеЕсли ТипСодержимого = Тип("ХранилищеЗначения") Тогда
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Параметры.ИмяФайла);
		Содержимое.Получить().Записать(ИмяВременногоФайла);
		Если НЕ Параметры.Свойство("КодировкаТекста") ИЛИ НЕ ЗначениеЗаполнено(Параметры.КодировкаТекста) Тогда
			Текст = Новый ЧтениеТекста(ИмяВременногоФайла, "windows-1251");
		Иначе
			Текст = Новый ЧтениеТекста(ИмяВременногоФайла, Параметры.КодировкаТекста);
		КонецЕсли;
		ТекстСодержимого = Текст.Прочитать();
		TEXTДокумент = ТекстСодержимого;
		
	ИначеЕсли ТипСодержимого = Тип("Строка") Тогда
		// В качестве значения реквизита формы может выступать навигационная ссылка или текст TEXT-документа
		TEXTДокумент = Содержимое;
		
		//Если Найти(Содержимое, "<") <> 0 Тогда // это текст HTML, т.к. в имени файла символ "<" недопустим
		//	HTMLДокумент = Содержимое;
		//Иначе
		//	HTMLДокумент = Содержимое;
		//КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Параметры.ИмяФайла) Тогда
		TEXTДокумент = Параметры.ИмяФайла;
	КонецЕсли;
	
	Если Параметры.Свойство("ПолеНастроекПечати") И ЗначениеЗаполнено(Параметры.ПолеНастроекПечати) Тогда
		ЦиклОбмена = Параметры.ЦиклОбмена;
		ФорматДокументооборота = Параметры.ЦиклОбмена.ФорматДокументооборота;
		ПолеНастроекПечати = Параметры.ПолеНастроекПечати;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	Если ЗначениеЗаполнено(ПолеНастроекПечати) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ПечатьЗавершение", ЭтотОбъект);
		ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
		
	Иначе
		ТабличныйДокументСТекстом().Напечатать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	РезультатНастройки = Новый Структура(ПолеНастроекПечати + ", ФорматДокументооборота", Истина, ФорматДокументооборота);
	КонтекстЭДОКлиент.СформироватьИПоказатьПечатныеДокументы(ЦиклОбмена, РезультатНастройки);
	
КонецПроцедуры

&НаСервере
Функция ТабличныйДокументСТекстом()
	
	Если КонтекстЭДОСервер = Неопределено Тогда
		КонтекстЭДОСервер = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО();
	КонецЕсли;
	
	ТабДокумент = Новый ТабличныйДокумент;
	Бланк = КонтекстЭДОСервер.ПолучитьМакет("БланкПечатиТекста");
	
	ТабДокумент.АвтоМасштаб = Истина;
	
	Секция_Тело = Бланк.ПолучитьОбласть("Секция_Тело");
	Для Инд = 1 По СтрЧислоСтрок(TEXTДокумент) Цикл
		Секция_Тело.Области["Тело"].Текст = СтрПолучитьСтроку(TEXTДокумент, Инд);
		ТабДокумент.Вывести(Секция_Тело);
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции
