
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыЗаполнения = Новый Структура("ДокументОснование,ВидСчетаФактуры", 
		ПараметрКоманды, ПредопределенноеЗначение("Перечисление.ВидСчетаФактурыПолученного.НаАванс"));
	ПараметрыФормы      = Новый Структура("ЗначенияЗаполнения", ПараметрыЗаполнения);
	ОценкаПроизводительностиКлиентСервер.НачатьЗамерВремени("ОткрытиеФормыСчетФактураПолученный");
	ОткрытьФорму("Документ.СчетФактураПолученный.ФормаОбъекта", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
