#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	АдресХранилища = Параметры.АдресХранилища;
	
	СформированныйОтчет = ПолучитьИзВременногоХранилища(АдресХранилища);

	Если ТипЗнч(СформированныйОтчет) = Тип("ТабличныйДокумент") Тогда
		
		ТабДокумент.Вывести(СформированныйОтчет);
		
	Иначе
		Отказ = Истина;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти