#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)
	
	НайденныеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания(
		Новый Структура("Метаданные", Метаданные.РегламентныеЗадания.ОбработкаЗаявленийАбонентовНаПодключениеЭлектроннойПодписиВМоделиСервиса));
		
	Для Каждого РегламентноеЗадание Из НайденныеРегламентныеЗадания Цикл
		РегламентноеЗадание.Использование = Значение;
		РегламентноеЗадание.Записать();
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли