
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Организации.Ссылка КАК Организация,
					|	УчетнаяПолитикаОрганизацийСрезПоследних.СистемаНалогообложения КАК ТекущийРежим
					|ИЗ
					|	Справочник.Организации КАК Организации
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних(, СистемаНалогообложения <> ЗНАЧЕНИЕ(Перечисление.СистемыНалогообложения.ОсобыйПорядок)) КАК УчетнаяПолитикаОрганизацийСрезПоследних
					|		ПО (Организации.Ссылка = УчетнаяПолитикаОрганизацийСрезПоследних.Организация)
					|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("УчетнаяПолитикаНеЗадана", НСтр("ru = 'Не задан'"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Организации.Добавить();
		НоваяСтрока.Организация = Выборка.Организация; 
		НоваяСтрока.ТекущийРежим = Выборка.ТекущийРежим;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОрганизации

&НаКлиенте
Процедура ОрганизацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", Организации[ВыбраннаяСтрока].Организация);
	Результат.Вставить("ТекущийРежим", Организации[ВыбраннаяСтрока].ТекущийРежим);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ВыбраннаяСтрока = Элементы.Организации.ТекущаяСтрока;
	
	Результат = Новый Структура;
	Результат.Вставить("Организация", Организации[ВыбраннаяСтрока].Организация);
	Результат.Вставить("ТекущийРежим", Организации[ВыбраннаяСтрока].ТекущийРежим);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти
