#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Процедура ПодготовитьТаблицыДокумента(ТаблицаВыручки) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("СчетФактура", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВводНачальныхОстатковДанныеПоСФНДС.СчетУчета КАК СчетУчетаНДС,
	|	ВводНачальныхОстатковДанныеПоСФНДС.СтавкаНДС,
	|	ВводНачальныхОстатковДанныеПоСФНДС.НДС,
	|	ВводНачальныхОстатковДанныеПоСФНДС.СуммаБезНДС,
	|	ВводНачальныхОстатковДанныеПоСФНДС.ВидЦенности
	|ИЗ
	|	Документ.ВводНачальныхОстатков.ДанныеПоСФНДС КАК ВводНачальныхОстатковДанныеПоСФНДС
	|ГДЕ
	|	ВводНачальныхОстатковДанныеПоСФНДС.Ссылка.РазделУчета = ЗНАЧЕНИЕ(Перечисление.РазделыУчетаДляВводаОстатков.НДСПоПриобретеннымЦенностям)
	|	И ВводНачальныхОстатковДанныеПоСФНДС.СчетФактура = &СчетФактура";
	
	ТаблицаВыручки = Запрос.Выполнить().Выгрузить();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ МОДУЛЯ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
	Если ЗначениеЗаполнено(ДоговорКонтрагента) Тогда
		ВалютаДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорКонтрагента, "ВалютаВзаиморасчетов");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата              = НачалоДня(ОбщегоНазначенияБП.ПолучитьРабочуюДату());
	ДокументОснование = Неопределено;
	
КонецПроцедуры


#КонецЕсли