

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

&НаКлиенте
Процедура ОсновныеДействияФормыОК(Кнопка)
	
	ЭтаФорма.Закрыть(ДоляВыручкиНеОблагаемаяНДС);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ РЕКВИЗИТОВ ФОРМЫ

&НаКлиенте
Процедура ОбщаяВыручкаПриИзменении(Элемент)
	
	Если  ЭтаФорма.ОбщаяВыручка <> 0 Тогда 
		ЭтаФорма.ДоляВыручкиНеОблагаемаяНДС = ЭтаФорма.ВыручкаНеОблагаемаяНДС / ЭтаФорма.ОбщаяВыручка * 100;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыручкаНеОблагаемаяНДСПриИзменении(Элемент)
	
	Если  ЭтаФорма.ОбщаяВыручка <> 0 Тогда 
		ЭтаФорма.ДоляВыручкиНеОблагаемаяНДС = ЭтаФорма.ВыручкаНеОблагаемаяНДС / ЭтаФорма.ОбщаяВыручка * 100;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДоляВыручкиНеОблагаемаяНДСПриИзменении(Элемент)

	ЭтаФорма.ВыручкаНеОблагаемаяНДС = ЭтаФорма.ОбщаяВыручка * ЭтаФорма.ДоляВыручкиНеОблагаемаяНДС / 100;
	
КонецПроцедуры
