// Определяет, используется ли документ РегламентнаяОперация для переданного вида операции
//
// Параметры:
//  ВидыРегламентныхОпераций - ПеречислениеСсылка.ВидыРегламентныхОпераций
//
// Возвращаемое значение:
//  Булево
Функция ИспользуетсяДокументРегламентнаяОперация(ВидОперации) Экспорт
	
	ТипВидыРегламентныхОпераций = Тип("ПеречислениеСсылка.ВидыРегламентныхОпераций");
	Возврат ТипЗнч(ВидОперации) = ТипВидыРегламентныхОпераций 
		И ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыРегламентныхОпераций.НачислениеНДС")
		И ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыРегламентныхОпераций.НачислениеЗарплаты")
		И ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыРегламентныхОпераций.НачислениеРезерваОтпусков");
		
КонецФункции

// Определяет, мешает ли операция считать месяц закрытым
//
// Параметры:
//  Операция - Строка таблицы значений, которая содержит колонки Требуется, Устарела и Состояние. 
//             Такую таблицу готовит процедура ЗакрытиеМесяца.СоздатьДетальныйСтатусЗакрытияМесяца()
//             Такая же таблица используется в форме Обработки.ЗакрытиеМесяца
//
// Возвращаемое значение:
//  Булево - Истина - требуется что-то сделать - выполнить или пропустить
//         - Ложь - не мешает считать месяц закрытым
Функция ОперацияВРаботе(Операция) Экспорт
	
	Если Не Операция.Требуется Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Операция.Устарела
		Или Операция.Состояние = ПредопределенноеЗначение("Перечисление.ВидыСостоянийРегламентныхОпераций.ВыполненоСОшибками")
		Или Операция.Состояние = ПредопределенноеЗначение("Перечисление.ВидыСостоянийРегламентныхОпераций.НеВыполнено");
	
КонецФункции
