
&НаКлиенте
Перем ПараметрыОбработчикаОжидания;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();

	Если Не ОбщегоНазначения.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Тогда
		// База, размещенная в сервисе, может запускаться администратором без доступа к разделенным данным
		Возврат;
	КонецЕсли;
	
	ВариантРабочегоСтола = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ВариантРабочегоСтола");
	
	Организация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	ОрганизацияПредставление = Организация;
	
	АдресНаИТС = ЗадачиБухгалтераКлиентСервер.СсылкаНаИТС();
	
	СписокЗадач.КомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(НастройкиОформленияСпискаЗадач());
	ОбщегоНазначенияБПВызовСервера.УстановитьОтборПоОсновнойОрганизации(ЭтаФорма, "СписокЗадач", , ОтборПоОрганизации(Организация));
	
	ОбновитьТекущуюДатуЗаголовокФормыНаСервере();
	
	// Проверим в каком интерфейсе открыта конфигурация
	НастройкиКлиента = ХранилищеСистемныхНастроек.Загрузить("Общее/НастройкиКлиентскогоПриложения");
	Если ТипЗнч(НастройкиКлиента) = Тип("НастройкиКлиентскогоПриложения") 
		И НастройкиКлиента.ВариантИнтерфейсаКлиентскогоПриложения = ВариантИнтерфейсаКлиентскогоПриложения.Версия8_2 Тогда
		// В интерфейсе 8.2 нужно увеличить ширину разделов монитора руководителя
		// и отобразить рамку списка задач бухгалтера
		ШиринаРазделаВМонитореРуководителя = 70;
		Элементы.СписокЗадач.ЦветРамки             = Новый Цвет();
		Элементы.СписокЗадачНачалаРаботы.ЦветРамки = Новый Цвет();
	Иначе
		ШиринаРазделаВМонитореРуководителя = 50;
	КонецЕсли;
	
	Элементы.ДекорацияЕдиницаИзмерения.Ширина = ШиринаРазделаВМонитореРуководителя - 1;
	
	// Устанавливаем ширину разделов монитора в зависимости от интерфейса
	СписокРазделовМонитора = МониторРуководителя.СтандартныйСписокРазделовМонитораРуководителя();
	Для Каждого ЭлементСпискаРазделовМонитора Из СписокРазделовМонитора Цикл
		ИмяРазделаМонитора = ОбщегоНазначения.ИмяЗначенияПеречисления(ЭлементСпискаРазделовМонитора.Значение);
		Элементы[ИмяРазделаМонитора].Ширина = ШиринаРазделаВМонитореРуководителя;
	КонецЦикла;
	
	Если ВариантРабочегоСтола = "ЗадачиБухгалтера" Тогда
		// Список задач актуален, если не выполнены задачи начала работы или дата актуальности больше текущей даты
		ЗаполнитьСписокЗадачНачалаРаботыНаСервере();
		Если СписокЗадачНачалаРаботы.Количество() > 0 Тогда
			СписокЗадачАктуален = Истина;
			СписокЗадачПустой   = Ложь;
			Заголовок = ""; // Не показываем заголовок, если не выполнены задачи начала работы
		Иначе
			ДатаАктуальности = РегистрыСведений.АктуальностьСпискаЗадачБухгалтера.ДатаАктуальности(Организация);
			СписокЗадачАктуален = (ТекущаяДата < ДатаАктуальности);
			СписокЗадачПустой   = СписокЗадачПустой(Организация, ДатаПоявленияЗадач);
		КонецЕсли;
	Иначе
		// Пока пользователь не потребовал обновить, считаем, что данные монитора актуальны
		МониторАктуален = Истина; 
		ОбновитьМониторНаСервере();
	КонецЕсли;
	
	// Помощь в освоении
	НастройкиПредупрежденийОбИзменениях = ОбщегоНазначенияБП.НастройкиПредупрежденийОбИзменениях(
		"ЗадачаБухгалтераПомещенаВСписокВыполненных,
		|ВыполненаЗадачаПараметрыУчета,
		|ВыполненаЗадачаСписокНалоговОтчетов,
		|ВыполненаЗадачаНастройкаЗаполненияФормСтатистики");
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьОбновлениеРабочегоСтолаПриОткрытии", 16, Истина);
	
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьОбновлениеРабочегоСтола", ИнтервалОбновления, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеОсновнойОрганизации" Тогда
		
		Организация = Параметр;
		ОрганизацияПриИзмененииНаКлиенте();
		
	ИначеЕсли ИмяСобытия = "СписокЗадачБухгалтера_Изменение" Тогда
		
		// Пользователь изменил список задач
		СписокЗадачПустой = СписокЗадачПустой(Организация, ДатаПоявленияЗадач);
		УправлениеФормой(ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантРабочегоСтолаПриИзменении(Элемент)
	
	ВариантРабочегоСтолаПриИзмененииНаСервере();
	
	ЖдатьЗавершенияФоновогоЗадания();
	
КонецПроцедуры

&НаСервере
Процедура ВариантРабочегоСтолаПриИзмененииНаСервере()
	
	Если ВариантРабочегоСтола = "ЗадачиБухгалтера" Тогда
		ЗаполнитьСписокЗадачБухгалтераНаСервере();
	Иначе
		// Сразу обновим монитор устаревшими данными.
		// А затем, запустим обработку обновления данных монитора в фоне.
		ОбновитьМониторНаСервере();
		ОбновитьДанныеМонитора();
	КонецЕсли;
	
	ОбщегоНазначенияБПВызовСервера.УстановитьЗначениеПоУмолчанию("ВариантРабочегоСтола", ВариантРабочегоСтола);
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзмененииНаКлиенте()
	
	ОбщегоНазначенияБПКлиент.ИзменитьОтборПоОсновнойОрганизации(СписокЗадач, , ОтборПоОрганизации(Организация));
	ОрганизацияПредставление = Организация;
	
	Если ЗапуститьОбновлениеДанныхТекущегоВариантаНаСервере() Тогда
		ЖдатьЗавершенияФоновогоЗадания();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПредставлениеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ОткрытьФорму("Справочник.Организации.ФормаОбъекта",  Новый Структура("Ключ", Организация), ЭтотОбъект, Организация);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗадачНачалаРаботы

&НаКлиенте
Процедура СписокЗадачНачалаРаботыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Задача = Элементы.СписокЗадачНачалаРаботы.ТекущиеДанные;
	Если Задача = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "СписокЗадачНачалаРаботыПравило" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ПараметрыКоманд = НовыеПараметрыКомандЗадачи();
		ЗаполнитьЗначенияСвойств(ПараметрыКоманд, Задача);
		
		СписокКоманд = СписокКомандЗадачи(ПараметрыКоманд, ТекущаяДата);
		Если СписокКоманд.НайтиПоЗначению("Выполнить") <> Неопределено Тогда
			ВыполнитьДействие(ПараметрыКоманд);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписокЗадачБухгалтера

&НаСервере
Процедура СписокЗадачПередЗагрузкойПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	ОбщегоНазначенияБП.ВосстановитьОтборСписка(СписокЗадач, Настройки, "Организация");
	
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачПередНачаломИзменения(Элемент, Отказ)
	
	Перем Задача;
	
	Отказ = Истина;
	
	Задача = Элементы.СписокЗадач.ТекущиеДанные;
	Если Задача = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыКоманды = НовыеПараметрыКомандЗадачи();
	ЗаполнитьЗначенияСвойств(ПараметрыКоманды, Задача);
	СписокКоманд = СписокКомандЗадачи(ПараметрыКоманды, ТекущаяДата);
	
	КоличествоКоманд = СписокКоманд.Количество();
	Если КоличествоКоманд = 1 Тогда
		СписокЗадачВыполнитьКоманду(СписокКоманд[0], ПараметрыКоманды);
	ИначеЕсли КоличествоКоманд > 1 Тогда
		ОповещениеВыбораИзМеню = Новый ОписаниеОповещения("СписокЗадачВыборЗначенияЗавершение", ЭтотОбъект, ПараметрыКоманды);
		ПоказатьВыборИзМеню(ОповещениеВыбораИзМеню, СписокКоманд, Элемент);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачВыборЗначенияЗавершение(Команда, ПараметрыКоманды) Экспорт
	
	СписокЗадачВыполнитьКоманду(Команда, ПараметрыКоманды);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовСтраницыМониторРуководителя

&НаКлиенте
Процедура ОстаткиДенежныхСредствНажатие(Элемент, СтандартнаяОбработка = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	Отборы = ОтборПоСтрокеДенежныхСредств(Элемент.Имя);
	ГруппировкаОтчета = СтандартныеГруппировкиДенежныхСредств();
	
	ОткрытьОтчет("Отчет.ОстаткиДенежныхСредств.Форма.ФормаОтчета",ГруппировкаОтчета, Отборы);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДенежныхСредствПоступлениеЗаголовокНажатие(Элемент)
	
	ГруппировкаОтчета = СтандартныеГруппировкиДенежныхСредств();
	
	ОткрытьОтчет("Отчет.ПоступленияДенежныхСредств.Форма.ФормаОтчета", ГруппировкаОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДенежныхСредствРасходЗаголовокНажатие(Элемент)
	
	ГруппировкаОтчета = СтандартныеГруппировкиДенежныхСредств();

	ОткрытьОтчет("Отчет.РасходыДенежныхСредств.Форма.ФормаОтчета", ГруппировкаОтчета);
	
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеДенежныхСредствЗаголовокНажатие(Элемент)
	
	ГруппировкаОтчета = СтандартныеГруппировкиДенежныхСредств();
	ГруппировкаОтчета.Добавить(Новый Структура("Поле, Представление, Использование, ТипГруппировки", "ВидДвижения", "Вид движения", Истина, 0));
	
	Показатели = Новый Массив;
	
	Показатели.Добавить("ПоказательПоступление");
	Показатели.Добавить("ПоказательРасход");
	
	ОткрытьОтчет("Отчет.АнализДвиженийДенежныхСредств.Форма.ФормаОтчета", ГруппировкаОтчета,,Показатели);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПоКонтрагентамЗаголовокНажатие(Элемент)
	
	ОткрытьОтчет("Отчет.Продажи.Форма.ФормаОтчета",,,,"ПродажиПоКонтрагентам");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПродажиПоКонтрагентамСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отборы = ОтборПоСтрокеПродажиПоКонтрагентам(Элемент.Имя);

	ОткрытьОтчет("Отчет.Продажи.Форма.ФормаОтчета",,Отборы,,"ПродажиПоНоменклатуре");
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажиПоНоменклатурнымГруппамЗаголовокНажатие(Элемент)
	
	ОткрытьОтчет("Отчет.Продажи.Форма.ФормаОтчета",,,,"ПродажиПоНоменклатурнымГруппам");
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурнаяГруппаПродажиПоНоменклатурнымГруппамСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отборы = ОтборПоСтрокеПродажиПоНоменклатурнымГруппам(Элемент.Имя);

	ОткрытьОтчет("Отчет.Продажи.Форма.ФормаОтчета",,Отборы,,"ПродажиПоНоменклатуре");
	
КонецПроцедуры

&НаКлиенте
Процедура НеоплаченныеСчетаПокупателейЗаголовокНажатие(Элемент)
	
	ОткрытьОтчет("Отчет.АнализНеоплаченныхСчетовПокупателям.Форма.ФормаОтчета", , , , "НеоплаченныеСчетаПокупателям");
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеНеоплаченногоСчетаСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИндексНеоплаченногоСчета = Число(Прав(Элемент.Имя, 1)) - 1;
	НеоплаченныйСчет = НеоплаченныеСчетаПокупателям[ИндексНеоплаченногоСчета].Ссылка;
	ПоказатьЗначение(, НеоплаченныйСчет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьПокупателейЗаголовокНажатие(Элемент)
	
	ОткрытьОтчет("Отчет.ЗадолженностьПокупателей.Форма.ФормаОтчета",,,,"ЗадолженностьПокупателей");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентЗадолженностьПокупателейСтрокаНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Отборы = ОтборПоКонтрагенту(Элемент.Имя);
	ОткрытьОтчет("Отчет.ЗадолженностьПокупателей.Форма.ФормаОтчета",,Отборы,,"ЗадолженностьПокупателейПоДоговорам");
	
КонецПроцедуры

&НаКлиенте
Процедура ПросроченнаяЗадолженностьПокупателейЗаголовокНажатие(Элемент)
	
	ОткрытьОтчет("Отчет.ЗадолженностьПокупателейПоСрокамДолга.Форма.ФормаОтчета",,,,"ЗадолженностьПокупателейПоСрокамДолга");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПросроченнаяЗадолженностьПокупателейСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отборы = ОтборПоКонтрагенту(Элемент.Имя);
	// Добавим группировку по договорам
	ГруппировкаОтчета = Новый Массив;
	ГруппировкаОтчета.Добавить(Новый Структура("Поле, Представление, Использование, ТипГруппировки", "Договор", "Договор", Истина, 0));
	
	ОткрытьОтчет("Отчет.ЗадолженностьПокупателейПоСрокамДолга.Форма.ФормаОтчета", ГруппировкаОтчета ,Отборы,,"ЗадолженностьПокупателейПоСрокамДолга");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьПоставщикамЗаголовокНажатие(Элемент)
	
	ОткрытьОтчет("Отчет.ЗадолженностьПоставщикам.Форма.ФормаОтчета",,,,"ЗадолженностьПоставщикам");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентЗадолженностьПоставщикамСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отборы = ОтборПоКонтрагенту(Элемент.Имя);
	
	ОткрытьОтчет("Отчет.ЗадолженностьПоставщикам.Форма.ФормаОтчета",,Отборы,,"ЗадолженностьПоставщикамПоДоговорам");
	
КонецПроцедуры

&НаКлиенте
Процедура ПросроченнаяЗадолженностьПоставщикамйЗаголовокНажатие(Элемент)
	
	ОткрытьОтчет("Отчет.ЗадолженностьПоставщикамПоСрокамДолга.Форма.ФормаОтчета",,,,"ЗадолженностьПоставщикамПоСрокамДолга");
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПросроченнаяЗадолженностьПоставщикамСтрокаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Отборы = ОтборПоКонтрагенту(Элемент.Имя);
	// Добавим группировку по договорам
	ГруппировкаОтчета = Новый Массив;
	ГруппировкаОтчета.Добавить(Новый Структура("Поле, Представление, Использование, ТипГруппировки", "Договор", "Договор", Истина, 0));
	
	ОткрытьОтчет("Отчет.ЗадолженностьПоставщикамПоСрокамДолга.Форма.ФормаОтчета", ГруппировкаОтчета ,Отборы,,"ЗадолженностьПоставщикамПоСрокамДолга");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыЗадачиБухгалтера

&НаКлиенте
Процедура ВыполненныеЗадачи(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Организация", Организация));
	
	ОткрытьФорму("РегистрСведений.ЗадачиБухгалтера.Форма.ВыполненныеЗадачи", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСпискаНалоговОтчетов(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация", Организация);
	
	ОткрытьФорму("РегистрСведений.НалогиОтчеты.Форма.Настройка", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура КалендарьНаИТС(Команда)
	
	ПерейтиПоНавигационнойСсылке(АдресНаИТС);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокЗадач(Команда)
	
	СписокЗадачАктуален = Ложь; // Пользователь явно указал на то, что список задач неактуален
	
	Если ЗапуститьОбновлениеДанныхТекущегоВариантаНаСервере() Тогда
	
		ЖдатьЗавершенияФоновогоЗадания();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормыМониторРуководителя

&НаКлиенте
Процедура ОбновитьМонитор(Команда)
	
	МониторАктуален = Ложь; // Пользователь явно указал на то, данные монитора неактуальны
	
	ОбновитьДанныеМонитора(Ложь);
	
	Если Не МониторАктуален Тогда
		УправлениеФормой(ЭтотОбъект);
	КонецЕсли;
	
	ЖдатьЗавершенияФоновогоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьМонитораРуководителя(Команда)
	
	// Собираем данные формы для печати текущего состояния
	ПараметрыПечатиМонитора = ПодготовитьПарараметрыПечатиМонитораНаСервере();
	
	// Передадим в параметры дату с точность до минуты
	// Дата будет отображаться в заголовке окна табличного документа
	ДатаОбновленияМонитораСтрокой = Формат(ДатаПоследнегоОбновленияМонитора, "ДФ='dd MMMM yyyy ""г."" H:mm'");
	
	ДополнителныеПараметрыПечати = Новый Структура();
	ДополнителныеПараметрыПечати.Вставить("ПечатнаяФормаМонитораПуть", ПараметрыПечатиМонитора.ПечатнаяФормаМонитораПуть);
	ДополнителныеПараметрыПечати.Вставить("ДатаФормированияМонитора",  ДатаОбновленияМонитораСтрокой);
	
	ПараметрыПечати = Новый Структура();
	ПараметрыПечати.Вставить("ЗаголовокФормы", НСтр("ru = 'Монитор руководителя '") + ДатаОбновленияМонитораСтрокой);
	ПараметрыПечати.Вставить("ДополнительныеПараметры", ДополнителныеПараметрыПечати);
	
	// Отдаем данные обработке печати
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("РегистрСведений.ДанныеМонитораРуководителя", "МониторРуководителя", ПараметрыПечатиМонитора.ОбъектыПечати,
		"МониторРуководителя", ПараметрыПечати);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки(Команда)
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьНастройкиЗавершение", ЭтотОбъект);

	ОткрытьФорму("ОбщаяФорма.НастройкаМонитораРуководителя" , , , , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииОбщие

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();


	// СписокЗадачОрганизация

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СписокЗадачОрганизация");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Организация", ВидСравненияКомпоновкиДанных.НеРавно, Справочники.Организации.ПустаяСсылка());

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Отображать", Ложь);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПозициюПоследнейПросроченнойЗаписи(СписокЗадач, ТекущаяДата, Организация)
	
	Если НЕ ЗначениеЗаполнено(СписокЗадач.ТекстЗапроса) Тогда
	
		Возврат Неопределено;
	
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	ОтборПоОрганизации = ОтборПоОрганизации(Организация);
	
	Если ОтборПоОрганизации <> Неопределено Тогда
	
		Запрос.УстановитьПараметр("Организация", ОтборПоОрганизации);
	
	Иначе
		// Если организация недоступна, или не выбрана, то устанавливаем в отбор массив организаций доступных текущему пользователю с учетом RLS
		Запрос.УстановитьПараметр("Организация", ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь));
	
	КонецЕсли; 
	
	// Текст запроса аналогичен тому, который выполняется в динамическом списке СписокЗадач,
	// кроме неиспользуемых для позиционирования полей и таблиц.
	// Порядок полей упорядочивается также совпадает с настройками динамического списка.
	// При изменении запроса в списке необходимо вносить симметричные изменения.
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗадачиБухгалтера.Организация КАК Организация,
	|	ЕСТЬNULL(Организации.Наименование, """") КАК ОрганизацияНаименование,
	|	ЗадачиБухгалтера.РегистрацияВНалоговомОргане,
	|	ЗадачиБухгалтера.ПериодСобытия,
	|	ЗадачиБухгалтера.Правило,
	|	ЕСТЬNULL(Требования.Владелец.РеквизитДопУпорядочивания, 0) КАК РегулярнаяЗадачаПорядок,
	|	ЕСТЬNULL(Требования.Действие.Порядок, 0) КАК ДействиеПорядок,
	|	ЕСТЬNULL(Требования.РеквизитДопУпорядочивания, 0) КАК ПравилоПорядок,
	|	ЗадачиБухгалтера.Срок,
	|	ЗадачиБухгалтера.Наименование КАК Наименование
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ПравилаПредставленияОтчетовУплатыНалогов КАК Требования
	|		ПО ЗадачиБухгалтера.Правило = Требования.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ЗадачиБухгалтера.Организация = Организации.Ссылка
	|ГДЕ
	|	НЕ ЗадачиБухгалтера.Выполнено
	|	И ЗадачиБухгалтера.Срок >= &ТекущаяДата
	|	И НЕ ЗадачиБухгалтера.Правило ССЫЛКА Перечисление.ЗадачиНачалаРаботы
	|	И ЗадачиБухгалтера.Организация В(&Организация)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЗадачиБухгалтера.Срок,
	|	ДействиеПорядок,
	|	ЗадачиБухгалтера.ПериодСобытия,
	|	РегулярнаяЗадачаПорядок,
	|	ПравилоПорядок,
	|	Наименование,
	|	ОрганизацияНаименование";
	
	// Выполняем запрос в привелегированном режиме для увеличения скорости за счет отключения RLS
	// При этом ограничение доступа к данным выполняем в процессе установки параметра "Организация"
	УстановитьПривилегированныйРежим(Истина);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
	
		ЗначенияКлюча = ОбщегоНазначенияБПВызовСервера.ПолучитьСтруктуруИзРезультатаЗапроса(Результат);
		
		Возврат РегистрыСведений.ЗадачиБухгалтера.СоздатьКлючЗаписи(ЗначенияКлюча);
		
	Иначе
		
		Возврат Неопределено;
	
	КонецЕсли; 

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	
	Если Форма.ВариантРабочегоСтола = "ЗадачиБухгалтера" Тогда
		
		// Скрываем страницу монитора для устранения полосы прокрутки формы
		Элементы.СтраницаМониторРуководителя.Видимость = Ложь;
		
		ВидимостьШапки = (Форма.СписокЗадачНачалаРаботы.Количество() = 0);
		Элементы.Организация.Видимость              = ВидимостьШапки;
		Элементы.ОрганизацияПредставление.Видимость = ВидимостьШапки;
		Элементы.ВариантРабочегоСтола.Видимость     = ВидимостьШапки;
		Элементы.СтраницыКомандныеПанели.Видимость  = ВидимостьШапки;
		
		Если Форма.СписокЗадачНачалаРаботы.Количество() > 0 Тогда
			
			Элементы.СтраницыКомандныеПанели.ТекущаяСтраница = Элементы.СтраницаКоманднаяПанельЗадачНачалаРаботы;
			
			// Показываем обязательные задачи начала работы
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаНачалоРаботы;
			
		ИначеЕсли Не Форма.СписокЗадачАктуален Тогда
			
			Элементы.СтраницыКомандныеПанели.ТекущаяСтраница = Элементы.СтраницаКоманднаяПанельЗадачБухгалтера;
			
			// Показываем индикатор ожидания заполнения списка задач
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
			
		ИначеЕсли Форма.СписокЗадачПустой Тогда
			
			Элементы.СтраницыКомандныеПанели.ТекущаяСтраница = Элементы.СтраницаКоманднаяПанельЗадачБухгалтера;
			
			// Все задачи выполнены
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВсеЗадачиВыполнены;
			Если ЗначениеЗаполнено(Форма.ДатаПоявленияЗадач) Тогда
				Элементы.НовыеЗадачиПоявятся.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = 'Новые задачи появятся %1.'"), Формат(Форма.ДатаПоявленияЗадач, НСтр("ru = 'ДФ=''dd MMMM'''")));
			Иначе
				Элементы.НовыеЗадачиПоявятся.Заголовок = "";
			КонецЕсли;
			
		Иначе
			
			Элементы.СтраницыКомандныеПанели.ТекущаяСтраница = Элементы.СтраницаКоманднаяПанельЗадачБухгалтера;
			
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаЗадачиБухгалтера;
			
			Если НЕ Форма.ФоновоеЗаданиеЗадачБухгалтераЗапущено Тогда
				КлючЗаписи = ПолучитьПозициюПоследнейПросроченнойЗаписи(
					Форма.СписокЗадач, 
					Форма.ТекущаяДата, 
					Форма.Организация);
				Если ЗначениеЗаполнено(КлючЗаписи) И НЕ КлючЗаписи.Пустой()  Тогда
				
					Элементы.СписокЗадач.ТекущаяСтрока = КлючЗаписи;
				
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли Форма.ВариантРабочегоСтола = "МониторРуководителя" Тогда
		
		Если Не Форма.МониторАктуален Тогда
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаОжидание;
		Иначе
			Элементы.СтраницаМониторРуководителя.Видимость = Истина;
			Элементы.СтраницыКомандныеПанели.ТекущаяСтраница = Элементы.СтраницаКоманднаяПанельМонитораРуководителя;
			Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаМониторРуководителя;
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапуститьОбновлениеРабочегоСтолаПриОткрытии()
	
	Если ЗапуститьОбновлениеДанныхТекущегоВариантаНаСервере(Истина) Тогда
	
		ЖдатьЗавершенияФоновогоЗадания();
		
	Иначе
		
		// Попробуем обновить позже
		ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьОбновлениеРабочегоСтолаПриОткрытии", 16, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ЗапуститьОбновлениеРабочегоСтола()
	
	Если ЗапуститьОбновлениеДанныхТекущегоВариантаНаСервере(Истина) Тогда
	
		ЖдатьЗавершенияФоновогоЗадания();
		
	КонецЕсли;
	
	// Интервал следующего обновления рабочего стола рассчитан в ОбновитьТекущуюДатуЗаголовокФормыНаСервере()
	ПодключитьОбработчикОжидания("Подключаемый_ЗапуститьОбновлениеРабочегоСтола", ИнтервалОбновления, Истина);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьОбновлениеДанныхТекущегоВариантаНаСервере(ОбновитьИЗаполнитьЗадачиНачалаРаботы = Ложь)
	
	Если МонопольныйРежим() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ВариантРабочегоСтола = "ЗадачиБухгалтера" Тогда
		ЗаполнитьСписокЗадачБухгалтераНаСервере(ОбновитьИЗаполнитьЗадачиНачалаРаботы);
	Иначе
		ОбновитьДанныеМонитора();
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Процедура ОбновитьТекущуюДатуЗаголовокФормыНаСервере()
	
	ДатаСеанса = ТекущаяДатаСеанса();
	
	ИнтервалОбновления = (КонецДня(ДатаСеанса) + 1) - ДатаСеанса + 59;
	
	ТекущаяДата = ДатаСеанса;
	
	Если СписокЗадачНачалаРаботы.Количество() = 0 Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Сегодня: %1'"),
			Формат(ТекущаяДата, "Л=ru_RU; ДФ='d MMMM, dddd'"));
	Иначе
		Заголовок = "";
	КонецЕсли;
	
	СписокЗадач.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииЗадачБухгалтера

&НаСервере
Функция НастройкиОформленияСпискаЗадач()
	
	НастройкиКомпоновкиДанных = Новый НастройкиКомпоновкиДанных;
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		Неопределено, -1, НСтр("ru = 'Просрочено'"), ЦветаСтиля.ВажноеСобытие);
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		0, 0, НСтр("ru = 'Сегодня'"), ЦветаСтиля.ВажноеСобытие);
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		1, 1, НСтр("ru = 'Завтра'"), ЦветаСтиля.ПриближающеесяСобытие);
	
	Шаблон = НСтр("ru = 'Осталось %1'");
	
	Для РазностьДат = 2 По 6 Цикл
		СтрокаРазностьДат = СтроковыеФункцииКлиентСервер.ЧислоЦифрамиПредметИсчисленияПрописью(
			РазностьДат, НСтр("ru = 'день,дня,дней'"));
		ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
			РазностьДат, РазностьДат, СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, СтрокаРазностьДат));
	КонецЦикла;
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		7, 13, НСтр("ru = 'Осталась неделя'"));
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		14, 18, НСтр("ru = 'Осталось 2 недели'"));
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		19, 22, НСтр("ru = 'Осталось 3 недели'"));
	
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		23, 34, НСтр("ru = 'Остался месяц'"));
	
	// Используем пробел в качестве представления пустой строки, т.к. пустая строка в условном оформлении игнорируется
	ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных,
		35, Неопределено, " ");
	
	Возврат НастройкиКомпоновкиДанных;
	
КонецФункции

&НаСервере
Процедура ДобавитьЭлементУсловногоОформленияСпискаЗадач(НастройкиКомпоновкиДанных, НижняяГраница, ВерхняяГраница, Текст, ЦветТекста = Неопределено)
	
	ПутьКДаннымПоля = "ОсталосьДней";
	
	ЭлементУсловногоОформления = НастройкиКомпоновкиДанных.УсловноеОформление.Элементы.Добавить();
	
	Если ЦветТекста <> Неопределено Тогда
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветТекста);
	КонецЕсли;
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Текст", Текст);
	
	Если НижняяГраница = Неопределено Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ВерхняяГраница;
		
	ИначеЕсли ВерхняяГраница = Неопределено Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
	ИначеЕсли НижняяГраница = ВерхняяГраница Тогда
		
		ЭлементОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
	Иначе
		
		ГруппаЭлементовОтбора = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
		ГруппаЭлементовОтбора.Использование = Истина;
		ГруппаЭлементовОтбора.ТипГруппы     = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = НижняяГраница;
		
		ЭлементОтбора = ГруппаЭлементовОтбора.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.Использование  = Истина;
		ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
		ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.МеньшеИлиРавно;
		ЭлементОтбора.ПравоеЗначение = ВерхняяГраница;
		
	КонецЕсли;
	
	ЭлементПоля = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ЭлементПоля.Использование = Истина;
	ЭлементПоля.Поле          = Новый ПолеКомпоновкиДанных(ПутьКДаннымПоля);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтборПоОрганизации(Знач Организация)
	
	СписокДоступныхОрганизаций = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
	
	Если ЗначениеЗаполнено(Организация) И Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ОбособленноеПодразделение") Тогда
		// Добавляем пустую ссылку для отображения общих задач, но только для головных организаций
		ОтборПоОрганизации = Новый СписокЗначений;
		Если СписокДоступныхОрганизаций.Найти(Организация) <> Неопределено Тогда
			ОтборПоОрганизации.Добавить(Организация);
		КонецЕсли;
		ОтборПоОрганизации.Добавить(Справочники.Организации.ПустаяСсылка());
	Иначе
		Если СписокДоступныхОрганизаций.Найти(Организация) <> Неопределено Тогда
			ОтборПоОрганизации = Организация;
		Иначе
			ОтборПоОрганизации = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ОтборПоОрганизации;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокЗадачПустой(Знач Организация, ДатаПоявленияЗадач)
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса = // Текст запроса может быть модифицирован ниже - добавится условие на организацию
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ЗадачиБухгалтера.Организация
	|ИЗ
	|	РегистрСведений.ЗадачиБухгалтера КАК ЗадачиБухгалтера
	|ГДЕ
	|	НЕ ЗадачиБухгалтера.Выполнено";
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
		|	И ЗадачиБухгалтера.Организация В(&Организации)";
		
		Запрос.УстановитьПараметр("Организации", ОтборПоОрганизации(Организация));
		
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	
	СписокЗадачПустой = Запрос.Выполнить().Пустой();
	
	Если СписокЗадачПустой Тогда
		ДатаПоявленияЗадач = РегистрыСведений.ЗадачиБухгалтера.БлижайшаяДатаПоявленияЗадач(Организация);
	Иначе
		ДатаПоявленияЗадач = '00010101';
	КонецЕсли;
	
	Возврат СписокЗадачПустой;
	
КонецФункции

&НаКлиенте
Функция НовыеПараметрыКомандЗадачи()
	
	ПараметрыКоманд = Новый Структура;
	ПараметрыКоманд.Вставить("Задача",                      Неопределено);
	ПараметрыКоманд.Вставить("ИдентификаторЗадачи",         "");
	ПараметрыКоманд.Вставить("Организация",                 Неопределено);
	ПараметрыКоманд.Вставить("РегистрацияВНалоговомОргане", Неопределено);
	ПараметрыКоманд.Вставить("Срок",                        '00010101');
	ПараметрыКоманд.Вставить("НачалоВыполнения",            '00010101');
	ПараметрыКоманд.Вставить("Правило",                     Неопределено);
	ПараметрыКоманд.Вставить("ИдентификаторПравила",        "");
	ПараметрыКоманд.Вставить("ПериодСобытия",               '00010101');
	ПараметрыКоманд.Вставить("Периодичность",               Неопределено); 
	ПараметрыКоманд.Вставить("Наименование",                "");
	ПараметрыКоманд.Вставить("Действие",                    Неопределено);
	ПараметрыКоманд.Вставить("ЕстьИнформацияНаИТС",         Ложь);
	ПараметрыКоманд.Вставить("АдресНаИТС",                  АдресНаИТС); // Адрес по умолчанию
	ПараметрыКоманд.Вставить("СпособОплаты",                Неопределено);
	
	Возврат ПараметрыКоманд;
	
КонецФункции

&НаСервереБезКонтекста
Функция СписокКомандЗадачи(ПараметрыКоманд, Знач ТекущаяДата)
	
	СписокКоманд = Новый СписокЗначений;
	
	Если КалендарьБухгалтера.ПравоВыполненияЗадачи(ПараметрыКоманд.Правило) Тогда
	
		Если ПараметрыКоманд.Действие = Перечисления.ВидыДействийКалендаряБухгалтера.Отчет Тогда
		
			СписокКоманд.Добавить("ПодготовитьОтчет", 
				НСтр("ru = 'Подготовить отчет'"), , 
				БиблиотекаКартинок.РегламентированныйОтчет);
		
		ИначеЕсли ПараметрыКоманд.Действие = Перечисления.ВидыДействийКалендаряБухгалтера.УплатаНалога Тогда
		
			ЭтоЮрЛицо = ОбщегоНазначенияБПВызовСервераПовтИсп.ЭтоЮрЛицо(ПараметрыКоманд.Организация);
			Если ЭтоЮрЛицо Тогда
				СписокКоманд.Добавить("Оплатить", 
					НСтр("ru = 'Оплатить'"), , 
					БиблиотекаКартинок.ЗадачаУплатаНалога);
			Иначе
				Если Справочники.БанковскиеСчета.ПолучитьКоличествоПодчиненныхЭлементовПоВладельцу(ПараметрыКоманд.Организация) > 0 Тогда
					СписокКоманд.Добавить("Оплатить", 
						НСтр("ru = 'Оплатить с банковского счета'"), , 
						БиблиотекаКартинок.ЗадачаУплатаНалога);
				КонецЕсли;
					
				СписокКоманд.Добавить("ОплатитьНаличными", 
					НСтр("ru = 'Оплатить наличными по квитанции'"), , 
					БиблиотекаКартинок.ЗадачаУплатаНалога);
			КонецЕсли;
		
		ИначеЕсли ТипЗнч(ПараметрыКоманд.Правило) = Тип("СправочникСсылка.ПравилаРегулярныхПлатежей") Тогда
		
			СписокКоманд.Добавить("Оплатить", 
				НСтр("ru = 'Оплатить'"), , 
				БиблиотекаКартинок.ЗадачаУплатаНалога);
		
		Иначе // Начало работы
		
			СписокКоманд.Добавить("Выполнить", 
				Перечисления.ЗадачиНачалаРаботы.ПредставлениеКомандыВыполнить(ПараметрыКоманд.Правило), ,
				БиблиотекаКартинок.ЗадачаНачалаРаботы);
				
		КонецЕсли;
			
		НеизбежныеЗадачиНачалаРаботы = Перечисления.ЗадачиНачалаРаботы.НельзяИзбежать();
		ЗадачаИсчезаетИзСпискаАвтоматически = (НеизбежныеЗадачиНачалаРаботы.Найти(ПараметрыКоманд.Правило) <> Неопределено);
		Если Не ЗадачаИсчезаетИзСпискаАвтоматически 
			И КалендарьБухгалтера.ПравоВыполненияЗадачи(РегистрыСведений.ЗадачиБухгалтера.ПустойКлюч()) Тогда
			СписокКоманд.Добавить(
				"ОтметитьЗадачуКакВыполненную", НСтр("ru = 'Отметить задачу как выполненную'"), , БиблиотекаКартинок.ОтметитьЗадачуКакВыполненную);
		КонецЕсли;
			
		Если ПараметрыКоманд.Срок >= ТекущаяДата 
			И ТипЗнч(ПараметрыКоманд.Правило) = Тип("СправочникСсылка.ПравилаРегулярныхПлатежей") Тогда
		
			СписокКоманд.Добавить("ПрекратитьВыполнение",
				НСтр("ru = 'Больше не напоминать'"));
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыКоманд.ЕстьИнформацияНаИТС Тогда
		
		АдресНаИТС = ЗадачиБухгалтераКлиентСервер.СсылкаНаИТС(ПараметрыКоманд.Срок, ПараметрыКоманд.ИдентификаторЗадачи, ПараметрыКоманд.ИдентификаторПравила);
		Если Не ПустаяСтрока(АдресНаИТС) Тогда
			СписокКоманд.Добавить("ПодробнееНаИТС", НСтр("ru = 'Узнать подробнее на сайте ИТС'"), , БиблиотекаКартинок.ПерейтиНаИТС);
			ПараметрыКоманд.АдресНаИТС = АдресНаИТС;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СписокКоманд;
	
КонецФункции

&НаКлиенте
Процедура СписокЗадачВыполнитьКоманду(Команда, ПараметрыКоманды) Экспорт
	
	Если Команда = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Команда.Значение = "ПодробнееНаИТС" Тогда
		ПерейтиПоНавигационнойСсылке(ПараметрыКоманды.АдресНаИТС);
	ИначеЕсли Команда.Значение = "ОтметитьЗадачуКакВыполненную" Тогда
		ОтметитьЗадачуКакВыполненную(ПараметрыКоманды);
	ИначеЕсли Команда.Значение = "ПрекратитьВыполнение" Тогда
		ПрекратитьВыполнение(ПараметрыКоманды);
	Иначе
		Если Команда.Значение = "Оплатить" Тогда
			ПараметрыКоманды.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.БанковскийПеревод");
		ИначеЕсли Команда.Значение = "ОплатитьНаличными" Тогда
			ПараметрыКоманды.СпособОплаты = ПредопределенноеЗначение("Перечисление.СпособыУплатыНалогов.НаличнымиПоКвитанции");
		КонецЕсли;
		ВыполнитьДействие(ПараметрыКоманды);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьЗадачуКакВыполненную(ПараметрыКоманды)
	
	КлючЗаписи = ПеренестиВАрхив(ПараметрыКоманды);
	
	Если ТипЗнч(КлючЗаписи) = Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера") Тогда
		
		ТипПравила = ТипЗнч(ПараметрыКоманды.Правило);
		
		Если ТипПравила = Тип("СправочникСсылка.ПравилаПредставленияОтчетовУплатыНалогов") Тогда
			
			// Подробно расскажем, что и куда перемещено
			ОбщегоНазначенияБПКлиент.ПоказатьПредупреждениеОбИзменениях(
				"ЗадачаБухгалтераПомещенаВСписокВыполненных",
				ЭтаФорма,
				НастройкиПредупрежденийОбИзменениях);
				
			ПоказатьОповещениеПользователя(
				, // Без заголовка
				"e1cib/app/РегистрСведений.ЗадачиБухгалтера.Форма.ВыполненныеЗадачи",
				НСтр("ru = 'Задача помещена в список выполненных'"));
			
		ИначеЕсли ТипПравила = Тип("ПеречислениеСсылка.ЗадачиНачалаРаботы") Тогда
			
			// Подробно расскажем, что и куда перемещено
			ИдентификаторОписания = "";
			Если ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.НачальныеОстатки") 
				Или ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.ПараметрыУчета")
			    Или ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.УчетнаяПолитика") Тогда
				ИдентификаторОписания = "ВыполненаЗадачаПараметрыУчета";
			ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.СписокНалоговОтчетов") Тогда
				ИдентификаторОписания = "ВыполненаЗадачаСписокНалоговОтчетов";
			ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.НастройкаЗаполненияФормСтатистики") Тогда
				ИдентификаторОписания = "ВыполненаЗадачаНастройкаЗаполненияФормСтатистики";
			КонецЕсли;
			
			Если Не ПустаяСтрока(ИдентификаторОписания) Тогда
				ОбщегоНазначенияБПКлиент.ПоказатьПредупреждениеОбИзменениях(
					ИдентификаторОписания,
					ЭтаФорма,
					НастройкиПредупрежденийОбИзменениях);
			КонецЕсли;
			
		КонецЕсли;
		
		ОповеститьОбИзменении(КлючЗаписи);
		
	КонецЕсли;
	
	// Возможно, выполненная задача была последней на сегодня
	СписокЗадачПустой = СписокЗадачПустой(Организация, ДатаПоявленияЗадач);
	Если СписокЗадачПустой Тогда
		УправлениеФормой(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПеренестиВАрхив(Знач ПараметрыКоманды)
	
	КлючЗаписи = РегистрыСведений.ЗадачиБухгалтера.УстановитьСтатусВыполнено(ПараметрыКоманды);
	ИсторияРаботыПользователя.Добавить(КлючЗаписи);
	
	Возврат КлючЗаписи; // Для оповещения форм и пользователя
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьДействие(ПараметрыКоманды)
	
	ОписаниеДействия = ЗадачиБухгалтераКлиентСервер.ОписаниеДействия(ПараметрыКоманды);
	
	ВыполнениеЗадачБухгалтераКлиент.ВыполнитьДействие(ОписаниеДействия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПрекратитьВыполнение(ПараметрыКоманды)

	Если ПрекратитьВыполнениеНаСервере(ПараметрыКоманды.Организация, ПараметрыКоманды.Правило) Тогда
	
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера"));
	
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрекратитьВыполнениеНаСервере(Организация, Правило)
	
	Если ЗначениеЗаполнено(Правило) Тогда
	
		ПравилоОбъект = Правило.ПолучитьОбъект();
		ПравилоОбъект.Выполняется = Ложь;
		ПравилоОбъект.Записать();
		
		Возврат РегистрыСведений.ЗадачиБухгалтера.УдалитьЗаписиПоПравилу(Организация, Правило);
		
	Иначе
		
		Возврат Ложь;
	
	КонецЕсли; 
	
КонецФункции

&НаСервере
Процедура ЗаполнитьСписокЗадачБухгалтераНаСервереЗавершение()

	Элементы.СписокЗадач.Обновить();
	СписокЗадачАктуален = Истина;
	СписокЗадачПустой   = СписокЗадачПустой(Организация, ДатаПоявленияЗадач);
	УправлениеФормой(ЭтаФорма);

КонецПроцедуры 

&НаСервере
// Запускает фоновое задание обновления регистра Задачи бухгалтера.
//
Процедура ЗаполнитьСписокЗадачБухгалтераНаСервере(ОбновитьИЗаполнитьЗадачиНачалаРаботы = Ложь, ОбновитьИЗаполнитьРегулярныеПлатежи = Ложь)
	
	ЗаполнитьСписокЗадачНачалаРаботыНаСервере();
	Если СписокЗадачНачалаРаботы.Количество() > 0 Тогда
		// Не выполнены обязательные задачи начала работы
		УправлениеФормой(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	Если НачалоДня(ТекущаяДата) <> НачалоДня(ТекущаяДатаСеанса()) Или ПустаяСтрока(Заголовок) Тогда
		ОбновитьТекущуюДатуЗаголовокФормыНаСервере();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		СписокДоступныхОрганизаций = ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS(Ложь);
		Если СписокДоступныхОрганизаций.Найти(Организация) = Неопределено Тогда
			// Все равно нет прав
			ЗаполнитьСписокЗадачБухгалтераНаСервереЗавершение();
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ОбновитьИЗаполнитьРегулярныеЗадачи = Истина;
	
	// Измение правил регулярных платежей - основание для актуализации списка задач бухгалтера.
	// В этом случае контроль актуальности списка задач бухгалтера не производим.
	Если СписокЗадачАктуален И НЕ ОбновитьИЗаполнитьРегулярныеПлатежи Тогда
		
		// Проверим актуальность
		Упреждение = КалендарьБухгалтера.УпреждениеЗаполненияСписка() * 24 * 60 * 60;
		
		ДатаАктуальности = РегистрыСведений.АктуальностьСпискаЗадачБухгалтера.ДатаАктуальности(Организация);
		СписокЗадачАктуален = (ТекущаяДата < ДатаАктуальности);
		
		Если СписокЗадачАктуален И ТекущаяДата + Упреждение <= ДатаАктуальности Тогда
			// Перезаполнение списка задач не требуется
			ОбновитьИЗаполнитьРегулярныеЗадачи = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ОбновитьИЗаполнитьЗадачиНачалаРаботы И Не ОбновитьИЗаполнитьРегулярныеЗадачи Тогда
		// Нечего обновлять
		Элементы.СписокЗадач.Обновить();
		СписокЗадачАктуален = Истина;
		СписокЗадачПустой   = СписокЗадачПустой(Организация, ДатаПоявленияЗадач);
		УправлениеФормой(ЭтаФорма);
		Возврат;
	КонецЕсли;
	
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыФункции = Новый Структура();
	ПараметрыФункции.Вставить("Организация", Организация);
	ПараметрыФункции.Вставить("Упреждение",  КалендарьБухгалтера.УпреждениеЗаполненияСписка());
	ПараметрыФункции.Вставить("ОбновитьИЗаполнитьЗадачиНачалаРаботы", ОбновитьИЗаполнитьЗадачиНачалаРаботы);
	ПараметрыФункции.Вставить("ОбновитьИЗаполнитьРегулярныеЗадачи",   ОбновитьИЗаполнитьРегулярныеЗадачи);
	
	// Возможно, что фоновое задание было запущено раньше, 
	// пользователь дал команду его отменить, однако задание не отменено.
	// В таком случае не следует запускать задание повторно - следует дождаться его выполнения.
	// Мы можем отследить ситуацию только, если все это происходит в одной форме.
	// Потому что подсистема ДлительныеОперации не умеет устанавливать ключ фонового задания.
	Если ФоновоеЗаданиеЗадачБухгалтераЗапущено И ЗакрытиеМесяца.ЗаданиеЕщеВыполняется(ФоновоеЗаданиеЗадачБухгалтераИдентификатор) Тогда
		// Надо ждать
		Возврат;
	КонецЕсли;
	
	НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление списка задач бухгалтера'");
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"КалендарьБухгалтера.ЗаполнитьВФоне", 
		ПараметрыФункции, 
		НаименованиеФоновогоЗадания);
	
	ФоновоеЗаданиеЗадачБухгалтераАдресРезультата = Результат.АдресХранилища;
	ФоновоеЗаданиеЗадачБухгалтераИдентификатор   = Результат.ИдентификаторЗадания;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ЗаполнитьСписокЗадачБухгалтераНаСервереЗавершение();
	Иначе
		// Начнем ждать
		ФоновоеЗаданиеЗадачБухгалтераЗапущено = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокЗадачНачалаРаботыНаСервере()
	
	ОбязательныеЗадачиНачалаРаботы = Перечисления.ЗадачиНачалаРаботы.ОбязательныеЗадачиНачалаРаботы();
	СписокЗадачНачалаРаботы.Очистить();
	Для Каждого Задача Из ОбязательныеЗадачиНачалаРаботы Цикл
		НоваяСтрока = СписокЗадачНачалаРаботы.Добавить();
		НоваяСтрока.Правило = Задача;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЖдатьЗавершенияФоновогоЗадания()
	
	Если ФоновоеЗаданиеЗадачБухгалтераЗапущено ИЛИ ФоновоеЗаданиеМонитораЗапущено Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьЗавершениеДлительнойОперации",
			ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьЗавершениеДлительнойОперации()
	
	Если ФоновоеЗаданиеЗадачБухгалтераЗапущено Тогда
		
		Если ЗаданиеВыполнено(ФоновоеЗаданиеЗадачБухгалтераИдентификатор) Тогда
			
			ФоновоеЗаданиеЗадачБухгалтераЗапущено = Ложь;
			ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.ЗадачиБухгалтера"));
			СписокЗадачАктуален = Истина;
			СписокЗадачПустой   = СписокЗадачПустой(Организация, ДатаПоявленияЗадач);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФоновоеЗаданиеМонитораЗапущено Тогда
		
		Если ЗаданиеВыполнено(ФоновоеЗаданиеМонитораИдентификатор) Тогда
			ФоновоеЗаданиеМонитораЗапущено = Ложь;
			МониторАктуален = Истина;
			ОбновитьМониторНаСервере();
		КонецЕсли;
		
	КонецЕсли;
	
	Если ФоновоеЗаданиеЗадачБухгалтераЗапущено Или ФоновоеЗаданиеМонитораЗапущено Тогда
		// Продолжим ожидание
		ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания(
			"Подключаемый_ПроверитьЗавершениеДлительнойОперации",
			ПараметрыОбработчикаОжидания.ТекущийИнтервал,
			Истина);
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(Знач ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункцииМониторРуководителя

&НаКлиенте
Процедура ОткрытьНастройкиЗавершение(Результат, Параметры) Экспорт
	
	// Если настройки не были изменены - ничего не делаем
	Если Результат <> Истина Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьМониторНаСервере();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьМониторНаСервере()
	
	Если НачалоДня(ТекущаяДата) <> НачалоДня(ТекущаяДатаСеанса()) Или ПустаяСтрока(Заголовок) Тогда
		ОбновитьТекущуюДатуЗаголовокФормыНаСервере();
	КонецЕсли;
	
	СписокРазделов = ХранилищеОбщихНастроек.Загрузить("МониторРуководителя", "СписокРазделовМонитораРуководителя");
	Если СписокРазделов = Неопределено Тогда
		СписокРазделов = МониторРуководителя.СтандартныйСписокРазделовМонитораРуководителя();
	КонецЕсли;
	
	Если БухгалтерскийУчетВызовСервераПовтИсп.ИспользоватьОднуНоменклатурнуюГруппу() Тогда
		НайденныйЭлемент = СписокРазделов.НайтиПоЗначению(Перечисления.РазделыМонитораРуководителя.ПродажиПоНоменклатурнымГруппам);
		Если НайденныйЭлемент <> Неопределено Тогда
			СписокРазделов.Удалить(НайденныйЭлемент);
		КонецЕсли;
	КонецЕсли;
	
	ВариантОкругленияИзНастроек = ХранилищеОбщихНастроек.Загрузить("МониторРуководителя", "ВариантОкругленияМонитораРуководителя");
	
	Если ВариантОкругленияИзНастроек = Неопределено Тогда
		// По умолчанию до целых рублей
		ВариантОкругления = 1;
	Иначе
		// Нельзя допустить 0
		ВариантОкругления = Макс(ВариантОкругленияИзНастроек, 1);
	КонецЕсли;
	
	ОбновитьЗаголовкиПериодов(ЭтотОбъект);
	
	ДанныеРазделовМонитора = МониторРуководителя.ПолучитьДанныеРазделовМонитора(Организация, СписокРазделов.ВыгрузитьЗначения(), ВариантОкругления);
	
	Если ДанныеРазделовМонитора <> Неопределено Тогда
		
		Для Каждого РазделМонитора Из СписокРазделов Цикл
			ИмяРазделаМонитора = ОбщегоНазначения.ИмяЗначенияПеречисления(РазделМонитора.Значение);
			Если РазделМонитора.Пометка Тогда
				ЗаполнитьРазделМонитора(РазделМонитора.Значение, ДанныеРазделовМонитора[СписокРазделов.Индекс(РазделМонитора)]);
			КонецЕсли;
			Элементы[ИмяРазделаМонитора].Видимость = РазделМонитора.Пометка;
			Элементы.Переместить(Элементы[ИмяРазделаМонитора], Элементы["СтрокаМонитора_" + СписокРазделов.Индекс(РазделМонитора)]);
		КонецЦикла;
		
	КонецЕсли;
	
	СтандартныйСписокРазделов = МониторРуководителя.СтандартныйСписокРазделовМонитораРуководителя();
	Для Каждого РазделМонитора Из СтандартныйСписокРазделов Цикл
		Если СписокРазделов.НайтиПоЗначению(РазделМонитора.Значение) = Неопределено Тогда
			ИмяРазделаМонитора = ОбщегоНазначения.ИмяЗначенияПеречисления(РазделМонитора.Значение);
			Элементы[ИмяРазделаМонитора].Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ДатаПоследнегоОбновленияМонитора = МониторРуководителя.ПолучитьДатуПоследнегоОбновленияМонитора(Организация);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделМонитора(РазделМонитора, ДанныеРаздела)
	
	Если РазделМонитора = Перечисления.РазделыМонитораРуководителя.ОстаткиДенежныхСредств Тогда
		ЗаполнитьОстаткиДенежныхСредств(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.ДвижениеДенежныхСредств Тогда
		ЗаполнитьДвижениеДенежныхСредств(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.ПродажиПоКонтрагентам Тогда
		ЗаполнитьПродажиПоКонтрагентам(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.ПродажиПоНоменклатурнымГруппам Тогда
		ЗаполнитьПродажиПоНоменклатурнымГруппам(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.ЗадолженностьПокупателей Тогда
		ЗаполнитьЗадолженностьПокупателей(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.ПросроченнаяЗадолженностьПокупателей Тогда
		ЗаполнитьПросроченнуюЗадолженностьПокупателей(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.ЗадолженностьПоставщикам Тогда
		ЗаполнитьЗадолженностьПоставщикам(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.ПросроченнаяЗадолженностьПоставщикам Тогда
		ЗаполнитьПросроченнуюЗадолженностьПоставщикам(ДанныеРаздела);
	ИначеЕсли РазделМонитора = Перечисления.РазделыМонитораРуководителя.НеоплаченныеСчетаПокупателям Тогда
		ЗаполнитьНеоплаченныеСчетаПокупателям(ДанныеРаздела);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеМонитора(СУчетомАктуальности = Истина)
	
	
	// Возможно, что фоновое задание было запущено раньше, 
	// пользователь дал команду его отменить, однако задание не отменено.
	// В таком случае не следует запускать задание повторно - следует дождаться его выполнения.
	// Мы можем отследить ситуацию только, если все это происходит в одной форме.
	// Потому что подсистема ДлительныеОперации не умеет устанавливать ключ фонового задания.
	Если ФоновоеЗаданиеМонитораЗапущено И ЗакрытиеМесяца.ЗаданиеЕщеВыполняется(ФоновоеЗаданиеМонитораИдентификатор) Тогда
		// Надо ждать
		Возврат;
	КонецЕсли;
	
	// Параметры обернем в структуру для их передачи через механизм ДлительныеОперации.
	ПараметрыФункции = Новый Структура();
	
	ПараметрыФункции.Вставить("Организация", Организация);
	
	Если СУчетомАктуальности Тогда
		ИмяПроцедуры = "ОбновитьДанныеМонитораВФоне";
	Иначе
		ИмяПроцедуры = "ПерезаписатьДанныеМонитораВФоне";
	КонецЕсли;	
	
	НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление данных монитора руководителя'");
	Результат = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
	УникальныйИдентификатор,
	"МониторРуководителя." + ИмяПроцедуры, 
	ПараметрыФункции, 
	НаименованиеФоновогоЗадания);
	
	ФоновоеЗаданиеМонитораАдресРезультата = Результат.АдресХранилища;
	ФоновоеЗаданиеМонитораИдентификатор   = Результат.ИдентификаторЗадания;
	
	Если Результат.ЗаданиеВыполнено Тогда
		ОбновитьМониторНаСервере();
		МониторАктуален = Истина;
		УправлениеФормой(ЭтаФорма);
	Иначе
		// Начнем ждать
		ФоновоеЗаданиеМонитораЗапущено = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентенаСервереБезКонтекста
Процедура ОбновитьЗаголовкиПериодов(Форма)
	
	// Обновим заголовки периодов
	Форма.ПериодДата = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'на %1'"), Формат(Форма.ТекущаяДата, "ДФ='д ММММ'"));
	
	НачалоПериода = ДобавитьМесяц(Форма.ТекущаяДата,-1) + 60*60*24; 
	КонецПериода 		= Форма.ТекущаяДата;
	
	Если Месяц(НачалоПериода) = Месяц(КонецПериода) Тогда
		ФорматНачалаПериода =  "ДФ=д";
	Иначе
		ФорматНачалаПериода =  "ДФ='д ММММ'";
	КонецЕсли;
	
	Форма.ПериодМесяц = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'с %1 по %2'"), Формат(НачалоПериода, ФорматНачалаПериода), Формат(КонецПериода, "ДФ='д ММММ'"));	
	
	Форма.Элементы.ДекорацияЕдиницаИзмерения.Заголовок = ?(Форма.ВариантОкругления = 1, НСтр("ru = 'Руб'"), НСтр("ru = 'Тыс. руб'"));
	
	// Запоминаем начало периода
	Форма.НачалоПериодаМесяцНазад = НачалоПериода;
	
КонецПроцедуры

&НаКлиентеНаСерверебезКонтекста
Функция ПользовательскиеНастройкиДляРасшифровки(Форма)
	
	// Инициализация пользовательских настроек
	// Добавим в настройки все параметры которые могут использоваться в отчетах руководителю
	ПользовательскиеНастройки = Новый ПользовательскиеНастройкиКомпоновкиДанных;
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	ДополнительныеСвойства.Вставить("РежимРасшифровки",	Истина);
	ДополнительныеСвойства.Вставить("Организация", 		Форма.Организация);
	ДополнительныеСвойства.Вставить("НачалоПериода", 	Форма.НачалоПериодаМесяцНазад);
	ДополнительныеСвойства.Вставить("КонецПериода", 	Форма.ТекущаяДата);
	ДополнительныеСвойства.Вставить("Период", 			Форма.ТекущаяДата);
	
	Если Форма.ВариантОкругления = 1000 Тогда
		
		// Установим формат цифр для рублевых сумм
		УсловноеОформление = ПользовательскиеНастройки.Элементы.Добавить(Тип("УсловноеОформлениеКомпоновкиДанных"));
		УсловноеОформление.ИдентификаторПользовательскойНастройки = "УсловноеОформление";
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		ЭлементУсловногоОформления.Представление = НСтр("ru = 'Суммы в тыс.'");
		БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(ЭлементУсловногоОформления.Оформление,"Формат", "ЧДЦ=; ЧС=3");
		ЭлементУсловногоОформления.Использование = Истина;
		
	КонецЕсли;
	
	Возврат ПользовательскиеНастройки;
	
КонецФункции

&НаКлиентеНаСерверебезКонтекста
Функция СтандартныеГруппировкиДенежныхСредств()
	
	ГруппировкаОтчета = Новый Массив;
	ГруппировкаОтчета.Добавить(Новый Структура("Поле, Представление, Использование, ТипГруппировки", "ВидДенежныхСредств", "Вид денежных средств", Истина, 0));
	ГруппировкаОтчета.Добавить(Новый Структура("Поле, Представление, Использование, ТипГруппировки", "Размещение", "Размещение", Истина, 0));
	Возврат ГруппировкаОтчета;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьОтчет(Отчет, ГруппировкаОтчета = Неопределено, Отборы = Неопределено, Показатели  = Неопределено, КлючВарианта = Неопределено)

	ПользовательскиеНастройки = ПользовательскиеНастройкиДляРасшифровки(ЭтотОбъект);
	ДополнительныеСвойства = ПользовательскиеНастройки.ДополнительныеСвойства;
	
	Если ГруппировкаОтчета <> Неопределено И ТипЗнч(ГруппировкаОтчета) = Тип("Массив") Тогда
		ДополнительныеСвойства.Вставить("Группировка", ГруппировкаОтчета);
	КонецЕсли;
	
	Если Отборы <> Неопределено И ТипЗнч(Отборы) = Тип("Массив") Тогда
		НастройкаОтбора = ПользовательскиеНастройки.Элементы.Добавить(Тип("ОтборКомпоновкиДанных"));
		НастройкаОтбора.ИдентификаторПользовательскойНастройки = "Отбор";
		Для Каждого Отбор Из Отборы Цикл
			БухгалтерскиеОтчетыКлиентСервер.ДобавитьОтбор(НастройкаОтбора, Отбор.Поле, Отбор.Значение, Отбор.ВидСравнения);
		КонецЦикла;
	КонецЕсли;
	
	Если Показатели <> Неопределено И ТипЗнч(Показатели) = Тип("Массив") Тогда
		
		Для Каждого Показатель Из Показатели Цикл
			ДополнительныеСвойства.Вставить(Показатель, Истина);
		КонецЦикла;
		
	КонецЕсли;
	
	Если КлючВарианта <> Неопределено Тогда
		ДополнительныеСвойства.Вставить("КлючВарианта", КлючВарианта);
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("РежимРасшифровки"         , Истина);
	ПараметрыОтчета.Вставить("ВидРасшифровки"           , 2);
	ПараметрыОтчета.Вставить("ПользовательскиеНастройки", ПользовательскиеНастройки);
	
	ОткрытьФорму(Отчет, ПараметрыОтчета, ЭтотОбъект, Истина);

КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоПутиЭлементаФормы(Путь)
	
	Данные = Неопределено;
	ПозицияОткрывающейСкобки = Найти(Путь, "[");
	ПозицияЗакрывающейСкобки = Найти(Путь, "]");
	
	ИмяТаблицы 	= Лев(Путь, ПозицияОткрывающейСкобки - 1);
	ИндексСтроки = Число(Сред(Путь, ПозицияОткрывающейСкобки + 1, ПозицияЗакрывающейСкобки - ПозицияОткрывающейСкобки - 1));
	
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		
		Таблица = ЭтотОбъект[ИмяТаблицы];
		
		Если Таблица.Количество() > ИндексСтроки  Тогда
			Данные = Таблица[ИндексСтроки];
		Конецесли;
		
	КонецЕсли;
	
	Возврат Данные;
	
КонецФункции

#Область ОстаткиДенежныхСредств

&НаСервере
Процедура ЗаполнитьОстаткиДенежныхСредств(ДанныеМонитора)
	
	ТаблицаДС = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ОстаткиДенежныхСредства.Очистить();
	ИтогоДенежныхСредств = 0;
	
	Если ТаблицаДС <> Неопределено Тогда
		
		// Подготовим переменные которые будем использовать при заполнении таблицы остатков
		ПредставлениеДляВалютныхСчетов 	= НСтр("ru = 'На счетах в '");
		ПредставлениеДляРублевыхСчетов 	= НСтр("ru = 'На рублевых счетах'");
		СтрокаИтого 					= НСтр("ru = 'Итого'");
		СтрокаВКассе 					= НСтр("ru = 'В кассе'");
		ВалютаРегламентированногоУчета 	= ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
		
		// Заполняем таблицу остатков ДС
		Для Каждого Остаток Из ТаблицаДС Цикл
			Валюта = Остаток.ДанныеРасшифровки;
			ОстатокПредставление = Остаток.Представление;
			// Если это итоговая строка то запишем итог
			Если Не ЗначениеЗаполнено(Валюта) И ОстатокПредставление = СтрокаИтого Тогда
				ИтогоДенежныхСредств = Остаток.Сумма;
			Иначе
				СтрокаДС = ОстаткиДенежныхСредства.Добавить();
				Если Валюта = ВалютаРегламентированногоУчета Тогда
					Если ОстатокПредставление <> СтрокаВКассе Тогда
						ОстатокПредставление 	= ПредставлениеДляРублевыхСчетов;
					КонецЕсли;
				Иначе
					ОстатокПредставление 	= ПредставлениеДляВалютныхСчетов + Остаток.Представление;
					СтрокаДС.ПредставлениеВалютнойСуммы = "" + Остаток.СуммаВВалюте + " " + Остаток.Представление;
				КонецЕсли;
				
				СтрокаДС.Представление 	= ОстатокПредставление;
				СтрокаДС.Валюта 		= Валюта;
				СтрокаДС.Сумма			= Остаток.Сумма;
				СтрокаДС.СуммаВВалюте	= Остаток.СуммаВВалюте;
			КонецЕсли;	
			
		КонецЦикла;	
	КонецЕсли;
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();	
	МаксимальныйИндексТаблицы = ОстаткиДенежныхСредства.Количество() - 1;
	// Установим видимость заранее добавленных строк (их 4)
	Для Индекс = 0 По 3 Цикл
		
		Если Индекс <= МаксимальныйИндексТаблицы Тогда
			
			ВидимостьСтроки = Истина;
			
			// Если это видимая строки то нужно дополнительно установить видимость валютной суммы
			// Для рублей валютная сумма не нужна
			Если ОстаткиДенежныхСредства[Индекс].Валюта = ВалютаРегламентированногоУчета Тогда
				ВидимостьВалютнойСуммы = Ложь;
			Иначе
				ВидимостьВалютнойСуммы = Истина;
			Конецесли;
			
		Иначе
			ВидимостьСтроки = Ложь;
			ВидимостьВалютнойСуммы = Ложь;
		Конецесли;
		
		Элементы["ОстаткиДенежныхСредствСтрока" + (Индекс + 1)].Видимость 	= ВидимостьСтроки;
		Элементы["ВалютнаяСуммаСтрока" + (Индекс + 1)].Видимость 			= ВидимостьВалютнойСуммы;
		
	КонецЦикла;	
	
	// Если размер таблицы превышает количество заранее подготовленных элементов
	// для ее отображения, то добавим эти элеметы программно
	// Заранее подготовленных элементов 4, для большинства случаев должно хватить
	// 1 В кассе
	// 2 На рублевых счетах
	// 3 На счетах в EUR
	// 4 На счетах в USD
	
	// Если на форме уже есть программно добавленные группы и элементы то их нужно сначала удалить
	// Возможно они больше не нужны
	ЕстьГруппыДляУдаления = Истина;
	ЕстьЭлементыДляУдаления = Истина;
	СчетчикЭлементов = 5;
	Пока ЕстьГруппыДляУдаления ИЛИ ЕстьЭлементыДляУдаления Цикл
		
		// Ищем строки
		УдаляемаяГруппа = Элементы.Найти("ОстаткиДенежныхСредствСтрока" + СчетчикЭлементов);
		
		Если УдаляемаяГруппа <> Неопределено Тогда
			// Удаляем группу
			Элементы.Удалить(УдаляемаяГруппа);
		Иначе
			// Если группа строки не найдена заканчиваем поиск
			ЕстьГруппыДляУдаления = Ложь;
		КонецЕсли;	
		
		// Ищем элементы
		УдаляемыйЭлемент = Элементы.Найти("ВалютнаяСуммаСтрока" + СчетчикЭлементов);
		
		Если УдаляемыйЭлемент <> Неопределено Тогда
			// Удаляем элемент
			Элементы.Удалить(УдаляемыйЭлемент);
		Иначе
			// Если элемент не найден заканчиваем поиск
			ЕстьЭлементыДляУдаления = Ложь;
		КонецЕсли;	
		
		СчетчикЭлементов = СчетчикЭлементов + 1;
		
	КонецЦикла;	
	
	// Подготовим переменные которые будем использовать
	ГруппаОстаткиДенежныхСредств = Элементы.ОстаткиДенежныхСредств;
	ШрифтТекстаМонитора = ШрифтыСтиля.ШрифтТекстаМонитораРуководителя;
	ЦветТекстаВалюты 	= ЦветаСтиля.ЦветВторостепенногоТекстаМонитораРуководителя;
	Для СчетчикСтрок = 4 по ОстаткиДенежныхСредства.Количество() - 1 Цикл 
		
		// Нумерация групп на 1 больше чем индекс строки таблицы ОстаткиДенежныхСредства
		СчетчикЭлементов = СчетчикСтрок + 1;
		
		// Добавляем группу строки и заполеняем ее свойства
		ОстаткиДенежныхСредствСтрока = Элементы.Добавить("ОстаткиДенежныхСредствСтрока" + СчетчикЭлементов, Тип("ГруппаФормы"), ГруппаОстаткиДенежныхСредств);  
		ОстаткиДенежныхСредствСтрока.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ОстаткиДенежныхСредствСтрока.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
		ОстаткиДенежныхСредствСтрока.Отображение = ОтображениеОбычнойГруппы.Нет;
		ОстаткиДенежныхСредствСтрока.ОтображатьЗаголовок = Ложь;
		
		// Добавляем элементы строки
		// Представление
		ПредставлениеОстаткиДенежныхСредствСтрока 				= Элементы.Добавить("ПредставлениеОстаткиДенежныхСредствСтрока" + СчетчикЭлементов, Тип("ПолеФормы"), ОстаткиДенежныхСредствСтрока);  
		ПредставлениеОстаткиДенежныхСредствСтрока.Вид 			= ВидПоляФормы.ПолеНадписи;
		ПредставлениеОстаткиДенежныхСредствСтрока.Шрифт 		= ШрифтТекстаМонитора;
		ПредставлениеОстаткиДенежныхСредствСтрока.ПутьКДанным 	= "ОстаткиДенежныхСредства[" + СчетчикСтрок + "].Представление";
		ПредставлениеОстаткиДенежныхСредствСтрока.РастягиватьПоГоризонтали 	= Истина;
		ПредставлениеОстаткиДенежныхСредствСтрока.Гиперссылка				= Истина;
		ПредставлениеОстаткиДенежныхСредствСтрока.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;					
		ПредставлениеОстаткиДенежныхСредствСтрока.УстановитьДействие("Нажатие","ОстаткиДенежныхСредствНажатие");
		
		// Сумма
		ПредставлениеОстаткиДенежныхСредствСтрока 				= Элементы.Добавить("СуммаОстаткиДенежныхСредствСтрока" + СчетчикСтрок + 1, Тип("ПолеФормы"), ОстаткиДенежныхСредствСтрока);  
		ПредставлениеОстаткиДенежныхСредствСтрока.Вид 			= ВидПоляФормы.ПолеНадписи;
		ПредставлениеОстаткиДенежныхСредствСтрока.Шрифт 		= ШрифтТекстаМонитора;
		ПредставлениеОстаткиДенежныхСредствСтрока.ПутьКДанным 	= "ОстаткиДенежныхСредства[" + СчетчикСтрок + "].Сумма";
		ПредставлениеОстаткиДенежныхСредствСтрока.Ширина 		= 11;
		ПредставлениеОстаткиДенежныхСредствСтрока.РастягиватьПоГоризонтали 	= Ложь;
		ПредставлениеОстаткиДенежныхСредствСтрока.ПоложениеЗаголовка 		= ПоложениеЗаголовкаЭлементаФормы.Нет;
		ПредставлениеОстаткиДенежныхСредствСтрока.ГоризонтальноеПоложение 	= ГоризонтальноеПоложениеЭлемента.Право;
		ПредставлениеОстаткиДенежныхСредствСтрока.Формат = "ЧН=0";
		
		// Добавляем валютную сумму
		ВалютнаяСуммаСтрока 							= Элементы.Добавить("ВалютнаяСуммаСтрока" + СчетчикЭлементов, Тип("ПолеФормы"), ГруппаОстаткиДенежныхСредств);  
		ВалютнаяСуммаСтрока.Вид 						= ВидПоляФормы.ПолеНадписи;
		ВалютнаяСуммаСтрока.ПутьКДанным 				= "ОстаткиДенежныхСредства[" + СчетчикСтрок + "].ПредставлениеВалютнойСуммы";
		ВалютнаяСуммаСтрока.РастягиватьПоГоризонтали 	= Истина;
		ВалютнаяСуммаСтрока.ПоложениеЗаголовка 			= ПоложениеЗаголовкаЭлементаФормы.Нет;					
		ВалютнаяСуммаСтрока.ГоризонтальноеПоложение 	= ГоризонтальноеПоложениеЭлемента.Право;
		ВалютнаяСуммаСтрока.ЦветТекста 					= ЦветТекстаВалюты;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаСервере
Функция ОтборПоСтрокеДенежныхСредств(ИмяЭлемента)

	ДанныеСтроки = Неопределено;
	
	Элемент = Элементы[ИмяЭлемента];
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		ДанныеСтроки = ПолучитьДанныеПоПутиЭлементаФормы(Элемент.ПутьКДанным);
	КонецЕсли;
	
	Отборы = Новый Массив;
	
	Если ДанныеСтроки <> Неопределено Тогда
		// Добавляем отбор по виду денежных средств
		// Варианта всего 2
		// - В кассе
		// - На счетах
		Если ДанныеСтроки.Представление = "В кассе" Тогда
			Отборы.Добавить(Новый Структура("Поле, Значение, ВидСравнения","ВидДенежныхСредств", "Деньги в кассе", ВидСравненияКомпоновкиДанных.Равно));
		Иначе
			Отборы.Добавить(Новый Структура("Поле, Значение, ВидСравнения","ВидДенежныхСредств", "Деньги на расчетных счетах", ВидСравненияКомпоновкиДанных.Равно));
		КонецЕсли;
		// Если данные не в рублях то нужно установить отбор по валюте
		Если ДанныеСтроки.Валюта <> ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета() Тогда
			Отборы.Добавить(Новый Структура("Поле, Значение, ВидСравнения","Валюта", ДанныеСтроки.Валюта, ВидСравненияКомпоновкиДанных.Равно));
		КонецЕсли;
	// Не удалось определить данные строки, просто откроем отчет, 
	// подотчет в мониторе не показывается поэтому убираем его и из расшифровки	
	Иначе
		Отборы.Добавить(Новый Структура("Поле, Значение, ВидСравнения","ВидДенежныхСредств", "Деньги у подотчетных лиц", ВидСравненияКомпоновкиДанных.НеРавно));
	КонецЕсли;
	
	Возврат Отборы;
	
КонецФункции

#КонецОбласти

#Область ДвижениеДенежныхСредств

&НаСервере
Процедура ЗаполнитьДвижениеДенежныхСредств(ДанныеМонитора)
	
	ДвижениеДС = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ПоступлениеДенежныхСредствСумма = 0;
	РасходДенежныхСредствСумма = 0;
	Если ДвижениеДС <> Неопределено Тогда
		
		Для Каждого Движение Из ДвижениеДС Цикл
			
			Если Движение.Представление = "Поступление" Тогда
				ПоступлениеДенежныхСредствСумма = ПоступлениеДенежныхСредствСумма + Движение.Сумма;
			ИначеЕсли Движение.Представление = "Расход" Тогда
				РасходДенежныхСредствСумма = РасходДенежныхСредствСумма + Движение.Сумма;
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПродажиПоКонтрагентам

&НаСервере
Процедура ЗаполнитьПродажиПоКонтрагентам(ДанныеМонитора)
	
	Продажи = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ПродажиПоКонтрагентам.Очистить();
	ИтогоПродажиПоКонтрагентам = 0;
	
	Если Продажи <> Неопределено Тогда
		
		СтрокаИтого = НСтр("ru = 'Итого'");
		Счетчик = 0;
		// Заполняем таблицу продаж
		Для Каждого СтрокаПродаж Из Продажи Цикл
			
			// Если это итоговая строка то запишем итог
			Если НЕ ЗначениеЗаполнено(СтрокаПродаж.ДанныеРасшифровки) И СтрокаПродаж.Представление = СтрокаИтого Тогда
				ИтогоПродажиПоКонтрагентам = СтрокаПродаж.Сумма;
			Иначе
				СтрокаПродажиПоКонтрагентам	= ПродажиПоКонтрагентам.Добавить();
				
				СтрокаПродажиПоКонтрагентам.Контрагент 	= СтрокаПродаж.ДанныеРасшифровки;
				СтрокаПродажиПоКонтрагентам.Сумма 		= СтрокаПродаж.Сумма;
				Счетчик = Счетчик + 1;
			КонецЕсли;
			
			// нас интересуют 3 крупнейших
			Если Счетчик >= 3 Тогда
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
	МаксимальныйИндексТаблицы = ПродажиПоКонтрагентам.Количество() - 1;
	// Установим видимость заранее добавленных строк (их 3)
	Для Индекс = 0 По 2 Цикл
		
		Если Индекс <= МаксимальныйИндексТаблицы Тогда
			ВидимостьСтроки = Истина;
		Иначе
			ВидимостьСтроки = Ложь;
		Конецесли;
		
		Элементы["ПродажиПоКонтрагентамСтрока" + (Индекс + 1)].Видимость 	= ВидимостьСтроки;
		
	КонецЦикла;	
	
	Если МаксимальныйИндексТаблицы >= 1 Тогда
		// Покажем строку В том числе
		Элементы.ПродажиПоКонтрагентамВтомЧисле.Видимость = Истина;
	Иначе
		// Скроем строку В том числе	
		Элементы.ПродажиПоКонтрагентамВтомЧисле.Видимость = Ложь;
	КонецЕсли;
	
	
КонецПроцедуры

&НаСервере
Функция ОтборПоСтрокеПродажиПоКонтрагентам(ИмяЭлемента)

	ДанныеСтроки = Неопределено;
	
	Элемент = Элементы[ИмяЭлемента];
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		ДанныеСтроки = ПолучитьДанныеПоПутиЭлементаФормы(Элемент.ПутьКДанным);
	КонецЕсли;
	
	Отборы = Новый Массив;
	
	Если ДанныеСтроки <> Неопределено Тогда
		Отборы.Добавить(Новый Структура("Поле, Значение, ВидСравнения","Контрагент", ДанныеСтроки.Контрагент, ВидСравненияКомпоновкиДанных.Равно));
	КонецЕсли;
	
	Возврат Отборы;
	
КонецФункции

#КонецОбласти

#Область ПродажиПоНоменклатурнымГруппам

&НаСервере
Процедура ЗаполнитьПродажиПоНоменклатурнымГруппам(ДанныеМонитора)
	
	Продажи = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ПродажиПоНоменклатурнымГруппам.Очистить();
	ИтогоПродажиПоНоменклатурнымГруппам = 0;
	
	Если Продажи <> Неопределено Тогда
		
		СтрокаИтого = НСтр("ru = 'Итого'");
		Счетчик = 0;
		// Заполняем таблицу продаж
		Для Каждого СтрокаПродаж Из Продажи Цикл
			
			// Если это итоговая строка то запишем итог
			Если НЕ ЗначениеЗаполнено(СтрокаПродаж.ДанныеРасшифровки) И СтрокаПродаж.Представление = СтрокаИтого Тогда
				ИтогоПродажиПоНоменклатурнымГруппам = СтрокаПродаж.Сумма;
			Иначе
				СтрокаПродажиПоНомГруппам	= ПродажиПоНоменклатурнымГруппам.Добавить();
				
				СтрокаПродажиПоНомГруппам.НоменклатурнаяГруппа 		= СтрокаПродаж.ДанныеРасшифровки;
				СтрокаПродажиПоНомГруппам.Сумма 					= СтрокаПродаж.Сумма;
				Счетчик = Счетчик + 1;
			КонецЕсли;
			
			// нас интересуют 3 крупнейших
			Если Счетчик >= 3 Тогда
				Прервать;
			КонецЕсли;	
			
		КонецЦикла;	
		
	КонецЕсли;
	
	МаксимальныйИндексТаблицы = ПродажиПоНоменклатурнымГруппам.Количество() - 1;
	// Установим видимость заранее добавленных строк (их 3)
	Для Индекс = 0 По 2 Цикл
		
		Если Индекс <= МаксимальныйИндексТаблицы Тогда
			ВидимостьСтроки = Истина;
		Иначе
			ВидимостьСтроки = Ложь;
		Конецесли;
		
		Элементы["ПродажиПоНоменклатурнымГруппамСтрока" + (Индекс + 1)].Видимость 	= ВидимостьСтроки;
		
	КонецЦикла;	
	
	Если МаксимальныйИндексТаблицы >= 1 Тогда
		// Покажем строку В том числе
		Элементы.ПродажиПоНоменклатурнымГруппамВтомЧисле.Видимость = Истина;
	Иначе
		// Скроем строку В том числе	
		Элементы.ПродажиПоНоменклатурнымГруппамВтомЧисле.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтборПоСтрокеПродажиПоНоменклатурнымГруппам(ИмяЭлемента)

	ДанныеСтроки = Неопределено;
	
	Элемент = Элементы[ИмяЭлемента];
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		ДанныеСтроки = ПолучитьДанныеПоПутиЭлементаФормы(Элемент.ПутьКДанным);
	КонецЕсли;
	
	Отборы = Новый Массив;
	
	Если ДанныеСтроки <> Неопределено Тогда
		Отборы.Добавить(Новый Структура("Поле, Значение, ВидСравнения","НоменклатурнаяГруппа", ДанныеСтроки.НоменклатурнаяГруппа, ВидСравненияКомпоновкиДанных.Равно));
	КонецЕсли;
	
	Возврат Отборы;
	
КонецФункции

#КонецОбласти

#Область НеоплаченныеСчетаПокупателям

&НаСервере
Процедура ЗаполнитьНеоплаченныеСчетаПокупателям(ДанныеМонитора)
	
	ТаблицаНеоплаченныхСчетов = ДанныеМонитора.Выгрузить();
	
	НеоплаченныеСчетаПокупателям.Очистить();
	ИтогоСуммаНеоплаченныхСчетовПокупателям = 0;
	
	Если ТаблицаНеоплаченныхСчетов <> Неопределено Тогда
		
		Для Каждого НеоплаченныйСчет Из ТаблицаНеоплаченныхСчетов Цикл
			
			Если НЕ ЗначениеЗаполнено(НеоплаченныйСчет.ДанныеРасшифровки) И НеоплаченныйСчет.Представление = НСтр("ru='Итого'") Тогда
				ИтогоСуммаНеоплаченныхСчетовПокупателям = НеоплаченныйСчет.Сумма;
			Иначе
				СтрокаРасшифровки                            = НеоплаченныеСчетаПокупателям.Добавить();
				СтрокаРасшифровки.Представление              = НеоплаченныйСчет.Представление;
				СтрокаРасшифровки.Ссылка                     = НеоплаченныйСчет.ДанныеРасшифровки;
				СтрокаРасшифровки.Сумма                      = НеоплаченныйСчет.Сумма;
				СтрокаРасшифровки.СуммаВВалюте               = НеоплаченныйСчет.СуммаВВалюте;
				СтрокаРасшифровки.ПредставлениеВалютнойСуммы = "" + НеоплаченныйСчет.СуммаВВалюте + " " + НеоплаченныйСчет.Валюта;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	КоличествоСтрокТаблицыНеоплаченныхСчетов = ТаблицаНеоплаченныхСчетов.Количество();
	
	Для Индекс = 1 По 3 Цикл
		ВидимостьСтроки = Индекс < КоличествоСтрокТаблицыНеоплаченныхСчетов;
		Элементы["НеоплаченныеСчетаПокупателейСтрока" + (Индекс)].Видимость = ВидимостьСтроки;
		Если ВидимостьСтроки Тогда
			ЭтоВалютныйСчет = ТаблицаНеоплаченныхСчетов[Индекс].СуммаВВалюте > 0;
			Элементы["ВалютнаяСуммаСчетаСтрока" + (Индекс)].Видимость = ЭтоВалютныйСчет;
		КонецЕсли;
	КонецЦикла;
	
	ВидимостьГруппыВТомЧисле = КоличествоСтрокТаблицыНеоплаченныхСчетов > 0;
	Элементы.НеоплаченныеСчетаПокупателейВтомЧисле.Видимость = ВидимостьГруппыВТомЧисле;
	
КонецПроцедуры

#КонецОбласти

#Область ЗадолженностьПокупателей

&НаСервере
Процедура ЗаполнитьЗадолженностьПокупателей(ДанныеМонитора)
	
	ТаблицаЗадолжености = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ЗадолженостьПокупателей.Очистить();
	ИтогоЗадолженностьПокупателей = 0;
	
	Если ТаблицаЗадолжености <> Неопределено Тогда
		
		СтрокаИтого = НСтр("ru = 'Итого'");
		Счетчик = 0;
		// Заполняем таблицу продаж
		Для Каждого СтрокаЗадолженности Из ТаблицаЗадолжености Цикл
			
			// Если это итоговая строка то запишем итог
			Если НЕ ЗначениеЗаполнено(СтрокаЗадолженности.ДанныеРасшифровки) И СтрокаЗадолженности.Представление = СтрокаИтого Тогда
				ИтогоЗадолженностьПокупателей = СтрокаЗадолженности.Сумма;
			Иначе
				СтрокаЗадолженностьПокупателей	= ЗадолженостьПокупателей.Добавить();
				
				СтрокаЗадолженностьПокупателей.Контрагент 	= СтрокаЗадолженности.ДанныеРасшифровки;
				СтрокаЗадолженностьПокупателей.Сумма 		= СтрокаЗадолженности.Сумма;
				Счетчик = Счетчик + 1;
			КонецЕсли;
			
			// нас интересуют 3 крупнейших
			Если Счетчик >= 3 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	МаксимальныйИндексТаблицы = ЗадолженостьПокупателей.Количество() - 1;
	// Установим видимость заранее добавленных строк (их 3)
	Для Индекс = 0 По 2 Цикл
		
		Если Индекс <= МаксимальныйИндексТаблицы Тогда
			ВидимостьСтроки = Истина;
		Иначе
			ВидимостьСтроки = Ложь;
		Конецесли;
		
		Элементы["ЗадолженностьПокупателейСтрока" + (Индекс + 1)].Видимость 	= ВидимостьСтроки;
		
	КонецЦикла;	
	
	Если МаксимальныйИндексТаблицы >= 1 Тогда
		// Покажем строку В том числе
		Элементы.ЗадолженностьПокупателейВтомЧисле.Видимость = Истина;
	Иначе
		// Скроем строку В том числе	
		Элементы.ЗадолженностьПокупателейВтомЧисле.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтборПоКонтрагенту(ИмяЭлемента)

	ДанныеСтроки = Неопределено;
	
	Элемент = Элементы[ИмяЭлемента];
	Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
		ДанныеСтроки = ПолучитьДанныеПоПутиЭлементаФормы(Элемент.ПутьКДанным);
	КонецЕсли;
	
	Отборы = Новый Массив;
	
	Если ДанныеСтроки <> Неопределено Тогда
		Отборы.Добавить(Новый Структура("Поле, Значение, ВидСравнения","Контрагент", ДанныеСтроки.Контрагент, ВидСравненияКомпоновкиДанных.Равно));
	КонецЕсли;
	
	Возврат Отборы;
	
КонецФункции

#КонецОбласти

#Область ПросроченнаяЗадолженностьПокупателей

&НаСервере
Процедура ЗаполнитьПросроченнуюЗадолженностьПокупателей(ДанныеМонитора)
	
	ТаблицаЗадолжености = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ПросроченнаяЗадолженостьПокупателей.Очистить();
	ИтогоПросроченнаяЗадолженностьПокупателей = 0;
	
	Если ТаблицаЗадолжености <> Неопределено Тогда
		
		СтрокаИтого = НСтр("ru = 'Итого'");
		Счетчик = 0;
		// Заполняем таблицу продаж
		Для Каждого СтрокаЗадолженности Из ТаблицаЗадолжености Цикл
			
			// Если это итоговая строка то запишем итог
			Если НЕ ЗначениеЗаполнено(СтрокаЗадолженности.ДанныеРасшифровки) И СтрокаЗадолженности.Представление = СтрокаИтого Тогда
				ИтогоПросроченнаяЗадолженностьПокупателей = СтрокаЗадолженности.Сумма;
			Иначе
				СтрокаЗадолженостьПокупателей	= ПросроченнаяЗадолженостьПокупателей.Добавить();
				
				СтрокаЗадолженостьПокупателей.Контрагент 	= СтрокаЗадолженности.ДанныеРасшифровки;
				СтрокаЗадолженостьПокупателей.Сумма 		= СтрокаЗадолженности.Сумма;
				Счетчик = Счетчик + 1;
			КонецЕсли;
			
			// нас интересуют 3 крупнейших
			Если Счетчик >= 3 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	МаксимальныйИндексТаблицы = ПросроченнаяЗадолженостьПокупателей.Количество() - 1;
	// Установим видимость заранее добавленных строк (их 3)
	Для Индекс = 0 По 2 Цикл
		
		Если Индекс <= МаксимальныйИндексТаблицы Тогда
			ВидимостьСтроки = Истина;
		Иначе
			ВидимостьСтроки = Ложь;
		Конецесли;
		
		Элементы["ПросроченнаяЗадолженностьПокупателейСтрока" + (Индекс + 1)].Видимость 	= ВидимостьСтроки;
		
	КонецЦикла;	
	
	Если МаксимальныйИндексТаблицы >= 1 Тогда
		// Покажем строку В том числе
		Элементы.ПросроченнаяЗадолженностьПокупателейВтомЧисле.Видимость = Истина;
	Иначе
		// Скроем строку В том числе	
		Элементы.ПросроченнаяЗадолженностьПокупателейВтомЧисле.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ЗадолженностьПоставщикам

&НаСервере
Процедура ЗаполнитьЗадолженностьПоставщикам(ДанныеМонитора)
	
	ТаблицаЗадолжености = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ЗадолженностьПоставщикам.Очистить();
	ИтогоЗадолженностьПоставщикам = 0;
	
	Если ТаблицаЗадолжености <> Неопределено Тогда
		
		СтрокаИтого = НСтр("ru = 'Итого'");
		Счетчик = 0;
		// Заполняем таблицу продаж
		Для Каждого СтрокаЗадолженности Из ТаблицаЗадолжености Цикл
			
			// Если это итоговая строка то запишем итог
			Если НЕ ЗначениеЗаполнено(СтрокаЗадолженности.ДанныеРасшифровки) И СтрокаЗадолженности.Представление = СтрокаИтого Тогда
				ИтогоЗадолженностьПоставщикам = СтрокаЗадолженности.Сумма;
			Иначе
				СтрокаЗадолженностьПоставщикам	= ЗадолженностьПоставщикам.Добавить();
				
				СтрокаЗадолженностьПоставщикам.Контрагент 	= СтрокаЗадолженности.ДанныеРасшифровки;
				СтрокаЗадолженностьПоставщикам.Сумма 		= СтрокаЗадолженности.Сумма;
				Счетчик = Счетчик + 1;
			КонецЕсли;
			
			// нас интересуют 3 крупнейших
			Если Счетчик >= 3 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	МаксимальныйИндексТаблицы = ЗадолженностьПоставщикам.Количество() - 1;
	// Установим видимость заранее добавленных строк (их 3)
	Для Индекс = 0 По 2 Цикл
		
		Если Индекс <= МаксимальныйИндексТаблицы Тогда
			ВидимостьСтроки = Истина;
		Иначе
			ВидимостьСтроки = Ложь;
		Конецесли;
		
		Элементы["ЗадолженностьПоставщикамСтрока" + (Индекс + 1)].Видимость = ВидимостьСтроки;
		
	КонецЦикла;	
	
	Если МаксимальныйИндексТаблицы >= 1 Тогда
		// Покажем строку В том числе
		Элементы.ЗадолженностьПоставщикамВтомЧисле.Видимость = Истина;
	Иначе
		// Скроем строку В том числе	
		Элементы.ЗадолженностьПоставщикамВтомЧисле.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ПросроченнаяЗадолженностьПоставщикам

&НаСервере
Процедура ЗаполнитьПросроченнуюЗадолженностьПоставщикам(ДанныеМонитора)
	
	ТаблицаЗадолжености = ДанныеМонитора.Выгрузить(ОбходРезультатаЗапроса.Прямой);
	
	ПросроченнаяЗадолженостьПоставщикам.Очистить();
	ИтогоПросроченнаяЗадолженностьПоставщикам = 0;
	
	Если ТаблицаЗадолжености <> Неопределено Тогда
		
		СтрокаИтого = НСтр("ru = 'Итого'");
		Счетчик = 0;
		// Заполняем таблицу продаж
		Для Каждого СтрокаЗадолженности Из ТаблицаЗадолжености Цикл
			
			// Если это итоговая строка то запишем итог
			Если НЕ ЗначениеЗаполнено(СтрокаЗадолженности.ДанныеРасшифровки) И СтрокаЗадолженности.Представление = СтрокаИтого Тогда
				ИтогоПросроченнаяЗадолженностьПоставщикам = СтрокаЗадолженности.Сумма;
			Иначе
				СтрокаЗадолженностьПоставщикам	= ПросроченнаяЗадолженостьПоставщикам.Добавить();
				
				СтрокаЗадолженностьПоставщикам.Контрагент 	= СтрокаЗадолженности.ДанныеРасшифровки;
				СтрокаЗадолженностьПоставщикам.Сумма 		= СтрокаЗадолженности.Сумма;
				Счетчик = Счетчик + 1;
			КонецЕсли;
			
			// нас интересуют 3 крупнейших
			Если Счетчик >= 3 Тогда
				Прервать;
			КонецЕсли;	
		КонецЦикла;	
		
	КонецЕсли;
	
	МаксимальныйИндексТаблицы = ПросроченнаяЗадолженостьПоставщикам.Количество() - 1;
	// Установим видимость заранее добавленных строк (их 3)
	Для Индекс = 0 По 2 Цикл
		
		Если Индекс <= МаксимальныйИндексТаблицы Тогда
			ВидимостьСтроки = Истина;
		Иначе
			ВидимостьСтроки = Ложь;
		Конецесли;
		
		Элементы["ПросроченнаяЗадолженностьПоставщикамСтрока" + (Индекс + 1)].Видимость = ВидимостьСтроки;
		
	КонецЦикла;	
	
	Если МаксимальныйИндексТаблицы >= 1 Тогда
		// Покажем строку В том числе
		Элементы.ПросроченнаяЗадолженностьПоставщикамВтомЧисле.Видимость = Истина;
	Иначе
		// Скроем строку В том числе	
		Элементы.ПросроченнаяЗадолженностьПоставщикамВтомЧисле.Видимость = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

&НаСервере
Процедура ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(Таблица, КолонкаПредставление, ТабличныйДокумент, Макет)
	
	МакетСтроки 					= Макет.ПолучитьОбласть("СтрокаРаздела");
	МакетСуммыВВалюте 				= Макет.ПолучитьОбласть("СтрокаСуммаВВалюте");
	ВалютаРегламентированногоУчета 	= ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();	
	
	Для Каждого Строка Из Таблица Цикл
		
		МакетСтроки.Параметры.Представление 	= Строка[КолонкаПредставление];
		МакетСтроки.Параметры.Сумма 			= Строка.Сумма;
		ТабличныйДокумент.Вывести(МакетСтроки);
		Если Строка.Свойство("Валюта") И Строка.Валюта <> ВалютаРегламентированногоУчета Тогда
			
			МакетСуммыВВалюте.Параметры.ПредставлениеСуммыВВалюте = Строка.ПредставлениеВалютнойСуммы;
			ТабличныйДокумент.Вывести(МакетСуммыВВалюте);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеДляПечатиРазделМонитора(Раздел, ТабличныйДокумент, Макет)
	
	ЗаголовокРаздела = Макет.ПолучитьОбласть("ЗаголовокРаздела");
	
	РазделыМонитора = Перечисления.РазделыМонитораРуководителя; 
	
	Если Раздел.Значение = РазделыМонитора.ОстаткиДенежныхСредств Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма = ИтогоДенежныхСредств;
		ЗаголовокРаздела.Параметры.Период = ПериодДата;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(ОстаткиДенежныхСредства, "Представление", ТабличныйДокумент, Макет);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.ДвижениеДенежныхСредств Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Период = ПериодМесяц;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		МакетСтроки = Макет.ПолучитьОбласть("СтрокаРаздела");
		
		МакетСтроки.Параметры.Представление = НСтр("ru = 'Поступление'");
		МакетСтроки.Параметры.Сумма = ПоступлениеДенежныхСредствСумма;
		ТабличныйДокумент.Вывести(МакетСтроки);
		
		МакетСтроки.Параметры.Представление = НСтр("ru = 'Расход'");
		МакетСтроки.Параметры.Сумма = РасходДенежныхСредствСумма;
		ТабличныйДокумент.Вывести(МакетСтроки);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.ПродажиПоКонтрагентам Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма = ИтогоПродажиПоКонтрагентам;
		ЗаголовокРаздела.Параметры.Период = ПериодМесяц;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		Если Элементы.ПродажиПоКонтрагентамВтомЧисле.Видимость Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ВТомЧисле"));
			
		КонецЕсли;	
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(ПродажиПоКонтрагентам, "Контрагент", ТабличныйДокумент, Макет);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.ПродажиПоНоменклатурнымГруппам Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма = ИтогоПродажиПоНоменклатурнымГруппам;
		ЗаголовокРаздела.Параметры.Период = ПериодМесяц;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		Если Элементы.ПродажиПоНоменклатурнымГруппамВтомЧисле.Видимость Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ВТомЧисле"));
			
		КонецЕсли;	
		
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(ПродажиПоНоменклатурнымГруппам, "НоменклатурнаяГруппа", ТабличныйДокумент, Макет);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.ЗадолженностьПокупателей Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма = ИтогоЗадолженностьПокупателей;
		ЗаголовокРаздела.Параметры.Период = ПериодМесяц;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		Если Элементы.ЗадолженностьПокупателейВтомЧисле.Видимость Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ВТомЧисле"));
			
		КонецЕсли;	
		
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(ЗадолженостьПокупателей, "Контрагент", ТабличныйДокумент, Макет);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.НеоплаченныеСчетаПокупателям Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма     = ИтогоСуммаНеоплаченныхСчетовПокупателям;
		ЗаголовокРаздела.Параметры.Период    = ПериодДата;
		
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		Если Элементы.НеоплаченныеСчетаПокупателейВтомЧисле.Видимость Тогда
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ВТомЧисле"));
		КонецЕсли;
		
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(НеоплаченныеСчетаПокупателям, "Представление", ТабличныйДокумент, Макет);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.ПросроченнаяЗадолженностьПокупателей Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма = ИтогоПросроченнаяЗадолженностьПокупателей;
		ЗаголовокРаздела.Параметры.Период = ПериодМесяц;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		Если Элементы.ПросроченнаяЗадолженностьПокупателейВтомЧисле.Видимость Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ВТомЧисле"));
			
		КонецЕсли;	
		
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(ПросроченнаяЗадолженостьПокупателей, "Контрагент", ТабличныйДокумент, Макет);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.ЗадолженностьПоставщикам Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма = ИтогоЗадолженностьПоставщикам;
		ЗаголовокРаздела.Параметры.Период = ПериодМесяц;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		Если Элементы.ЗадолженностьПоставщикамВтомЧисле.Видимость Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ВТомЧисле"));
			
		КонецЕсли;	
		
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(ЗадолженностьПоставщикам, "Контрагент", ТабличныйДокумент, Макет);
		
	ИначеЕсли Раздел.Значение = РазделыМонитора.ПросроченнаяЗадолженностьПоставщикам Тогда
		
		ЗаголовокРаздела.Параметры.Заголовок = Раздел.Представление;
		ЗаголовокРаздела.Параметры.Сумма = ИтогоЗадолженностьПоставщикам;
		ЗаголовокРаздела.Параметры.Период = ПериодМесяц;
		ТабличныйДокумент.Вывести(ЗаголовокРаздела);
		ТабличныйДокумент.НачатьГруппуСтрок(Раздел.Представление);
		
		Если Элементы.ПросроченнаяЗадолженностьПоставщикамВтомЧисле.Видимость Тогда
			
			ТабличныйДокумент.Вывести(Макет.ПолучитьОбласть("ВТомЧисле"));
			
		КонецЕсли;	
		
		ПодготовитьДанныеДляПечатиТаблицыРазделаМонитора(ПросроченнаяЗадолженостьПоставщикам, "Контрагент", ТабличныйДокумент, Макет);
		
	КонецЕсли;
	
	ТабличныйДокумент.ЗакончитьГруппуСтрок();
	
КонецПроцедуры	

&НаСервере
// Подготавливает данные для печати
// Собитрает данные формы в табличный документ
// Для того чтобы вывести на печать именно то что видит пользователь берем данные из формы а не из регистра
Функция ПодготовитьПарараметрыПечатиМонитораНаСервере()
	
	Макет = ПолучитьОбщийМакет("МониторРуководителя");
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ЗаголовокМонитора");
	
	ОбластьЗаголовок.Параметры.Организация = ?(ЗначениеЗаполнено(Организация), Строка(Организация), "");
	
	ОбластьЗаголовок.Параметры.Сегодня = Формат(ДатаПоследнегоОбновленияМонитора, "ДФ='dd MMMM yyyy ""г."" H:mm'");
	
	ОбластьЗаголовок.Параметры.ЕдиницаИзмерения = ?(ВариантОкругления = 1, НСтр("ru = 'Руб'"), НСтр("ru = 'Тыс. руб'"));

	ТаблицаМонитора = Новый ТабличныйДокумент;
	
	ТаблицаМонитора.Вывести(ОбластьЗаголовок);
	
	СписокРазделов = ХранилищеОбщихНастроек.Загрузить("МониторРуководителя", "СписокРазделовМонитораРуководителя");
	Если СписокРазделов = Неопределено Тогда
		СписокРазделов = МониторРуководителя.СтандартныйСписокРазделовМонитораРуководителя();
	КонецЕсли;
	
	Для Каждого НастройкаРаздела Из СписокРазделов Цикл
		
		Если НастройкаРаздела.Пометка Тогда
			
			ПодготовитьДанныеДляПечатиРазделМонитора(НастройкаРаздела, ТаблицаМонитора, Макет);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ТаблицаМонитора.ТолькоПросмотр      = Истина;
	ТаблицаМонитора.АвтоМасштаб         = Истина;
	ТаблицаМонитора.ОриентацияСтраницы  = ОриентацияСтраницы.Портрет;
	ТаблицаМонитора.ОтображатьЗаголовки = Ложь;
	ТаблицаМонитора.ОтображатьСетку     = Ложь;
	
	ПечатнаяФормаМонитораПуть = ПоместитьВоВременноеХранилище(ТаблицаМонитора, УникальныйИдентификатор);
	
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(Документы.ДокументРасчетовСКонтрагентом.ПустаяСсылка());
	
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТаблицаМонитора, 0, ОбъектыПечати, Документы.ДокументРасчетовСКонтрагентом.ПустаяСсылка());

	Возврат Новый Структура("ПечатнаяФормаМонитораПуть, ОбъектыПечати", ПечатнаяФормаМонитораПуть, ОбъектыПечати.ВыгрузитьЗначения());
	
КонецФункции

#КонецОбласти
