////////////////////////////////////////////////////////////////////////////////
// Отражение зарплаты в бухучете.
// Переопределяемое в пределах библиотеки поведение.
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияПоДокументу(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляПроведения, СтрокаСписокТаблиц) Экспорт
	
	ОтражениеЗарплатыВБухучетеБазовый.СформироватьДвиженияПоДокументу(Движения, Отказ, Организация, ПериодРегистрации, ДанныеДляПроведения, СтрокаСписокТаблиц);

КонецПроцедуры

Процедура СоздатьВТБухучетНачислений(Организация, ПериодРегистрации, ПроцентЕНВД, МенеджерВременныхТаблиц, ДополнительныеПараметры) Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.СоздатьВТБухучетНачислений(Организация, ПериодРегистрации, ПроцентЕНВД, МенеджерВременныхТаблиц, ДополнительныеПараметры);

КонецПроцедуры

Процедура СоздатьВТСведенияОБухучетеЗарплатыСотрудников(МенеджерВременныхТаблиц, ИмяВременнойТаблицы, ИменаПолейВременнойТаблицы = "Сотрудник,Период", Организация = Неопределено, Подразделение = Неопределено) Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.СоздатьВТСведенияОБухучетеЗарплатыСотрудников(МенеджерВременныхТаблиц, ИмяВременнойТаблицы, ИменаПолейВременнойТаблицы, Организация, Подразделение);

КонецПроцедуры

Процедура СоздатьВТСведенияОБухучетеНачислений(МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.СоздатьВТСведенияОБухучетеНачислений(МенеджерВременныхТаблиц);

КонецПроцедуры

Функция РаспределениеСтраховыхВзносовПоИсточникамФинансирования(Движения, Организация, ПериодРегистрации, Ссылка, МенеджерВременныхТаблиц) Экспорт

	Возврат Неопределено;

КонецФункции

Процедура СведенияОБухучетеНачисленийИВзносовПоСтатьямФинансирования(Организация, ПериодРегистрации, МенеджерВременныхТаблиц) Экспорт

	//

КонецПроцедуры

Функция ДанныеДляОтраженияВБухучетеНДФЛПоСтатьямФинансирования(Организация, ПериодРегистрации) Экспорт

	Возврат Неопределено;

КонецФункции

Функция ДанныеДляОтраженияВБухучетеУдержанийПоСтатьямФинансирования(Организация, ПериодРегистрации) Экспорт

	Возврат Неопределено;

КонецФункции

Функция ТекстЗапросаДанныеДокументаОбработкаДокументовОтражениеЗарплатыВБухучете() Экспорт

	Возврат ОтражениеЗарплатыВБухучетеБазовый.ТекстЗапросаДанныеДокументаОбработкаДокументовОтражениеЗарплатыВБухучете();

КонецФункции

Процедура УстановитьСписокВыбораОтношениеКЕНВД(ЭлементФормы, ИмяЭлемента) Экспорт

	// В базовой реализации не устанавливается.

КонецПроцедуры

Процедура ОбновитьВидОперацииУдержаниеПоПрочимОперациямСРаботниками() Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.ОбновитьВидОперацииУдержаниеПоПрочимОперациямСРаботниками();

КонецПроцедуры

Процедура ЗаполнитьВидОперацииПоЗарплатеВНачислениях() Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.ЗаполнитьВидОперацииПоЗарплатеВНачислениях();	

КонецПроцедуры

Процедура ЗаполнитьВидОперацииПоЗарплатеВНачисленияхДляНатуральныхДоходов() Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.ЗаполнитьВидОперацииПоЗарплатеВНачисленияхДляНатуральныхДоходов();	

КонецПроцедуры

Функция НачисленияСДаннымиЕНВДДляСтраховыхВзносовПоСтатьямФинансирования(Организация, МесяцНачисления, ДокументСсылка, ДополнительныеПараметры) Экспорт

	Возврат ОтражениеЗарплатыВБухучетеБазовый.НачисленияСДаннымиЕНВДДляСтраховыхВзносовПоСтатьямФинансирования(Организация, МесяцНачисления, ДокументСсылка, ДополнительныеПараметры);

КонецФункции

Функция ДополнительныеПараметрыДляОтраженияВБухучете() Экспорт

	Возврат ОтражениеЗарплатыВБухучетеБазовый.ДополнительныеПараметрыДляОтраженияВБухучете();

КонецФункции

Процедура ДополнитьНачисленияДаннымиОЕНВД(ДанныеДляПроведения, ДокументСсылка, МесяцНачисления, Организация, ПроверятьЕНВД) Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.ДополнитьНачисленияДаннымиОЕНВД(ДанныеДляПроведения, ДокументСсылка, МесяцНачисления, Организация, ПроверятьЕНВД);
	
КонецПроцедуры

Процедура СоздатьВТНачисленияБазаОтпуска(МенеджерВременныхТаблиц) Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.СоздатьВТНачисленияБазаОтпуска(МенеджерВременныхТаблиц);

КонецПроцедуры

Функция ОстаткиОтпусковДляРасчетаОценочныхОбязательств(Организация, Период) Экспорт

	Возврат ОтражениеЗарплатыВБухучетеБазовый.ОстаткиОтпусковДляРасчетаОценочныхОбязательств(Организация, Период);

КонецФункции

Процедура ОбновитьВидОперацииЕжегодныеОтпуска() Экспорт

	ОтражениеЗарплатыВБухучетеБазовый.ОбновитьВидОперацииЕжегодныеОтпуска();

КонецПроцедуры


#КонецОбласти
